{"title":"DevSecOps Engineer","location":["Remote, Spain"],"attendance":["Remote"],"type":["Full-time"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["DevSecOps Engineer","Security Engineering","Security Solutions","Security Technologies","Security Best Practices","Cloud and Security Tooling","Secure Development Lifecycle","Trusted Security Advisor","DevOps","SRE","TechOps","CloudOps","Python","Java","Kotlin","Go","Rust","Ruby","AWS","Control Tower","Microservices","Service Oriented Architecture","Docker","APIs","CI/CD Pipelines","SAST","DAST","IAST","Code Scanning","Automation","Metrics","Remediation","Vulnerability Management","WAF","IPS","IAM","SIEM","SOAR","DLP","Endpoint","Logging","Key Management","Configuration Management","Security/Engineering Standards","Tooling","Processes","Mentoring","Teaching","Infrastructure Provisioning Tools","CloudFormation","Terraform","Chef","Puppet","Continuous Integration Tools","Jenkins","CircleCI","Communication","Collaboration","Team Player"],"skills":["Python","Java","Docker","CI/CD","SAST","DAST","IAST"],"overview":"Develop, build, and integrate security solutions, establish security best practices, and provide guidance as a trusted security advisor in a fast-paced environment, working with cloud and security tooling, scripting, automation, and popular programming languages, while ensuring the highest levels of security for the organization and its customers.","description":"THE CHALLENGE\nEventbrite is the leading global ticketing and event technology platform, powering over five million live experiences and 300 million tickets every year. We empower creators of events of all shapes and sizes – from music festivals, experiential yoga, political rallies to gaming competitions –– by providing them the tools and resources they need to seamlessly plan, promote, and produce live experiences around the world. While being part of the Security Engineering Team, you’ll be developing, building and integrating various security solutions across the organization. You’ll be developing security requirements, standards and guidelines along with ensuring our security technologies are operating effectively. You will establish the framework around security best practices that sets the foundation for the most complex and business critical areas at Eventbrite.\n\nTHE TEAM\nThe Security Team provides governance, operations, engineering, and technical support throughout the organization. The team works closely with all departments to ensure security measures are operating effectively and that risk is being managed appropriately. We are responsible for data and product security, compliance, back office security, and business enablement. Our goal is to ensure security is operating at the highest levels while unlocking the business to move faster.  \n\nTHE ROLE\nAs part of the Security Team, you will be a self-starter who enjoys a fast paced environment, thrives on problem solving, and is committed to delivering world class security to the organization and our customers. In this position you will be working closely with cloud and security tooling, integrations, scripting and automation. In addition, you will bring a secure development lifecycle mindset that will establish foundational security requirements for teams to consume. Lastly, in this role, you will be a trusted security advisor to the organization that fosters a natural bridge-building mindset. As a team member, you will help inspire, mentor, and lead by example as we strive to make a positive impact on our customers and the business.\n","requirements":[],"extras":[{"title":"THE SKILL SET","content":["You have 5+ years of experience in a DevSecOps, SRE, DevOps, TechOps or CloudOps role.","You have advance experience with at least one popular programming language, such as Python, Java, Kotlin, Go, Rust, Ruby, etc","You have extensive security experience with cloud services in AWS, including establishing Control Tower type governance","Experience securing microservices and/or Service Oriented Architecture","Experience with securing container environments like Docker","Experience securing APIs, both internal service and HTTP APIs","Experience securing CI\\CD pipelines.","Experience with SAST, DAST and IAST type code scanning & automation","You have experience developing metrics and insights to help drive remediation","You have extensive experience with vulnerability management and remediation lifecycles, working closely with technical teams to remediate issues","You have experience with WAF, IPS, IAM, SIEM, SOAR, DLP, endpoint, logging, key & configuration management technologies","You have experience improving security / engineering standards, tooling, and processes","You enjoy mentoring and teaching colleagues at all levels, while also learning from them","Expertise with infrastructure provisioning tools like CloudFormation, Terraform, Chef, Puppet, or others","Familiarity with continuous integration tools like Jenkins or CircleCI","Ability to take initiative and produce results with great communication and collaboration skills - we put a lot of emphasis on being team players"]}],"location_emoji":"🇪🇸"}