{"title":"Director of Product Management, Core Marketplace Services","location":["Hyderabad, India"],"attendance":["Remote"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Management","Core Marketplace Services","Risk Management","Data Structures","Agile Methodology","Team Leadership","Data Analysis"],"skills":["Mentoring","Managing","Senior Product Managers","Technical Product/Program Management","Building","Retaining","High Performing Teams","Customer Identity and Access Management (CIAM)","Risk and Fraud Detection and Mitigation","Compliance","GDPR","CCPA/CPRA","PII Regulations","Modern Web Application Design","Development","Security","Monitoring","Analysis","SDLC","CI/CD Tools","Data Structures","Analytics","ML Models","Product Thinking","Internal Solutions","Infrastructure","Build vs. Buy Analyses","Large-Scale Migrations and Implementations","Prioritization","Portfolio of Efforts","Business Realities","Technological Advancements","Communication Skills","Vision","Strategy","Execution","Analytical Skills","Problem Solving","Quantitative Skills","Data-Driven Approach","Influence","Organization","User Needs","Tight Deadlines","Key Business Metrics","Strategic Thinking","Critical Thinking","4-year Degree","BS/BA","Technical Field","Business Field","Analytical Field","Master's Degree"],"overview":"The Director of Product Management, Core Marketplace Services position is responsible for driving critical initiatives to protect users from threats, detect fraud, and uphold user privacy rights at Eventbrite, and involves leading a cross-functional team, building technology and processes, and shipping high-quality solutions.","description":"THE CHALLENGE\nWe're looking for an experienced product leader to drive critical initiatives to protect our users from threats posed by bad actors, detect and mitigate fraud and abuse, and ensure that user privacy rights are upheld to the highest standard. Advancing our capabilities in the areas of identity, privacy, and risk & fraud will enable our dual-sided marketplace to support the millions of event creators and consumers who rely on Eventbrite to help them get together, explore their interests, and pursue their passions through live experiences. If you're passionate about managing and mitigating risk at scale and establishing the overarching product vision and strategy for identity, privacy, and fraud, let's talk! \n\nTHE TEAM\nYou’ll be joining a global team of experienced and talented Product Managers, Engineers, and Data Scientists who are responsible for protecting creators, consumers, and Eventbrite from unsafe transactions and bad customer experiences. Our Marketplace Services teams optimize operational workflows, integrate best of breed SaaS solutions, and ensure that our platform provides a trustworthy, safe, and seamless experience for Eventbrite's creators and consumers. \n\nTHE ROLE\nReporting to the Head of Platform Product, you will grow, lead, and empower a team of technical product managers in close collaboration with the marketplace engineering teams, program management, design, finance, operations, data science, and legal teams. This role is highly cross-functional and is a unique opportunity to build the technology and processes that keep users safe on Eventbrite. You will be responsible for identifying key opportunities, creating a compelling vision for your product group, defining a strategy, and leading teams to ship high quality solutions. This is a great opportunity to join a dynamic team and directly impact hundreds of internal engineers and millions of external users.\n","requirements":[],"extras":[{"title":"THE SKILLSET","content":["Minimum 5 years of experience in mentoring and managing senior product managers","Minimum 10 years of experience in technical product/program management with a proven track record of building and retaining high performing teams","Previous experience implementing Customer Identity and Access Management (CIAM), risk and fraud detection and mitigation programs, and/or compliance with GDPR, CCPA/CPRA, and PII regulations at enterprise scale","Expert knowledge of modern web application design, development, security, monitoring, analysis, SDLC, and CI/CD tools","Strong experience with data structures, analytics, and ML models","Consistent track record of bringing strong product thinking to internal solutions and infrastructure, encompassing build vs. buy analyses and large-scale migrations and implementations","Experience leading teams in a fast-paced environment driving prioritization across a portfolio of efforts, incorporating new business realities and technological advancements along the way","Strong bias for action balanced with deep experience driving product alignment across multiple stakeholders","Exceptional communication skills that enable clear articulation of vision, strategy, and execution","Strong analytical, problem solving, and quantitative skills with data-driven approach to decision-making","Strong prioritization and focus, including comfort making tradeoffs with incomplete information","Ability to influence team members across all departments and levels of the organization","Ability to rapidly understand user needs, respond to tight deadlines, and deliver solutions that drive key business metrics","Adept at thinking strategically and maintaining a big picture perspective","4-year degree BS/BA in a technical, business or other analytical field required, Master's preferred"]}],"location_emoji":"🇮🇳"}