{"title":"Director, Customer Success","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Customer Success methodologies","Customer Success practices","Customer Success tools","Customer retention","Customer satisfaction","International people management","Project management","Analytical mindset","Data analysis tools","Data-driven decision-making","Strategy development","Operations management","Performance management","Customer onboarding","Customer engagement","Customer growth","Customer retention strategies","Industry trends","Data analytics","Metrics tracking","Action plan development","Transformational leadership","Continuous learning","Collaboration","Accountability","Performance metrics","Customer advocacy","Cross-functional collaboration","Churn reduction","Lifetime value optimization","Sales collaboration","Marketing collaboration","Product development collaboration"],"skills":["Customer Success methodologies","Customer Success practices","Customer Success tools","Data analysis tools","Data-driven decision-making","Transformational Leadership","Churn Reduction"],"overview":"The Director of Customer Success at Eventbrite will lead a team of Customer Success Managers, develop strategies to drive customer growth and satisfaction, and increase customer retention using data-driven insights.","description":"THE CHALLENGE\nEventbrite is a people-first organization. Our goal of building the global platform for live experiences relies on the foundation of top talent and strong company culture. The Customer Operations team within Eventbrite uses this top talent and strong company culture to build a team obsessed with creating the best experience for our creators and attendees. Being a part of this team presents a unique and excellent opportunity to develop essential skills and make a meaningful impact in the lives of our customers. \nAs the first line of contact with our customers, the Customer Operations team prides itself on providing experiences that optimize value for both Eventbrite and its customers. \n\nTHE TEAM\nThe Customer Operations Team, an integral part of the Sales and Services team, plays a vital role in ensuring a seamless experience for event creators and attendees on Eventbrite. With a focus on trust, security, and support, our team addresses various issues to foster a secure and enjoyable event environment. We serve as a bridge between the community and Eventbrite, overseeing outsourced operations while maintaining a high standard of service. Additionally, we drive the integration of new products, leveraging our in-house expertise to handle unique challenges and provide comprehensive assistance to our valued users. \n\nTHE ROLE \nEventbrite is seeking an experienced and highly motivated professional to join our team as the Director of Customer Success. The ideal candidate is a strategic thinker with a proven track record of developing high-performing teams, deep expertise in Customer Success practices, and a passion for leveraging data-driven insights to enhance customer experiences.\nThe ideal candidate is a strategic thinker with a proven track record of developing high-performing teams, deep expertise in Customer Success practices, and a passion for leveraging data-driven insights to enhance customer experiences.\nAs the Director of Customer Success, you will play a pivotal role in shaping the customer experience and ensuring long-term success for our clients. You will lead a team of Customer Success Managers (CSMs) and leverage your deep expertise in Customer Success and data analytics to develop strategies that drive customer growth, satisfaction, and loyalty. You will be responsible for transforming our CSMs into high-performing professionals who can effectively sell the value of our company and increase customer retention\n","requirements":[],"extras":[{"title":"THE SKILLSET","content":["Deep expertise in Customer Success methodologies, practices, and tools","Proven track record of at least 7 years in a Customer Success leadership role of achieving or exceeding customer retention and satisfaction goals","International people and project management experience (managing global teams that are not co-located)","Strong analytical and data-driven mindset with proficiency in data analysis tools and experience with data-driven decision-making","Ability to develop and execute long-term strategies while managing day-to-day operations","Results-oriented with a focus on driving customer satisfaction and business growth","Track record of developing both ICs and manager"]},{"title":"YOU WILL","content":["Develop and maintain a high-performance culture within the Customer Success team and its managers","Set clear goals and expectations for the team and provide regular feedback and performance evaluations.","Possess an in-depth understanding of Customer Success best practices, including customer onboarding, engagement, growth and retention strategies.","Stay up-to-date with industry trends and best-in-class techniques to continually enhance the customer success function.","Develop and execute multi-year strategies to enhance customer success and satisfaction.","Utilize data analytics and metrics to track customer health, identify trends, and proactively develop action plans to drive positive changes","Leverage data analytics to track and measure customer success metrics, including retention rates, NPS, and customer churn.","Develop and maintain comprehensive dashboards and reports to showcase the impact of Customer Success efforts and drive data-based decisions.","Lead the transformation of the Customer Success team into a high-performing unit that excels at customer retention, value selling, and churn reduction.","Develop multi-year strategies and roadmaps to guide the team towards achieving company objectives.","Foster a culture of continuous learning, collaboration, and accountability within the team and its managersEstablish and maintain performance metrics and KPIs for the Customer Success team.","Regularly report on team performance and progress toward goals to senior leadership.","Foster a customer-centric culture within the organization, ensuring all team members are advocates for our customers","Collaborate with cross-functional teams to ensure a seamless customer experience","Work closely with CSMs to ensure they effectively communicate and demonstrate the value of our products/services to customers.","Develop and implement strategies to reduce customer churn and increase customer lifetime value","Analyze churn patterns and root causes, then take proactive steps to address them.","Collaborate with Sales, Marketing, Product Development, and other teams to ensure a seamless customer experience.","Provide insights and feedback from customers to influence product and service enhancements."]}],"location_emoji":"🇺🇸"}