{"title":"Engineering Manager - Search","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Search","Engineering Manager","Tech Lead","ElasticSearch","OpenSearch","Lucene","Solr","Cloud Computing","Team Management","Software Development","Career Development"],"skills":["ElasticSearch","OpenSearch","Lucene","Solr","AWS","GCP","OCI"],"overview":"The Engineering Manager - Search position at Eventbrite involves leading a team responsible for developing tools and technologies that empower event goers to find, discover, and be inspired by events, while also driving impact and career growth for engineers.","description":"THE CHALLENGE\nEventbrite's business continues to grow and scale rapidly, powering millions of events. Event creators and attendees need new tools and technologies that empower them to have the most meaningful live experiences. As an Engineering Manager, you will inspire, mentor, and develop the team that builds this global platform. \n\n\nTHE ROLE\nAs an Engineering Manager in the Consumer world, you are responsible for a team whose primary customers are event goers when searching at eventbrite.com and eventbrite attendee app. You will need to partner with Design and Product to empower users on:\n\nFind: something specific (i.e Ocktober Fest), \nDiscover: discover what they would like to do (i.e yoga this weekend for free)\nInspire them: I have an open weekend and I don’t know what to do \n \nYou’ll refine our software development lifecycle process, clarify design requirements, and accelerate progress. You'll support the career growth of our engineers and provide opportunities to distinguish themselves as they drive impact throughout our organization.\n\n","requirements":[],"extras":[{"title":"YOU WILL","content":["Tech Lead Manager - has had a leadership role but can be as a technical IC.","User-facing or Marketplace Search experience with ElasticSearch, OpenSearch, Lucene, or Solr. Be familiar with basic retrieval, relevancy, ranking processes.","Has direct experience leading Consumer Search team and working on the consumer side of the business.","Has proficiency working with public clouds like AWS, GCP, OCI, etc.","Manage a team of six engineers (Backend, Frontend, and Mobile engineers)","Measure velocity and improve efficiency for the team","Drive change effectively across our organization","Maintain regular communication with the leadership team","Take ownership of career development for engineers on the team.","Drive innovation in processes and strategies throughout your business unit.","Lead your team to success on important initiatives even during times of frequent distractions and occasionally conflicting priorities.","Develop a sustainable, healthy environment for your engineers that is engaging, encouraging, and challenging.","Work alongside Search specific Product Managers and Personalization team"]},{"title":"THE SKILL SET","content":["Experience working with Search, Personalization or any other type of indexing, relevance and information retrieval","Analytical mindset for moving business metrics (CTR, CVR, Engagement, etc.): How search can contribute to overall business goals (e.g., revenue)","Demonstrated ability to grow and lead high-functioning and diverse engineering teams geographically distributed across the world","You’re a polyglot with a solid technical background and the ability to contribute to software design and architectural discussions as a player coach.","Experience building early-stage consumer products, applying concepts like experimentation, rapid prototyping, and user research in engineering","Experience working with a highly collaborative remote-first environment, driving a team that ships code to production often.","Working knowledge of fundamental cloud technologies, preferably within AWS."]},{"title":"BONUS POINTS","content":["3 years experience in engineering leadership and people management","Have contributed to team hiring and building teams from scratch.","Has experience working with user-centric personalization and recommendations.","Has worked with ML models to implement: Learn to Rank/Ranking Models, Embeddings, Knowledge Graph Learning, Query Classification, Personalized Search / Two Tower models"]}],"location_emoji":"🇺🇸"}