{"title":"Manager, IT support","location":["Remote, Spain"],"attendance":["Remote"],"type":["Full-time"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["IT Support Engineering","Technical support","Global support","IT end user support","A/V support","User lifecycle management","Inventory management","Team leadership","SLA management","Ticket resolution","Data analysis","Project prioritization","Resource allocation","A/V delivery","Hardware procurement","Onboarding","Offboarding","Systems engineering","Infrastructure engineering","End user experience","Vendor management","Budget management","macOS","Windows desktop systems","A/V troubleshooting","Physical inventory management","Troubleshooting skills","Teamwork","Sense of humor","G Suite","Okta","JIRA","Slack","LastPass","Jamf","AirWatch","Google Hangouts","Zoom","Chromebox for Meetings","Mobile device troubleshooting","Telephony","VPN troubleshooting","Wireless troubleshooting","Eventbrite user","IT procurement","Multi-country procurement","English and Spanish"],"skills":["Desktop Support","macOS","Windows","SaaS","IT administration","G Suite","Okta"],"overview":"The Manager, IT Support position oversees the IT Support Engineering team, providing technical support and solutions to global Britelings in offices worldwide, managing IT equipment procurement, user lifecycle management, and creating a supportive technical environment for Britelings.","description":"THE CHALLENGE\nYou will lead and manage the IT Support Engineering team at Eventbrite. IT Support oversees the delivery of outstanding technical support and solutions to our global Britelings in worldwide offices or in remote locations. The team ensures our global Britelings are empowered with the technology they need to get their jobs done effectively whether in the office or working remotely.\n\nTHE TEAM\nThe Eventbrite IT team, or BriteTech as we are fondly referred to as internally, is responsible for overseeing all internal technical operations. The IT Support Engineering team is one of three IT teams in BriteTech. This team provides outstanding IT end user and A/V support, procures IT equipment like laptops and peripherals, manages user lifecycle management (onboarding/offboarding), manages inventory, and helps deliver a supportive technical environment for Britelings to thrive.\n\nTHE ROLE\nBriteTech is looking for a stellar IT Support Manager to oversee the IT Support Engineering function and its amazing global cast of IT Support Engineers. This is a hands-on leadership role supporting our global IT and Eventbrite teams. You will report to the Director of IT and work as a collaborative partner with the leaders of IT Systems Engineering and IT Infrastructure Engineering and with the greater IT team.\n","requirements":[],"extras":[{"title":"YOU WILL","content":["Set and cast vision for worldwide IT support delivery for all types of Britelings in their workplace preference","Serve as the people manager and leader for the team of IT Support Engineers, including career development and personal development","Establish and monitor SLA and IT support ticket metrics, manage, assign, and direct resources as needed to maintain outstanding support","Work alongside the team of IT Support Engineers to resolve tickets in a timely fashion, handle escalated issues, and pitch in where necessary to make things happen","Analyze metrics, run reports, create regular summaries of work completed, help identify blind spots and needs based on data analysis","Oversee project prioritization and resource allocation for the IT Support Engineering team. Set the quarterly and annual project priorities in collaboration with the Director of IT and other IT functional teams","Oversee A/V delivery in global offices and ensure team provides outstanding A/V support for large meetings (e.g. All Hands) and coordinates A/V maintenance","Oversee hardware and client software purchasing and procurement in collaboration with local IT teams in geographic offices","Oversee onboarding and offboarding globally in collaboration with local IT teams","Collaborate with IT Systems Engineering and IT Infrastructure Engineering to provide the right tools to the right teams across the business","Proactively work to measure and improve the overall end user experience for fellow Britelings","Manage inventory globally using Inventory Management Systems, MDM Platforms and any associated integrations to maintain up to date statuses of physical inventory. Oversee the creation and ongoing revision end user IT help articles, canned responses, and other documentation","Manage vendor relationships across a wide variety of IT services, consultants, procurement vendors, and software vendors - coordinating efforts with other IT teams","Consult on annual and quarterly budget, manage effective operational expense spend throughout the year"]},{"title":"THE SKILL SET","content":["At least 5 years of experience working in an IT role, with at least 2 years experience as a manager","Experience leading an IT Support team including career development, project planning, and strategic thinking","Experience deploying, configuring, maintaining and troubleshooting macOS and Windows desktop systems","Experience configuring, running, and troubleshooting A/V in small and large conference rooms or spaces and helping run A/V meetings","Experience with physical inventory management and working cross-functionally with facilities and other departments","Experience troubleshooting complex IT problems as people pace nervously in front of you, fretting loudly about their impending deadlines and loss of revenue, all while keeping a smile and fixing the problem without breaking a sweat.","Singing is also acceptable, as long as you don't have a pitch problem","The ability to flourish as part of a team, be mentally flexible, a good sense of humor, and a passion for snacks"]},{"title":"THE TECH STACK","content":["Desktop Support (macOS, Windows), SaaS and IT administration (G Suite, Okta, JIRA, Slack, LastPass, Jamf, AirWatch, etc.), A/V Support (Conference rooms, Event spaces, Google Hangouts, Zoom, Zoom Rooms, Chromebox for Meetings), Mobile Device troubleshooting (iOS, Android), Telephony, Procurement and Inventory Management, Ticket Management (JIRA Service Management), basic network troubleshooting (VPN, Wireless)"]},{"title":"BONUS POINTS","content":["Active Eventbrite user with a passion for live events","Experience handling IT procurement in multiple countries across North and South America, UK and EMEA, Spain, and Australia","English & Spanish speaker"]}],"location_emoji":"🇪🇸"}