{"title":"Principal Native Engineer","location":["Remote, Spain"],"attendance":["Remote"],"type":["Full-time"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Native Engineer","iOS/Android","Swift","Kotlin","Mobile Architecture","Unidirectional Data Flow","Web Service"],"skills":["iOS","Android","Swift","Kotlin","Redux","Web Service","API"],"overview":"The Principal Native Engineer position at Eventbrite involves being a technical leader for the native iOS/Android applications, driving architectural changes, and mentoring engineering teams with over 10 years of experience in iOS/Android app development, deep understanding of Swift or Kotlin, and familiarity with design patterns and mobile architectures.","description":"THE CHALLENGE\nEventbrite is a people-first organization. Our goal of building the global platform for live experience relies on the foundation of top talent and strong company culture. Our team is the face of Eventbrite, and we’re charged with finding, attracting, and bringing on the best of the best to drive Eventbrite’s growing business and award-winning culture forward. Hiring the best talent globally is no easy feat. However, we have a talented team who has an inspiring story and mission. Our perfect candidate is someone who can connect that vision and story with top-notch talent.\n\nTHE TEAM\nThe members of our team tackle big problems through small group collaboration. Our technology spans across web, mobile, APIs, big data and machine learning, search, as well as physical point of sale and ticket scanning systems. Specifically for mobile we have 4 apps (Organizer and Attendee apps for both worlds, iOS and Android).\n\nAs a people-focused organization, we support a culture of inclusion, mentorship, and continuous learning. Pair programming, weekly demos, tech talks, and hackathons are at the core of how we build our team and product. We engage with the community by hosting events with exciting technical speakers and releasing key building blocks of our stack as open-source software. \n\nOur engineering teams own their services and systems end to end from requirements gathering to deployment to maintenance. Team members follow an on-call rotation to ensure any issues are mitigated immediately and root causes are rectified.\n\nTHE ROLE\nAs a Principal Software Engineer for Eventbrite’s native iOS/Android applications, you will embody Eventbrite engineering’s culture of technical excellence and will help drive sweeping architectural changes as we modernize our platform. You’ll be challenged to research, design and implement technical solutions and become a point of reference for the engineering teams. At the team level you will work closely with your engineering leader and different product managers. At the company level you’ll be responsible for technical leadership and mentoring\n","requirements":[],"extras":[{"title":"THE SKILL SET","content":["+10 years of experience developing iOS/Android apps","Deep understanding of Swift or Kotlin programming languages","You have knowledge of design patterns, mobile architectures and market software standards","Familiarity with unidirectional data flow frameworks like Redux or The Composable Architecture","Comfortable with leading large cross-functional initiatives, and collaborating with engineering teams and other stakeholders","Strong understanding of Web Service, API, REST and RPC","Excellent communication skills and ability to work with a wide variety of teams","Ability to explain complex technical concepts to a varied audience","Ability to set priorities, and execute according to the plan, arising risks if needed","Passion for quality and attention to detail","Strong analytical and problem-solving abilities","Ability to write performant concurrent code","Ability to cleanly architect UI features","Experience with Automated testing","Experience leading technical teams and mentoring engineers","Experience with distributed systems and large scale systems","Advanced English both written and spoken."]},{"title":"BONUS POINTS","content":["Active contributor to open source software"]}],"location_emoji":"🇪🇸"}