{"title":"Principal Product Designer, Personalization","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"8","salary":{"min":156000.0,"max":234000.0,"format":"per-year-salary","currency":"USD"},"tags":["Product Design","Personalization","User Experience","Research","System Design","UI/UX","Prototyping"],"skills":["UI/UX","Prototyping","Visual design","Motion","Research synthesis","Motion design","Experience design"],"overview":"The Principal Product Designer, Personalization position at Eventbrite involves driving a strategy and user experience that feels personalized for each event attendee and their unique needs, collaborating cross-functionally to ensure cohesiveness of user experiences, and leading ambiguous systems-level projects that can generate massive growth and impact for the organization.","description":"THE CHALLENGE\nAt Eventbrite, our mission is to empower people through live experiences. Whether through attending your favorite concert or hosting a conference, events can be transformative. They can also be pretty complicated. As a product for anyone in the world, it shouldn’t be. Eventbrite is looking for a Principal Product Designer to work on our Consumer Personalization team to help connect our event Attendees with the experiences they care about the most. Attendees want to open our app and be inspired to find something to do with their friends, and you’ll be at the forefront of making this happen. \n\nTHE TEAM\nDesign is a core part of our DNA at Eventbrite. We have a centralized design team that works in partnership with product managers and engineers to make a positive impact on our users’ lives and businesses. To that end, designers are embedded in product teams in order to get to know our users better, collaborate effectively, and focus diligently on our products. The team cares deeply about design as a craft and values constructive feedback as an opportunity for improvement. Design at Eventbrite strives to engage with the professional community, participating in regular programs and events with influential professionals in design.\n\nTHE ROLE\nEventbrite is looking for a Principal Product Designer to work on our Consumer Personalization team (as well as float within the consumer design team) to drive a strategy and user experience that feels like it’s tailor made for each event attendee and their unique needs. You’ll be using your skills in research, system level and holistic design thinking, and craft to help take complicated, ambiguous ideas and simplify them into great experiences for our users.  \n\nAs an advocate for high quality design, you’ll partner with Product, Design and Engineering leaders to turn strategy into concepts and work with Designers across Eventbrite, Engineers within your team, and Product Managers across the business to turn those ideas into reality. \n\n","requirements":[],"extras":[{"title":"HOW YOU’LL MAKE AN IMPACT","content":["Drive the design strategy, vision and execution of a personalized holistic experience for our event attendees across the consumer journey.","You’ll work cross-functionally to ensure cohesiveness of user experiences in relation to other parts of the product and collaborate across multiple teams to ensure alignment","You’ll lead ambiguous systems-level projects that can generate massive growth and impact for the organization","Define design solutions that exceed user needs and have a true sense of craft that inspires other designers to uphold that level of standard","Demonstrate mastery of UI/UX, prototyping, visual design, motion, and research synthesis","You explore areas outside the core technical skills like motion design, experience design, brand design, or front end development to drive solutions for your customers.","You thrive in situations where there is little to no definition and frequently demonstrate the ability to take insights, data, research and develop strategy.","You’re a masterful communicator who breaks down complex business problems and defines new concepts","You clarify storytelling using qual, quant, and industry knowledge","You’re a role model for the rest of the team, you lead workshops and programs to educate the broader design org","You regularly mentor and support other designers"]},{"title":"THE SKILL SET","content":["8+ years of professional Product Design experience","A user-centered approach to designing software and services for people","Demonstrated experience leading across the entire design discipline spectrum, from analytical to expressive","Experience facilitating discussions and exercises with engineers and product managers to drive strategy, vision, and execution","Self-aware teammate with highly developed emotional intelligence","Ability to clearly set and juggle priorities to focus on the most important issues","Consistently demonstrate good judgment. Able to make decisions at the right level, and escalate issues to design leadership as needed","Excellent communication skills, including prior experience communicating to senior-level executives"]},{"title":"BONUS POINTS","content":["","Prior experience designing for personalized experiences","Previously worked in environments that leverage data to inform design decisions","Deep understanding of quantitative and qualitative research methodologies","You are an event creator and understand the lifecycle of creating and managing events"]}],"location_emoji":"🇺🇸"}