{"title":"Senior Engineering Manager - SEO","location":["Remote, India"],"attendance":["Remote"],"type":["Full-time"],"experience":"4","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Senior Engineering Manager","SEO","Eventbrite","engineering leader","mentorship","user interfaces","agile approach","pair programming","tech talks","hackathons","web","mobile","API","big data","machine learning","search","analytics tools","platform capabilities","CMS","Search Engine Optimization","Content Management Systems","high-functioning engineering teams","recruiting","culture","leadership","performance review cycles","talent development","compensation","perks","share options","health","wellness program","remote work policy","flexible work schedule","professional development","training paths","English speaking","international career options","dynamic team","team lunches","team offsites","snacks","fruits","drinks","happy hours","family-friendly environment","monthly lunch vouchers","travel options"],"skills":["Full Life Cycle Product Development","Engineering leadership","Performance management","SEO Search Engine Optimization","CMS Content Management Systems","Search Optimization Techniques","Website operations"],"overview":"The role of the Senior Engineering Manager - SEO at Eventbrite is to lead and develop a team focused on building user-friendly interfaces and fundamental platform capabilities, while also collaborating with other SEO teams and supporting the career growth of employees.","description":"THE CHALLENGE\nEventbrite's business continues to grow and scale rapidly, powering millions of events. Event creators and event goers need new tools and technologies that empower them to have the most meaningful live experiences. As an Engineering Leader you will inspire, mentor, and develop the team that builds beautiful, responsive, delightful and intuitive user interfaces that people are excited to use every day.\n\nTHE TEAM\nWe're a people-focused Engineering organization:  the women and men on our team value working together in small teams to solve big problems, supporting an active culture of mentorship and inclusion, and pushing themselves to learn new things daily. \nThe SEO team is a cross-functional team including engineers, product, and strategy. We take an agile approach to our work, and we learn from each other as we go. The Britelings on our team value working together to solve big problems, supporting an active culture of mentorship and inclusion, and pushing themselves to learn new things daily. Pair programming, periodic demos, tech talks, and hackathons are at the core of how we’ve built our team and product. We believe in engaging with the community, regularly hosting free events with some of the top technical speakers, and actively contributing to open-source software (check out Britecharts as an example!). Our technology spans technology domains like web, mobile, API, big data, machine learning, and search. We leveraged state-of-the-art analytics tools to help us understand the impact of our SEO work. \n\nTHE ROLE\nAs a Senior Engineering Manager of the Core SEO Team at Eventbrite, your focus is the development of fundamental platform capabilities for our CMS and SEO domain. You will also work closely with our distributed Consumer SEO and Creator SEO teams. At Eventbrite, we put our Britelings first. You will support the career growth of your employees, and continue to drive change and improvement within our organization.  As a leader, you will support your team by providing context and connecting your team members with Eventbrite’s mission.\n\n\n","requirements":[],"extras":[{"title":"THE SKILLSET","content":["Overall 12+ years of experience in Full Life Cycle Product Development","4+ years experience in engineering leadership and people management, performance management","Strong technical background and ability to contribute to design and architectural discussions - coach first, player second","Background or experience in SEO Search Engine Optimization or CMS Content Management Systems. Search Optimization Techniques, and/or website operations.","Demonstrated ability to grow and lead high-functioning engineering teams.","Experience in recruiting a well-rounded, diverse technical team","Experience working with a highly collaborative environment, driving a team who ships code to production often","Focus on culture and leadership","Develop a sustainable, healthy work environment which is both encouraging and challenging","Must have done at least 3 performance review cycles"]},{"title":"BONUS POINTS","content":["Leading Managers","Prior experience with Search Optimisation Technologies"]},{"title":"WHAT TO EXPECT","content":["A Company focus on talent development","Eventbrite full compensation & Perks plan.","Share options (your piece of EB pie!).","Health & Wellness Program.","Remote work policy.","Flexible work schedule.","Professional development & training paths.","English speaking company.","International Career options.","A young dynamic team with a ‘let's make it happen’ mentality.","Team lunches and team offsites.","Lots of fancy snacks, fruits, drinks & happy hours.","A family-friendly environment.","Monthly Lunch vouchers","Travel options to meet with your colleagues"]}],"location_emoji":"🇮🇳"}