{"title":"Senior Director, Service Design","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Service Design","Customer Support","Process Improvement","Data-driven","People Leadership","Stakeholder Management","Technical Infrastructure"],"skills":["Product management","Customer effort","CX Strategic thinking","Experience design principles","UX design thinking","Process improvement methodologies","Stakeholder management"],"overview":"The Senior Director, Service Design position involves owning and delivering Eventbrite's customer support strategy, leading cross-functional initiatives, and innovating to deliver a customer experience that leverages technology, content, and people.","description":"CLICK HERE TO HEAR FROM OUR CHIEF CUSTOMER OFFICER!\n\nTHE CHALLENGE\nEventbrite’s customer base is growing and evolving, and we need our help experiences to grow and evolve too. We want to empower customers with the knowledge and resources they need to be successful on Eventbrite. From a single ticket buyer to the largest organizer on our site, we need a right-sized experience for each. \n \nTHE TEAM\nThe Service Design team is obsessive about helping our customers achieve their live experience outcomes. We’re focused on improving Eventbrite’s support strategy, methodology, and approach through content and AI — creating scalable customer service experiences worldwide. This role requires a keen understanding of the integrated functions within support and product organizations, as well as the ability to collaborate successfully in cross-functional teams. \n \nTHE ROLE\nWe’re looking for a leader to own and deliver Eventbrite’s customer support strategy.  As the key player in one of our most important customer touch points, you’ll be helping steer the customer experience at Eventbrite. We’re looking for an innovator with a keen eye for process improvement and the ability to use data to drive decisions. You’ll lead a team responsible for the design and implementation of the customers’ journey to the help they need across our help center, contact us flow and help channels and directly own customer resolution through the content and automations. You’ll lead cross-functional initiatives with stakeholders to coordinate and build solutions to meet the needs of our customers. You’ll innovate to deliver a customer experience that leverages technology, content and people that ultimately differentiates the value Eventbrite provides and truly drives the success of our customers.\n","requirements":[],"extras":[{"title":"THE SKILLSET","content":["A proven executor: Knows what great looks like in relation to product management. Has experience developing scalable support solutions.","A strategic thinker to design the future: Proven ability to develop and lead execution of successful self-service experiences aimed at decreasing customer effort. Experience with CX Strategic thinking and experience design principles. You have the ability to clearly understand and envision the full end-to-end customer experience. This includes development and design of customer experience strategies, journeys and workflow mapping, and analyzing data specific to VOC and VOE.","An expert in customer journey design: Passionate about providing customers an effortless experience at every touchpoint. Experience with UX design thinking - understands the principles of good user experience and can apply those to product flows across web, mobile and apps.","Process and data driven: Knowledge of process improvement methodologies such as six sigma. Passionate about taking a data-driven approach to eliminating defects or decreasing waste. Able to distill complex analyses and present a compelling vision for change","A proven people leader: Build, lead and develop a team of experts with the skillsets needed to deliver your strategy, iterate and improve it","Globally minded and comfortable with huge scale: Experience working within a globally distributed organization and large scale SMB + consumer customer base with translated & localized content","Strong stakeholder management and influencing skills to ensure a cohesive customer journey: Establish cross-functional team effort to deliver goals ranging from content optimization to inventing new communication channels. Track record of managing large, global, and cross-functional initiatives","Extensive knowledge of systems and tools to create the right technical infrastructure: Deep experience with enterprise CMS platforms."]}],"location_emoji":"🇺🇸"}