{"title":"Software Engineer II - Android","location":["Remote, India"],"attendance":["Remote"],"type":["Full-time"],"experience":"2","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Java","Kotlin","Android Development","Secure Coding","Testable Code","Collaboration","Mobile Software Development"],"skills":["Java","Kotlin","Android development ecosystem","secure coding","testable code","mobile software development","coroutines"],"overview":"The Software Engineer II - Android position focuses on building the global platform for live experiences by connecting Eventbrite's vision and story with top-notch talent, developing mobile engineering solutions, and supporting a culture of inclusion, mentorship, and continuous learning.","description":"THE CHALLENGE\nEventbrite is a people-first organization, and our goal of building the global platform for live experiences relies on a foundation of top talent and a strong company culture. Our team represents Eventbrite, and we are responsible for finding, attracting, and bringing on the best talent to drive Eventbrite's growing business and award-winning culture forward. Hiring the best talent globally is no easy feat, but our talented team has an inspiring story and mission. Our ideal candidate is someone who can connect that vision and story with top-notch talent.\n\nTHE ROLE\nAs a Software Engineer II you will join our mobile engineering team in India and help make Eventbrite an indispensable platform for finding the best events worldwide. Our technology spans web, mobile, APIs, big data, machine learning, search, and physical point of sale and ticket scanning systems. As a people-focused organization, we support a culture of inclusion, mentorship, and continuous learning. \nYou'll work directly with product management, product design, and other engineers to get a deep understanding of how our users explore our inventory and you will build the systems to most effectively satisfy our users’ needs.\n\nTHE TEAM\nThe Organizer App team’s mission is to create the world's best event management tools for organizers. They focus on managing event sales and attendees through Android or iOS devices, monitoring real-time ticket sales, checking-in attendees, tracking attendance live, and accepting fast, secure payment for tickets and merchandise on-site. The team is composed of Android and iOS engineers, a product manager, a designer, and an engineering manager. They tackle big problems through small group collaboration and support a culture of inclusion, mentorship, and continuous learning.\n\n","requirements":[],"extras":[{"title":"THE SKILLSET","content":["2+ years of application development experience on Android","You have a good understanding of Java, Kotlin, and the Android development ecosystem","You have the ability to write secure, stable, testable, maintainable code","You enjoy working on a highly visible product that impacts millions of users","You’re a good communicator and collaborate well with technical and non-technical peers","You have experience working on a mobile software development team","You have passion to learn"]},{"title":"BONUS POINTS","content":["Understanding of coroutines and asynchronous code","Knowledge of design patterns, mobile architectures and market software standards","Experience with Jetpack Compose","Active contributor to open source software"]}],"location_emoji":"🇮🇳"}