{"title":"Software Engineer II - Core Platform (Devops)","location":["Remote, India"],"attendance":["Remote"],"type":["Full-time"],"experience":"2","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Systems Engineering","Infrastructure","Software Delivery Pipeline","Docker","Cloud Technologies","AWS","Software Developer"],"skills":["Docker","AWS","software delivery pipelines","Python","Kubernetes","Site Reliability Engineer (SRE)","Kafka"],"overview":"A Software Engineer II - Core Platform (Devops) is responsible for implementing the infrastructure and tooling that powers the software delivery pipeline, working with technologies such as Python, Django, MySQL, AWS, Docker containers, and cloud technologies.","description":"THE CHALLENGE\nEventbrite is a people-first organization. Our goal of building the global platform for live experience relies on the foundation of top talent and strong company culture. Our team is focused on developer experience and architecture. Our ideal candidate is someone that is willing to work on deep problems and can also explain and help others learn and adopt solutions.\n\nTHE TEAM\nWe work on foundational aspects key to making our Development teams successful. We are responsible for the efficiency of the software development lifecycle for our applications. This includes proposing and building new application architecture and building tooling to create a more pleasant developer experience while at the same time keeping our core systems up to date.\n\nTHE ROLE\nWe are looking for a creative problem solver and communicative engineer that’s interested in Systems Engineering. This team is a newly formed team in 2023 whose mandate is to increase the speed, quality, and efficiency of the engineering organization. We are at a point wherein the number of services and infrastructure pieces we’re dealing with everyday has become unwieldy and we need highly skilled engineers on the devtools infrastructure team to scale our capabilities. As a Software Engineer II you will be responsible for implementing the infrastructure and tooling that powers the software delivery pipeline.\n","requirements":[],"extras":[{"title":"THE TECH STACK","content":["Eventbrite is one of the world’s largest Django-powered sites by request volume. Python, Django, and MySQL are the primary off-the-shelf technologies in our stack. We are hosted on AWS.PySOA, our services framework, builds on these core technologies. Because this team interfaces with many other teams, there’s potential to work with a variety of other backend technologies in our stack, including Redis, Kafka, ElasticSearch to name a few. On the frontend, we make extensive use of React and Redux."]},{"title":"THE SKILL SET","content":["Experience developing Docker containers","Experience working with cloud technologies (AWS preferred)","Experience working with software delivery pipelines","2+ years experience as a software developer","Willingness to work on a distributed team","Efficient, practical programmer with a record of producing maintainable code","Great communication skills and ability to explain complex technical concepts to a varied audience"]},{"title":"BONUS POINTS","content":["Experience with Python or GO","Open source contributions","Experience with defining software delivery pipelines","Experience with Kubernetes (EKS preferred)","Past experience as a Site Reliability Engineer (SRE)","Experience defining SLOs/SLAs and implementing alerting, monitoring, and writing runbooks","Experience with Kafka","Experience with IaC: Terraform and CDK","Experience with Hashicorp’s products: Nomad, Vault and Consul","Experience with container security"]}],"location_emoji":"🇮🇳"}