{"title":"Staff Frontend Software Engineer","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["HTML5","CSS3","JavaScript","ES6","React","Redux","Cross-browser Compatibility"],"skills":["HTML5","CSS3","JavaScript","ES6","React","Redux","cross-browser compatibility"],"overview":"Build the systems to most effectively satisfy users' needs by joining the engineering team as a Staff Frontend Software Engineer, with at least 5+ years of experience in rapid product development, React, cross-browser compatibility, collaborating with design teams, mentoring colleagues, and improving engineering standards.","description":"THE CHALLENGE\nBuild the best event search that connects consumers with the events that matter to them anywhere in the world. Our search and discovery experience needs to delight and engage people, and help them find the specific event they are looking for or discover new events they can go to.\n\nTHE TEAM\nThe Search & Discovery team helps people browse, search for and discover events that they want to attend through browse features, search UI, ranking and relevance enhancements.  \n\nTHE ROLE\nJoin our engineering team and help make Eventbrite an indispensable platform for finding the best events anywhere in the world. You'll work directly with product management, product design, and other engineers to get a deep understanding of how our users explore our inventory and you will build the systems to most effectively satisfy our users’ needs. \n","requirements":[],"extras":[{"title":"THE SKILL SET","content":["5+ years of experience with rapid product development building responsive web pages using a combination of HTML5, CSS3, and JavaScript with recent experience in ES6","5+ years of experience working with React and state management frameworks like Redux","Extensive experience with cross-browser compatibility pitfalls and how to work around them.","You have a great track record of working closely with design teams to build beautiful and intuitive web pages and applications.","You enjoy mentoring and teaching colleagues at all levels, while also learning from them.","You are a pragmatic programmer that understands how to balance quality, time to ship, and cost.","You have a holistic approach to quality.","You can improve engineering standards, tooling, and processes."]},{"title":"BONUS POINTS","content":["You have a strong portfolio (on Github) that displays your passion for delighting users.","You have previous experience working with a large engineering team on a complex web application.","You have previous experience with build chain tools like Webpack, Gulp, Grunt, and Yarn.","You have previous experience with visual design techniques like spacing, typography, and color.","You have familiarity with server-side frameworks such as Django, Express, Rails, .Net, or Node.js."]}],"location_emoji":"🇺🇸"}