{"title":"Technical Program Manager","location":["Remote, India"],"attendance":["Remote"],"type":["Full-time"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Technical Program Manager","Engineering","Delivery","Market","Features","Development Teams","Technology Stack","TPM","Delivery Practices","Engineering Features","Blockers","Bottlenecks","Software Development Teams","Geographies","Prioritization Workshops","Product","Engineering","Marketing","R&D","Metrics","Trends","Friction","Process Improvement","Behaviours","Engineering Strategy","Operations","Platform","Infrastructure Budget/Cost","Financial Reporting","Execution","Technical Requirements","Backlog Refinement","Retrospectives","Team Level Meetings","Blockers","Solution Options","New Projects","Workshops","Engineering Managers","Directors","Best Work","Tech Stack","Monolithic Architecture","Microservices Architecture","CI/CD Pipeline","Source Code Management","AWS","MySQL","Aurora","PostgreSQL","DynamoDB","Agile Maturity","Infrastructure Team","Skill Set","Relevant Work Experience","Cloud Environment","AWS Pricing","Cost Optimization","CloudHealth","AWS Cost Explorer","Redshift","Analytics Tools","Project/Program Management","Cloud Technologies","Different Geographies","Cost Management Tactics","Data Analysis","Interpersonal Skills","Independent Work","Communication Skills","Jira","Agile Tools","Web Applications","CI/CD Processes","Bachelor's Degree","Software Development","Devops","QA","Microservices","Web API Delivery"],"skills":["AWS","CloudHealth","AWS Cost explorer","Redshift","analytics tools","project/program management","cloud technologies"],"overview":"The Technical Program Manager at Eventbrite will be responsible for enabling the delivery of market defining features, driving customer success, and implementing delivery practices.","description":"THE CHALLENGE\nEventbrite is maturing its program management practice to help deliver its strategic vision for its customers. As the leader in the mid market event management and ticketing industry we want to pivot to a new post pandemic world. The Program Management Office will be part of the engineering organization and focus on enabling delivery of market defining features while helping the development teams retool and refresh its technology stack. As the first few TPMs on the team part of the challenge is to influence the team on adopting new delivery practices.\n\nTHE TEAM\nThe TPM team at Eventbrite will be responsible for the delivery of key engineering features that drive customer success. This team is responsible for identifying and removing blockers and bottlenecks that impact the software development teams across geographies. They facilitate prioritization workshops to ensure alignment between product, engineering, marketing, R&D and other teams. TPM’s also help bring visibility into the software development production pipeline by publishing metrics and trends. TPM’s eliminate friction within and in between teams by continuous process improvement and influencing behaviours that breed success. \n\nTHE ROLE\nThis TPM individual will need to collaborate closely with Engineering Strategy and Operations and Platform areas and to manage infrastructure budget/cost including finding opportunities for optimization. This TPM will also have to assist with other operational tasks such as financial reporting. As a TPM this individual will assist with the execution of existing programs, will contribute to planning and facilitation of technical requirements, backlog refinement, retrospectives and other team level meetings and escalate blockers and provide solution options. This individual may get to manage new projects, planning project deliverables including sequencing deliverables to minimize blockage from dependencies, and facilitate team level workshops to flesh out achievable goals. They will partner with engineering managers, directors and engineers to understand the technology as well as the deliverables at the tactical level. This Senior TPM will put together the metrics required to keep track of all deliverables they are assigned. This individual contributor should be fluent in Agile methodologies and development tools and technologies. The TPM will need to be ready to deep dive into team activities in order to resolve issues with process or behaviors. They will take ownership of their team deliverables, eliminate blockers, identify risks and mitigations while empowering teams to do their best work.\n\n\nTHE TECH STACK\nWe are moving from a centralized monolithic architecture to a decentralized micro services architecture. This means changes to a lot of technologies that are currently in use across engineering. This also means changes to our CI\\CD pipeline and the way we manage our source code. In addition to the move to microservices we are also moving to AWS managed solutions as opposed to solutions that are self managed. So switching from MySQL to Aurora and self managed Postgres to DynamoDb. This Sr. TPM will help roll these changes out across all teams and help drive Agile maturity in the infrastructure team.\n","requirements":[],"extras":[{"title":"THE SKILL SET","content":["3+ years of relevant work experience in a large multi-million dollar cloud environment using AWS","Strong understanding of various AWS Pricing and Cost Optimization strategies","Experience using tools such as CloudHealth, AWS Cost explorer, Redshift and other analytics tools to advise on optimization opportunities","3+ years of project/program management experience, ideally in cloud technologies","Experience working with teams across different geographies","Experience and good understanding of cost management tactics such as enterprise wide discount programs and commitment plans, Savings Plans, Reserved Instances, Committed Use Discounts and spend control","Strong analytical and quantitative data-analysis; ability to use hard data and metrics to back up assumptions, recommendations, and drive actions","Excellent interpersonal skills to interact with senior-level personnel and team members","Ability to work well both independently and in teams","Excellent organization and communication skills, both written and verbal","Experience with Jira (>2 years) or equivalentAgile tools","Comfort in leading sprint ceremonies like scrum of scrums, sprint reviews etc. (>2 years)","Understanding of web applications and CI\\CD processes","Bachelor’s degree or better in a technical field (CS/Math/Stats/Engineering)"]},{"title":"BONUS POINTS","content":["Previous experience in software development or devops or QA is nice to have·","Experience with AWS or Azure based delivery is nice to have·","Microservices or Web API delivery experience is nice to have"]}],"location_emoji":"🇮🇳"}