            {
                "id": 255,
                "companyId": 6,
                "title": "Administrative Assistant, Advertising",
                "location": ["Paris, France"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 7,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Administrative Support","Calendar Management","Communication","Travel Coordination","Event Planning","Onboarding","Written and Verbal Communication"],
                "skills": ["Administrative Assistant","Advertising","Supporting multiple executives","Maintaining high-volume","complex calendars","Scheduling meetings","Drafting and circulating administrative updates","Coordinating travel arrangements"],
                "overview": "The Administrative Assistant position at Netflix's Advertising department in France, Spain, and Italy requires at least 7 years of experience, strong communication skills in English and French (ideally also Spanish or Italian), experience in a fast-paced international environment, and familiarity with working in advertising teams, with responsibilities including supporting multiple executives, maintaining calendars, drafting communications, coordinating travel, planning events, assisting with onboarding, and handling ad hoc requests.",
                "description": "Netflix is one of the world's leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.
With the incredible launch of our ad supported model, we are now working toward providing more choices for consumers and a premium brand experience for advertisers.  

About the opportunity 
We are seeking an experienced Administrative Assistant who will provide support to a small group of senior executives across our Advertising department (France, Spain, and Italy). In this role, you will work with a plurality of internal stakeholders and Netlfix’s external partners exercising your business knowledge, curiosity, and flexibility every day. 

A successful candidate will be self-motivated, quick-thinking, proactive and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and an unwavering attention to detail at all times. This is a demanding and fast-moving position that requires someone who is able to exercise good judgment, to respond quickly to changes, and show significant initiative.

We want folks from different backgrounds to feel expected, reflected, and respected at Netflix, and therefore we are committed to providing an accessible working environment for everyone.
",
                "extras": [{"title":"Key responsibilities:","content":["Supporting multiple executives with busy schedules","Maintaining high-volume, complex calendars, including scheduling meetings, internally and externally, with multiple parties across multiple locations if needed","Maintaining agendas and task lists for meetings and special projects","Drafting and circulating administrative updates and a heavy volume of communication for stakeholders across multiple departments","Coordinating travel arrangements (domestic and international), creating travel itineraries, and processing travel and expense reports","Planning and coordinating team events (e.g., offsites and social events, including agenda planning, booking facilities and catering, and tracking budgets)","Assisting with onboarding of new hires if needed, along with maintaining teamwide onboarding workflows and documentation","Handling frequent ad hoc requests like space planning, creation of presentations & organizational charts, and updating trackers with key business data and information to support projects."]},{"title":"Qualifications:","content":["At least 7 years of working experience as an Administrative or Executive Assistant","Strong written and verbal communication skills in English and French, and ideally Spanish or Italian","Previous experience working in a fast-paced and international environment is preferred for this role","Previous experience working with advertising teams is a plus","Comfortable dealing with multiple stakeholders and clients through written and verbal communications","Team player who operates in a fast-paced team-oriented setting","Ability to be discrete and maintain confidential information","Understanding of how to prioritize and respond accordingly","Interest in film and/or TV is a plus","A desire to thrive in Netflix unique working culture."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7d6f5ae7-9bd9-4b6c-86df-2bf0616cf4aa"
            }