            {
                "id": 486,
                "companyId": 6,
                "title": "Administrative Assistant, Safety and Security",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 4,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Administrative Support","Calendar Management","Invoicing","Travel Coordination","Onboarding","Vendor Meetings","Communication Management"],
                "skills": ["Administrative support","Calendar management","Invoicing","Travel arrangements","Onboarding","Communication management","Stakeholder meetings"],
                "overview": "The Administrative Assistant, Safety and Security position at Netflix is responsible for providing support to the Directors of Physical Security and Environmental, Health and Safety (EHS) and their team projects, including managing calendars, coordinating travel arrangements, and handling administrative tasks.",
                "description": "We are seeking an experienced Administrative Assistant to join our growing team. This position will be responsible for providing support to the Directors of Physical Security and Environmental, Health and Safety (EHS) and their team projects. This role will be based in Los Angeles on a hybrid schedule (Three days in office per week).


The Opportunity:
Netflix is the world's leading streaming entertainment service with 204 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.


The Role:
A successful candidate will be passionate, self-motivated, proactive, quick-thinking, flexible, able to pivot when necessary, thorough and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and unwavering attention to detail at all times. This is a demanding and fast-moving position that requires someone who is a proactive and positive thinker, and able to exercise good judgment and communication. 
",
                "extras": [{"title":"Responsibilities","content":["Provide administrative support to Security & EHS Directors","Provide support to the overall Security & EHS Teams in Los Angeles and international offices","Manage complex calendars for a growing team, including scheduling internal and external meetings with multiple parties across multiple time zones","Manage general administrative duties, including processing and tracking invoices, facilitating team and visitor requests, and ordering supplies","Coordinate travel arrangements, both domestically and internationally","Assist with onboarding of new hires","Collaborate with executive assistants and admins across teams on various aspects, including conferences and off-site meetings","Manage a heavy volume of communication and administrative paperwork internally and externally","Organize, attend, and participate in stakeholder meetings","Coordinate vendor meetings","Create a positive atmosphere of professionalism and support","Build and maintain strong working relationships with executives, department leads and staff, and outside vendors to deliver results based on their needs","Support team leaders & coordinators with ad hoc projects"]},{"title":"Qualifications:","content":["4+ years experience as an Administrative or Executive Assistant, providing support to multiple executives at a fast-paced company (experience in an entertainment/tech setting a plus)","Team player who operates in a team-oriented setting","Ability to be discrete and maintain confidential information","Proficiency in Google Suites (Gmail, Drive, Calendar, Docs, Sheets, Slides)","Self-starter with the ability to multi-task, prioritize and respond accordingly in a fast-paced environment","Great communicator who can build strong working relationships with vendors, and internal and external partners","Willingness to continue learning to ensure understanding of current production process and needs","Strong written and verbal communication skills","Willingness to take educated risks and think out of the box"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7013fbaf-a7f6-46e2-85ae-94ebfed15fef"
            }