            {
                "id": 485,
                "companyId": 6,
                "title": "Administrative Assistant, PR - Korea",
                "location": ["Seoul, South Korea"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Administrative Assistant","PR","Korea","Support","Calendar Management","Travel Coordination","Meeting Coordination"],
                "skills": ["Proactive","Detail-oriented","Organized","Executive support","Administrative duties","Meeting coordination","Project tracking"],
                "overview": "The Administrative Assistant, PR - Korea is responsible for providing administrative support to the PR executive and another executive in Korea, including maintaining calendars, processing travel and expenses, coordinating meetings, and assisting with special projects. The ideal candidate should be highly organized, proactive, and have good judgment, with 5+ years of experience in a similar role and strong communication skills in Korean and English.",
                "description": "With Netflix's Korean content swooning over the world, it is an exciting time to join the team here. We are seeking a Korea-based Administrative Assistant to support our PR executive and another executive in Korea. The successful candidate will be self-motivated, proactive, quick-thinking, flexible, and able to juggle multiple and diverse responsibilities with unweaving attention to detail at all times. This is a team that travels and interacts with internal and external teams across several countries and time zones, so a high level of organization is a must. Someone who demonstrates significant initiative and inherently exercises good judgment will be most successful both in the role and at Netflix.
",
                "extras": [{"title":"Specific responsibilities include, but are not limited to:","content":["Proactively maintain calendars for multiple executives including scheduling and setting meetings that are internally and externally across different regions and time zones","Perform administrative duties such as processing travel (domestic/International), accommodation, visa application, expense reports, etc","Assist and coordinate internal meetings and events including meeting preparation, digital document organization, and facilitating communication flow both with internal and external team members","Maintain a log to track projects and their status"]},{"title":"Qualifications and Requirements:","content":["5+ years experience as an executive/administrative assistant supporting Director or above","Collaborative team player who is able to operate and multitask in a fast-paced team-oriented setting","Ability to be discrete and maintain confidential information","Positive attitude and proactive willingness to add value","Ability to prioritize, exercise good judgment and respond accordingly","Ability to be flexible and adapt to shifting priorities while reaching goals","Strong written and verbal communication skills in Korean and English","Proficient in Google Mail & Apps","Must be excited to learn about and strive in the Netflix culture"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7a2a2b51-1553-449c-97ff-baf3b2032579"
            }