            {
                "id": 190,
                "companyId": 6,
                "title": "Android Software Engineer (L5) - Streaming and Discovery Experiences",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Android Software Engineer","Streaming","Discovery Experiences","Netflix","iOS","Android","TV apps","cross-functional teams","product management","experience design","creative production","streaming algorithms","client playback systems","UI","mobile experiences","Member product innovations","Android Client infrastructure","Discovery & Viewing Experiences Core","cross-platform UI","product features","client architecture innovations","Android Mobile Application","Core teams","features and solutions","Product and Client Infrastructure","immersive product experiences","partnership with cross-functional teams","Client & UI capabilities","architecture","Member Experiences","large-scale A/B tests","UI performance","quality","accessibility","Netflix Android app","data-driven optimizations","device and network ecosystem","operational testing","automation solutions","Android technologies","software engineering practices","Java","Kotlin","Node.js"],
                "skills": ["Java","Kotlin","DI/Dagger/Hilt","Jetpack Compose","MvRx","GraphQL","Node.js"],
                "overview": "The Android Software Engineer (L5) - Streaming and Discovery Experiences position at Netflix involves building engaging and cinematic experiences for the Netflix Android app, collaborating with cross-functional teams, and continuously improving the streaming and discovery features.",
                "description": "Netflix is the world's leading streaming video service with over 200 million paid memberships in 190+ countries. The Consumer Engineering team builds the industry-leading Netflix iOS, Android, and TV apps. To bring new kinds of engaging and cinematic experiences to life, we partner closely with many cross-functional teams including product management, experience design, and creative production. 

The Streaming and Discovery Experiences Engineering organization continuously improves the Netflix experience to delight, attract, and retain our members. We’re responsible for much of what our members interact with when they use Netflix - from our streaming algorithms to our client and server playback systems to the UI our members use daily to find their next favorite Netflix title. 

We are part of a global, diverse organization that includes people of all genders, sexual orientations, upbringings, nationalities, ages, and socioeconomic & educational backgrounds. We encourage anyone passionate about building compelling mobile experiences that touch audiences worldwide to apply.

We are hiring for multiple roles across our teams which span Member product innovations and Android Client infrastructure & capabilities powering the product features.

Here’s an overview of the teams that are looking for experienced Android engineers to drive impact in these areas:

Discovery & Viewing Experiences Core

On our cross-platform UI team, we work to help members connect with stories they'll love. You will work on product features and client architecture innovations on our flagship Android Mobile Application that ships to a wide variety of devices. We love every minute of the complex engineering and product challenges that come with delighting our members at this scale. 

The Core teams are responsible for building features and solutions that power innovation in Netflix’s member experiences across Android, iOS, Web & TV. We uniquely sit at the intersection of Product and Client Infrastructure: 
1. We bring the next generation of immersive product experiences to life in close partnership with several cross-functional teams.
2. We build the Client & UI capabilities, features, and architecture to enable teams to craft & ship rich, performant product experiences. 

Member Experiences

We’re looking for a Software Engineer to drive innovations in the member experience space. Our responsibilities include working on large-scale A/B tests of features - ranging from highly visible product experiences to core infrastructure that enables existing and future innovations. We care deeply about UI performance, quality, and accessibility of the Netflix Android app. 

We proudly ship the Netflix app on Android to millions of members around the world on a wide variety of devices. We work on data-driven optimizations at scale in a diverse device and network ecosystem. Our sophisticated operational testing and automation solutions are designed to support our high-performance, fast-paced culture of experimentation, autonomy, and ownership.
",
                "extras": [{"title":"What you’ll be doing","content":["Collaborate cross-functionally with product, design, and engineering partners to scope project roadmaps to build delightful and accessible user experiences.","Build experimentation-driven product features, core UI infrastructure & systems, and define best practices to help drive consistency and simplicity of client code.","Bring a wide variety of experience building features and frameworks with technologies like DI/Dagger/Hilt, Jetpack Compose, MvRx, GraphQL, etc., to the team.","Architect maintainable, performant Android client code with effective documentation that can be leveraged by Android developers on other teams.","Develop code for testability and write automated tests with JVM Unit/Espresso tests to help uphold product quality on a high commit volume code base.","Keep a pulse on cutting-edge Android technologies and software engineering practices, and modernize the code base to accelerate innovation velocity and maintain high product quality."]},{"title":"What Sets You Apart","content":["Self-starter comfortable with identifying opportunities and driving forward-looking technical solutions or roadmaps.","Effective at developing strong relationships with cross-functional teams through clear communication, curiosity, and selflessness.","Taking a thoughtful, practical approach to problem-solving that considers tradeoffs and avoids over-engineering.","Strives to elevate the knowledge and skills of yourself, and others in a way that fosters an inclusive, collaborative environment.","Deep understanding of the technical landscape of Android development and can introduce new paradigms and practices.","Exceptional coding skills, especially with Java and Kotlin, and can navigate different languages and technology stacks (eg. Node.js, GraphQL, etc).","Deeply cares about the quality & performance of the product shipped."]},{"title":"You will be successful in the role if","content":["You enjoy pushing the boundaries of what technology can do and exploring uncharted waters with some supervision.","You are curious and ready to learn about various new or unfamiliar technologies, our consumer base, and product vision.","You have experience building transparent observability tooling and solutions that enhance developer velocity.","You love the idea of your work empowering other engineers and striving to understand their use cases.","Your colleagues appreciate the unique perspectives and balanced views you bring to collaborations.","You value the opinions of others when fleshing out solutions to fill out your blind spots.","You have familiarity with the Data-centric approach to app development.","You always seek different perspectives, feedback, and relevant information to navigate ambiguity comfortably.","You are effective at establishing strong relationships with cross-functional teams through clear communication.","You deeply care about the quality & performance of the product shipped.","You have read about Netflix’s culture and think you would thrive here"]},{"title":"Learn about Android Product Engineering","content":["Read about how we migrated our Android endpoints out of a monolith into a new microservice (Rohan and Ed)","See one of our pull requests for Epoxy (Emmanuel)","Read our take on Rx onError Guidelines (Ed)","See some of our work highlighted at a Netflix Women In Tech Event"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/294a6eeb-0d2a-4c1f-9b52-59f3c757f241"
            }