            {
                "id": 191,
                "companyId": 6,
                "title": "Applied Machine Learning Scientist (L5) - Globalization",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Applied Machine Learning","Localization","Data Science","Deep Learning","Python","PyTorch","Tensorflow"],
                "skills": ["Machine Learning","Deep Learning","Python","PyTorch","Tensorflow","ML frameworks","Large scale industrial settings"],
                "overview": "The job involves developing algorithms for high-quality localization at scale in order to remove language barriers and provide a stellar member experience, partnering with a cross-functional team to bring these algorithms to life.",
                "description": "At Netflix, our mission is to entertain the world by connecting our members to an extensive library of stories from all over the globe. We are revolutionizing international storytelling as we deliver billions of hours of movies and TV shows per month to 200+ million members across 190+ countries in 30+ languages. 

The Globalization Data Science and Engineering team is at the forefront of removing language barriers and providing a stellar member experience to all our members regardless of their language preferences. We are responsible for the translation and cultural adaptation of all aspects of member interaction, including beautiful localized user interfaces, subtitles, and dubbing of award-winning Netflix originals.

We are looking for an Applied Machine Learning Scientist to develop algorithms that power high quality localization at scale. In this rare opportunity, you will have the chance to solve novel problems that will shape the future of localization and global entertainment at Netflix. You will partner with a talented cross-functional team of language experts, scientists, product managers, and engineers to bring these algorithms to life. 

",
                "extras": [{"title":"Responsibilities","content":["Provide thought leadership and identify new areas where Machine Learning (ML) can play a significant role in greenfield areas","Partner closely with business stakeholders and engineering teams to integrate work outputs into the production workflow","Research, develop, and productionize novel ML and Deep Learning models in a multi-modal setting (text, image, video, audio)","Present your research and insights to all levels of the company, including executive level, clearly and concisely"]},{"title":"About You","content":["Deep knowledge of ML and Deep Learning with an MS or PhD in ML, Computer Science, Mathematics, or related fields","Strong coding experience in Python and standard ML frameworks like PyTorch and Tensorflow","Experience leading ML initiatives with a proven track record of implementing and productionizing these models in large scale industrial settings","Orientation towards long-term impact, but able to strike the right balance between short term goals and longer-term vision","Exceptional communication and collaboration skills coupled with strong business acumen","Comfortable with ambiguity; able to take ownership, and thrive with minimal oversight and process","Netflix culture resonates with you"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/405d0b04-3045-41c0-bbf3-48051691ece2"
            }