            {
                "id": 490,
                "companyId": 6,
                "title": "Art Outsourcing Manager - Games",
                "location": ["Helsinki, Finland"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Art Outsourcing Manager","Games","Art Production","External Partners","Internal Teams","Workflows","Pipelines"],
                "skills": ["Art Production","Art Outsourcing","Workflows","Pipelines","Collaboration","Communication","Asset Management"],
                "overview": "The Art Outsourcing Manager at Next Games works with external art partners and internal teams to create visually stunning mobile games, improving art production workflows and ensuring smooth collaboration, while actively seeking new ways to enhance art pipelines and building a well-functioning outsourcing team.",
                "description": "Next Games is a Netflix Game Studio, focusing on creating compelling fans-first interactive experiences by combining the stories of well-known movies and shows with engaging game mechanics. An unwavering focus on fans and fun gameplay is at the core of the studio’s game development, free from the constraints of free-to-play.
 
As an Art Outsourcing Manager at Next Games, you’ll work within a team of highly talented and motivated artists, to create visually award winning mobile games! 

If working on globally recognised entertainment IPs, or helping develop the next blockbuster game IP; that’ll be available on the world's biggest streaming platform Netflix, sounds like your cup of tea, Next Games can provide that opportunity.

You should be a Highly Skilled artist, with a strong understanding of Art Production with external partners and internal teams. You seek to find functional and highly polished workflows and pipelines to ensure a smooth Art production cycle and cross discipline collaboration.
",
                "extras": [{"title":"Key responsibilities:","content":["Creating new and smooth workflows with external art partners","Communication and relationship management with the external partners and internal teams","Supports other Artists within the company, with creating briefs, giving external partners feedback and guidance, participates in the planning of art production","Communicating with other members in the game’s development team; making sure information is shared to all parties involved efficiently and proactively improves cross discipline workflows.","Making sure all art related tasks by the vendors are completed and that the production moves forward in a timely manner","Seeks actively new and innovative ways of improving the art pipelines when it comes to art asset production with the outsourcing partners","Seeks and creates new contacts with different outsourcing partners"]},{"title":"Long term goals:","content":["Ambitious with a drive to progress within the art production and building a well functioning outsourcing team."]},{"title":"Skills and experience:","content":["Experience in Art Production and strong understanding of well functioning production pipelines","Strong art portfolio, demonstrating experience and understanding of different styles.","Understanding of 2D and 3D asset specs","Strong communication skills & time management, that enables proactive and independent workload management.","Strong experience in an art related industry, preferably within the game industry","Strong understanding of game art development and asset management","Supporting other artist; sharing knowledge and documentation","Strong organizational skills and ability to seek solutions for asset sharing"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/18afc1c5-81f1-4217-9d7e-ea0878f0c88d"
            }