            {
                "id": 196,
                "companyId": 6,
                "title": "Associate, FP&A",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Finance","Budgeting","Forecasting","Financial Analysis","Strategic Analysis","Communication Skills","Entertainment industry"],
                "skills": ["financial planning & analysis","Excel","financial modeling","communication skills","accounting","Bachelor's degree","quantitative"],
                "overview": "The Associate, FP&A position at Netflix involves supporting senior management in budgeting and forecasting, performing financial scenario analysis, and delivering recommendations based on analysis, with a preference for candidates who have experience in financial planning & analysis in the entertainment industry, management consulting, investment banking, or Big 4 accounting. The role requires 5+ years of experience in quantitative and qualitative financial analysis, proficiency with Excel and complex financial modeling, excellent communication skills, and a bachelor's degree in a quantitative field.",
                "description": "Netflix is the world's leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 

Netflix is looking for experienced finance professionals to join our team. This role will be the primary point person to support senior management in all budgeting and forecasting-related areas. Senior leadership depends heavily on our Financial Planning & Analysis groups to accurately model and forecast the business as well as to lead the strategic analysis that is used to inform important business decisions. 

We currently have opportunities available on the following teams:
⦁ Studio FP&A (legal)

All roles are based in our Hollywood, CA office. Depending on business needs and candidate background, you’ll either be aligned to our Studio, Marketing, or our Content teams, with the future opportunity to rotate across business functions as openings become available. 
",
                "extras": [{"title":"Responsibilities:","content":["Supporting near-term and long-term P&L forecasts","Supporting key portions of the company's free cash flow forecast","Developing insightful presentations that summarize this data and facilitate decision-making for senior Netflix management","Performing financial scenario analysis to support senior management's strategic decision making","Candidates are required to be highly analytical and be strong, effective communicators.","Prior experience in financial planning & analysis in the entertainment industry, management consulting, investment banking, or Big 4 accounting is preferred. Ideal candidates will have a proven track record of superior financial and strategic analysis and developing/delivering recommendations based on this analysis.","The successful candidate must display initiative in anticipating and exceeding the business demands of senior-level business managers. This person must thrive in a fast-paced environment and exhibit the highest personal and professional standards of integrity and ethics.","Netflix is fast-growing with a flat organizational structure, which means that employees are often asked to perform tasks with a range of difficulties. Candidate must be motivated, disciplined, and able to work effectively autonomously."]},{"title":"Requirements:","content":["5+ years of experience conducting quantitative and qualitative financial analysis","Superior proficiency with Excel & complex financial modeling","Excellent verbal and written communication skills","Sound working knowledge of the related accounting guidance preferred","Bachelor's degree with emphasis on coursework of a quantitative nature, preferably Business, Economics, or Mathematics"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7e5f022a-2bda-413d-9bcb-10a719e99cdc"
            }