            {
                "id": 456,
                "companyId": 6,
                "title": "Associate, Product Strategy & Analytics - Cloud Operations",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 4,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Product Strategy","Analytics","Cloud Operations","Capacity Operations","Operational Analytics","Financial Optimization","Cross-Functional Project Management"],
                "skills": ["Amazon Web Services","Cloud Infrastructure","Open Connect Content Delivery","infrastructure operations","optimization","query languages","Python"],
                "overview": "The Associate, Product Strategy & Analytics - Cloud Operations role at Netflix involves driving efficient resource utilization of the Amazon Web Services infrastructure and optimizing cloud financial reservations for cost savings. Strong analytics skills, cross-functional project management experience, and a background in technology are preferred qualifications.",
                "description": "Netflix is the world's leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 

Netflix is revolutionizing the media and entertainment industry. Underpinning this revolution are leading edge technology efforts in Cloud Infrastructure (running on Amazon Web Services) and Open Connect Content Delivery which are the foundational components that deliver a great Netflix experience to 238M+ members around the globe. 

We are looking for an Associate to join our Product Strategy & Analytics team focusing on driving efficient resource utilization of our Amazon Web Services infrastructure (i.e. “before you press play” experience which represents sign-up, login, personalization, search, etc.). You will be partnering with leaders and senior engineers across dozens of teams to provide best in class capacity operations and drive operational analytics. 

As a team, we are responsible for driving efficient resource utilization and scaling of our cloud infrastructure. We have centralized these responsibilities to a select group of individuals who have become experts in infrastructure operations & optimization, and this role would be acting as the financial “watchtower”, responsible for daily, weekly, and monthly optimizations that accumulate savings in the millions of dollars.

The ideal candidate will be highly analytical, operationally focused, an effective communicator, and have a critical eye for the small details. Ideal candidates have a proven track record of cross functional project management and extensive analytics experience. We are a self service, data driven organization so previous experience with query languages such as SQL, a scripting language (e.g., Python), or a strong desire to learn these skills is strongly preferred. The ideal candidate will thrive in a fast-paced, high stakes environment, possess a high degree of intellectual curiosity, and be results driven while upholding the highest personal and professional integrity and ethics. 

In addition to intellectual curiosity and aptitude, we look for candidates who are excited by technology, either from a professional or personal background. Since we are deeply intertwined with our business partners, having the ability to connect specific engineering initiatives to the broader Netflix business impact is critical to success. 

This role will report directly to the Senior Manager, Product Strategy & Analytics and is based out of our Los Gatos, CA office.
",
                "extras": [{"title":"RESPONSIBILITIES","content":["Own the cloud financial reservation purchasing and optimization process & experience across a compute footprint of millions of CPUs across 5+ AWS regions. (What’s a reservation?)","Collaborate horizontally across all Engineering teams to understand day-to-day and week-to-week increases in usage to make the optimal financial reservation decisions.","Work directly with our AWS partners to guide their reservation product roadmap.","Extensive analysis of our cloud infrastructure, focused on optimization and efficiency opportunities. Based on findings, propose solutions and project manage cross-functional teams (e.g. software engineers, data engineers, analytics/viz engineers) through implementation.","Network with peer companies who have similar responsibilities to share and learn best practices."]},{"title":"QUALIFICATIONS","content":["4+ years of experience in a highly analytical environment -- worked in a consulting firm, strategy & operations, technical program management, or analytics at a technology company, or similarly demanding functions in which strategic analysis, partner management, and operational optimization is essential.","Experience working with cloud providers in a financial/capacity operations role is a big plus.","Experience working as a business partner with technical engineering teams in a fast-paced, constantly changing environment.","Ability and willingness to quickly learn internal tools to independently (self-service) explore and analyze high-volume datasets.","Working proficiency with SQL or other query languages.","Expert with Excel or Google Sheets.","Degree in economics, mathematics, engineering, computer science, or other relevant field (or equivalent work experience) that demonstrates quantitative competence."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/64d09a0f-4b75-46f7-aad0-9def3e3c67c7"
            }