            {
                "id": 247,
                "companyId": 6,
                "title": "Associate, Production Finance - Japan",
                "location": ["Tokyo, Japan"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Production Finance","Live Action","Financial Workflows","Content Deals","Market Intelligence","Creative Vision","Production Plan"],
                "skills": ["production manager","producer","production accounting","production finance","financial applications","accounting","finance"],
                "overview": "The Associate, Production Finance - Japan position at Netflix's Tokyo office is responsible for supporting live action titles and coordinating with third-party production companies, ensuring successful financial workflows, evaluating content deals, providing market intelligence, and maintaining clear creative vision and production plans.",
                "description": "The Opportunity

Netflix is one of the world’s leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. This is your chance to be on the ground floor with a team that is transforming entertainment through original productions, changing the perception of what great content is and how it should be enjoyed and celebrated.  

The Role

Netflix is looking for an Associate to join our Production Finance team based in the Tokyo office. This role will mainly work on supporting our live action titles and will help cross-functional partners guide each project through its financial workflows required for a successful launch on the service. The goals include partnering with the Business, Physical Production and Creative teams to evaluate potential partners, determine optimal structure of content deals, provide comprehensive market intelligence and to ensure the investment is supported by a clear creative vision and an executable production plan.
",
                "extras": [{"title":"Responsibilities","content":["Work effectively and decisively within the Netflix Japan Original Contents team to coordinate with third-party production companies who are producing local content for Netflix","Work closely and collaboratively with other members of the Netflix Content Teams in order to guide the partnerships with third party local production service companies","Assist with timely and complete budget, cost report tracking, provide commentary on submitted reports throughout the life-cycle of a production","Coordinate the implementation of production finance best practices with our international 3rd party production partners","Create and circulate budget top sheets for approval","Process and track fundings for production services companies","Update production information in Netflix systems","Onboard 3rd party production accounting teams to Netflix policies and procedures","Map cost reports to Netflix chart of accounts","Coordinate and analyze production data from a wide range of local and international production accounting software systems.","Audit selected production accounts payable, journal entry, and payroll records","Cost report and budget comparisons and analysis","Ad-hoc projects as needed","Thrives in a fast-paced environment where feedback exchange is constant, being capable of giving and receiving it in a direct and timely manner"]},{"title":"Qualifications","content":["5+ years working as a production manager or producer managing production budget for live action content. Production-accounting or production finance experience is preferred.","Must thrive in a fast-paced and challenging environment.","Must possess a high level of intellectual curiosity with a focus on generating results.","Must be self-motivated, disciplined, highly organized and able to prioritize multiple tasks.","High aptitude and enthusiasm for complex problem solving and analysis utilizing financial applications.","Strong written and verbal communication skills.","Ability to work collaboratively within a diverse multicultural team environment.","Bachelor’s degree in accounting or finance is a plus.","Fluent in Japanese. Business proficiency in English is preferred."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/82ca7dd0-ccaf-4d64-8e19-162b6cd43a33"
            }