            {
                "id": 334,
                "companyId": 6,
                "title": "Audio Visual Engineer",
                "location": ["Tokyo, Japan"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Audio Visual Engineer","Design","Setup","Support","Teardown","Event","Technical Expertise"],
                "skills": ["Audio Visual design","setup","configuration","support","Google Meet with Chromebox for Meetings (CFM) hardware","R&D","virtual meeting experience"],
                "overview": "The Audio Visual Engineer at Netflix in Tokyo will be responsible for managing the design, setup, support, and teardown of Audio Visual equipment and other technology for high-profile events and meeting spaces in the APAC region.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 

Our Netflix Technology Services team has the mission of optimizing the productivity of Netflix employees by supporting their technology needs, whether that’s fixing a computer/network, troubleshooting a conference room’s camera, or supporting a live event. As we grow, so does the number of high-profile events we host and meeting spaces we support, so we’re looking for a versatile and experienced Audio Visual Engineer to join our APAC team.  This role will be based in our office in Tokyo.
 
For events, you’ll manage the design, setup, support, and teardown of Audio Visual equipment and other technology. Coordinate with external vendors and work with both regional and global teams. You will provide hands-on Audio Visual technical expertise for events, audio and multi-camera broadcast productions.
 
In addition, the Audio Visual team supports the design and build of meeting spaces and high-profile events across our enterprise and studio facilities throughout the APAC region. We rely on Google Meet with Chromebox for Meetings (CFM) hardware for the virtual meeting experience and build solutions to optimize the experience. The team is highly encouraged to leverage R&D to enhance the user experience while maintaining efficient designs. You’ll be empowered to look for ways to optimize the conference room experience for users and partner teams.
",
                "extras": [{"title":"Responsibilities","content":["Provide technical Audio Visual design, setup, configuration, and support for internal & external event productions","Design floor plans and Audio Visual event layouts for offsites and multi-purpose spaces - produce technical drawings","Review, manage and submit Audio Visual rental quotes, and labor / crew invoices for large programs","Be a thought partner and leader for requesters requiring a technical partner to guide the Audio Visual aspects of their programs through the full lifecycle","Clearly communicate and document processes to team, vendors, and partners including ensuring that proper communication is maintained with internal and external partner groups.","Able to step into any one of crewed / operator position as needed (eg V1, A1, LD, Show Caller)","Ability to effectively translate stakeholder and requester needs into technical direction for operators and crew","Assist in the design, build, and support of conference rooms, event spaces, specialty and screening rooms","Research and develop the best video conference experience from the ground up with consideration for scalability and rapid deployment","Provide Tier 2/Tier 3 troubleshooting support when equipment issues are escalate","Work closely with the global team to determine trends and iterate on design improvements to improve stability and user experience","Foster the partnership with Google to troubleshoot CFM issues and add features to improve the user experience","Foster cross-functional partnerships with Netflix teams globally alongside the Audio Visual team","Quality control of inventory and asset management"]},{"title":"Recommended Experience","content":["Audio Visual technical experience working in hotels, conference / convention centers, theaters, concert venues, places of worship, festivals and other large format Audio Visual production spaces","Designing and developing globally scalable Audio Visual solutions for hybrid event and broadcast support","Operating and supporting live events (corporate, hospitality, or other major event venues) including Youtube, Facebook Live and online distribution methods","Configuring and troubleshooting audio and video equipment for live events or in a corporate environment","Partnering with external Audio Visual vendors for live events and working with vendors, suppliers and integrators for other Audio Visual projects","Audio Visual integration experience on the integrator and/or corporate side, with experience in physical installation and project management","Experience with video conferencing systems and cloud bridging services such as Chromebox For Meetings, Vidyo, and BlueJeans","Designing and building meeting spaces from the ground up including acoustics, lighting, and technology","Understanding of networking technology, video transmission over the network, and audio/video signal flow","Working with Crestron equipment, audio DSP’s and Dante/AES microphone systems","Proven ability to work independently with minimal supervision; must be a self-motivated self-starter who can initiate ideas and take ownership of work","Proven ability to prioritize tasks and projects, and forecast upcoming project needs","Open to international and domestic travel","Organized and familiar with inventory management protocols","Experience with the Google Workspace tools, particularly Google Meet Video Conferencing support and builds","Business-level fluency in English and Japanese"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/74fd27c9-d581-4e28-9a17-9e33471638dd"
            }