            {
                "id": 198,
                "companyId": 6,
                "title": "Audio Lead, Games Studio (Blue)",
                "location": ["Los Angeles, California"],
                "type": [],
                "attendance": ["Remote"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Audio Lead","Games Studio","AAA multi-platform game","signature audio experience","Creative Director","Design Director","sound effects","music","character dialog","audio content","immersive experience","Unreal Engine","mentor","vendors","playtest","user research","5+ years experience","industry standard audio tools","communication skills","collaboration skills","leadership skills","project management skills","remote team","passion for solving complex problems"],
                "skills": ["Unreal Engine","Wwise","Pro Tools","audio vision","sound effects","music","character dialog"],
                "overview": "The Audio Lead position is responsible for defining and implementing the audio vision for a brand-new AAA multi-platform game, including sound effects, music, character dialog, and all other audio content, as well as managing and mentoring the audio team and external partners. The ideal candidate has 5+ years of experience as an Audio Director or Lead, expertise in industry standard audio tools, excellent communication and leadership skills, and a hunger for learning and delivering a world-class experience.",
                "description": "We’re looking for a talented and experienced Audio Lead to help us build a brand-new AAA multi-platform game. This is a unique opportunity to deliver a high-quality, emotionally resonant, signature audio experience for one of Netflix’s first generation of internally developed original games. 

We’re a team with big ambitions and an obsession to create memorable game moments that leave players telling their own stories for years to come. We seek new teammates who care deeply about the experiences they create and the people they make them with, who bias towards action and are energized by the learning that comes with bold experimentation at an agile pace.

As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. Now is an amazing time to join Netflix as we seek to entertain the world. We have over 230 million paid members in over 190 countries, and we won’t stop there. If this sounds like you, we would love to hear from you!
",
                "extras": [{"title":"Responsibilities Include:","content":["Work closely with the Creative Director and Design Director to define the audio vision for the game, and then lead the effort to bring this vision to life.","Drive the creation of sound effects, music, character dialog – and all other audio content – to deliver an immersive and emotionally-engaging experience.","Drive the cross-discipline effort to spec, build, and tune all audio systems, working especially closely with the design and engineering teams.","Implement content in Unreal Engine, from rapid prototypes to robust live content","Manage and mentor other audio team-members as well as manage relationships with vendors and other external partners.","Leverage playtest, user research, and other data to craft a game experience that resonates deeply with our players."]},{"title":"Our ideal candidate has:","content":["5+ years experience as an Audio Director or Lead","Expertise with industry standard audio tools such as Wwise, Pro Tools, etc.","Excellent communication, collaboration, and leadership skills, especially with a remote team.","Deep project management skills and a demonstrated ability to oversee audio production that relies heavily on vendors and other external partners.","Growth mindset and passion for solving complex problems with other people","Hunger to learn new skills, serve players, and deliver a world-class experience."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/c295d6b6-3719-4c2a-a0ce-24ae73950595"
            }