            {
                "id": 201,
                "companyId": 6,
                "title": "AV Engineer, Events",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["AV Engineer","Events","AV Events Engineer","UCAN AV Events","AV technical expertise","AV design","floor plans","AV event layouts","AV rental quotes","technical documentation","AV engineering documentation","core operator","stakeholder management","monitor video","analyze video issues","AV research","large-scale events","AV resources coordination","vendor/contractor resources","AV budget management","onsite event production","global AV solutions","technical event production teams","communication and collaboration","professionalism under pressure","teamwork","post-production deliverables","Mac OS","Windows","GSuite for Business"],
                "skills": ["AV technical experience","hybrid event and broadcast support","managing and leading vendors","Vectorworks","AutoCAD","SketchUp","technical event production teams"],
                "overview": "The AV Engineer, Events position at Netflix is responsible for providing technical support and expertise for the production of video, audio, lighting, network, and communications systems during events, both remotely and onsite, and requires travel, flexible hours, and the ability to collaborate with regional and global teams.",
                "description": "Who We Are
Netflix is the world's leading internet entertainment service with 238 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want,  anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.

Our Netflix Technology (N-Tech) team has the mission of optimizing the productivity of Netflix employees by supporting their technology needs, whether that’s fixing a computer/network, troubleshooting a conference room’s camera or supporting a live Corporate event. As we grow, so does the number of high-profile events we host and event spaces we support, so we’re looking for an experienced AV Events Engineer to join our UCAN AV Events team based in Los Gatos.

You’ll serve as the responsible party for all production video, audio, lighting, network, and communications systems before, during, and after events, remotely and onsite. The AV Events Engineer is the primary point of communication for all technical questions or concerns related to events. Working with both regional and global teams, you will provide hands-on AV technical expertise for events, video, lighting, audio, and multi-camera broadcast productions. This role will require travel both international and domestic. This position also requires flexible hours as support may take place after normal business hours or on the weekends (though rare). 
",
                "extras": [{"title":"Responsibilities","content":["Technical AV design, setup, configuration, and support for internal & external event productions.","Design floor plans and AV event layouts for offsites and multi-purpose spaces - produce technical drawings.","Review, manage, and submit AV rental quotes, and labor/crew invoices for large programs","Be a thought partner and leader for requesters requiring technical expertise to guide the AV aspects of their programs through the full lifecycle (including post-production)","Ability to learn and implement new technologies, assuring successful outcomes.","Ensure proper communication is maintained with internal and external partner groups.","Assist with keeping technical documentation accurate and up to date (e.g. cue sheet, inventory, run of shows, production schedules, etc.)","Create and manage AV engineering documentation and standard operating procedures","Able to step into core operator position as able / needed (eg V1, A1, LD, Show Caller)","Responsible for stakeholder management and pre-production needs for events.","Monitor, analyze, and solve issues regarding video, cameras, digital switchers, digital routers, digital video servers, character generators, automation, and digital routing.","Assist with AV research and development project initiatives in partnership with other X-functional teams","Meet deadlines and provide deliverables necessary for excellent execution of large-scale events and productions","Ability to effectively translate stakeholder and requester needs into technical direction for operators and crew","Crewing (AV resources) coordination, leading vendor/contractor resources","Ownership & management of Netflix’s onsite event production spaces","Oversight of AV budget as pertaining to Event costs"]},{"title":"Recommended Experience","content":["AV technical experience working in hotels, conference/convention centers, theaters, concert venues, places of worship, festivals, and other large-format AV production spaces.","Experience designing and developing globally scalable AV solutions for hybrid event and broadcast support","Experience managing and leading vendors, integrators, technical crews and design teams for the execution of events; and the commissioning and maintenance of broadcast and event production spaces","Ability to work within design/project budgets throughout the lifecycle of projects or for routine maintenance and escalation","Familiarity with Vectorworks, AutoCAD, SketchUp and similar tools for overall technical event considerations and design materials","3+ years of experience in any combination of the following positions: TD, PM, TC, A1, V1, LD, Broadcast Engineer or Show Caller","1+ years of leading technical event production teams, with a deep understanding of roles and responsibilities required in a crew, based on the vision and production needs","Ability to effectively communicate and collaborate with a diverse range of people and job functions.","Professionalism and ability to be helpful and maintain composure under pressure","Ability to work well in a team environment, including talent, producers, and directors, under strict time deadlines and constant changes throughout the event/production process","Capable of delivering post-production deliverables for client/requester needs","Proficiency in working with Mac OS, Windows, Chromebooks, and GSuite for Business"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/9886f076-27b1-4944-bbda-d8c5e93681b9"
            }