            {
                "id": 202,
                "companyId": 6,
                "title": "AV Producer - UCAN (Awards)",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 8,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["AV Producer","Marketing Production","AV Marketing","Awards Marketing","Marketing Finishing","Localization workflows","Managing a large volume of assets"],
                "skills": ["AV Servicing","Marketing campaign workflows","AV Post Production","Asset management","QC","Localization workflows","Film or Theatrical Campaign Marketing"],
                "overview": "The AV Producer - UCAN (Awards) position involves managing the finishing and localization production processes of AV Marketing campaigns specifically for Awards Marketing (Oscars, Emmys and other FYC campaigns), requiring a deep understanding of Marketing Finishing and Localization workflows and the ability to handle a large volume of assets in a high-speed environment.",
                "description": "We are looking for an experienced and seasoned AV Producer to join our UCAN Marketing Production AV team. In this role, you would be responsible for managing the finishing and localization production processes of our AV Marketing campaigns specifically for Awards Marketing (Oscars, Emmys and other FYC campaigns). You should have a deep understanding of Marketing Finishing and Localization workflows and excel in managing a large volume of assets in a high-speed, high-performance environment. You are a force of calm and good judgment as well as an adaptable person who revels in change. This means that you are nimble, able to balance competing priorities among global stakeholders, and thrive as a strong individual lead, and a collaborative team member, in a rigorous environment.

The Opportunity

With 208+ million paid memberships in over 190 countries, Netflix is the world's leading streaming entertainment service and is powered by a work culture that’s focused on high performance and continuous improvement. This is a great opportunity to shape the future of how we enable the best quality and scaled execution of marketing campaigns as we continue to grow our slate of local and global content.

The Role

Reporting to the Sr. Manager of AV Production, you will join a team of AV Producers that manage the finishing and localization for Netflix’s AV Marketing campaigns. 

",
                "extras": [{"title":"Responsibilities include:","content":["Finish and Localize Marketing AV assets (30 minute broadcast specials, featurettes, trailers, promos, social content, etc.) for our cross-functional marketing and communications teams.","Own day-to-day communication and escalation with creative and operational stakeholders, content post teams, external finishing vendors, creative agencies, and localization partners in order to efficiently manage finishing and localization execution.","Plan, schedule and manage internal and external AV production workflows, that time-sensitive bottlenecks are eliminated and advise on delivery & budget risks to enable the creation and production of high quality creative at a high velocity.","Shepherd scope, budget and overall AV post production resources","Assure internal and external production partners are up to date on brand guidelines and file specs for delivery","Partner with a team of operational producers responsible for managing finishing, localization, and trafficking of promotional materials. These include online and offline AV, key art and out-of-home, digital, and social creative assets.","Use data to inform production best practices, eliminating inefficiencies throughout our operational pipelines"]},{"title":"Requirements:","content":["8+ of AV Servicing in a post-production house, entertainment studio, or creative agency","Excellent written and verbal communication skills","Expert knowledge of Marketing campaign workflows, including understanding the creative and AV Post Production process","Fluent in AV file types, social and digital formats while understanding the fundamentals of asset management, QC and trafficking.","Familiarity with Localization workflows, including motion graphic packages, subtitling and dubbing","Experience managing a high volume of AV campaign types in parallel, in collaboration with geographically dispersed teams.","Proven ability to effectively communicate amongst a wide variety of cross functional partners, ensuring effective exchange of campaign information and global dissemination of campaign milestones, assets and deliverables.","Experience with Awards Marketing Campaign development/production for Oscars, Emmys or other industry events is a plus, but not required. Passion and interest in this space is a must.","Familiarity with Film or Theatrical Campaign Marketing is a plus, but not required","Experience facilitating finishing approvals with high profile, above and below-the line talent is a plus, but not required"]},{"title":"Personality Attributes:","content":["You are passionate and curious about all aspects of entertainment marketing.","You are a natural-born communicator, connecting the dots when others cannot, and have an ability to simplify complex issues and questions.","You thrive in a fast-paced and demanding environment, possess a high level of intellectual curiosity, and demonstrate strong judgment in the face of ambiguity.","You approach all challenges and obstacles with a solutions-oriented mindset","You are an agile, goal-oriented personality, driven to succeed, and always up for a challenge!"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/2c76fb58-8c56-442e-98be-028889094b0c"
            }