            {
                "id": 254,
                "companyId": 6,
                "title": "Business Partner, Finance Procurement Operations",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "",
                "description": "Netflix is the world's leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 
 
The Opportunity:
We are looking for an experienced finance professional, who has sourcing experience, to support our end to end finance procurement operations with a focus on partnering with one of the following areas:

Product: In order to entertain the world, the Product organization enables and innovates how storytelling is produced, discovered and enjoyed around the world. We leverage technology at scale to innovate to increase efficiency and make the process of creating with Netflix a competitive differentiator. This position will reside in the company’s Los Gatos office and will report to the Manager, Finance Procurement Operations in Los Gatos. 

The ideal candidate for this role is someone that will help drive operational process improvements, have the courage to challenge prevailing assumptions, has a solid understanding of accounting treatments related to content creation, knowledge of the P2P workflow, and experience with developing strong cross functional relationships with business partners across various Creative and Product functions, FP&A, Accounting, and IT teams. 

Visit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team.
",
                "extras": [{"title":"In this role you will partner with the following cross-functional partners:","content":["Business Owners - Execute all finance related tasks (procurement support, reviewing and re-negotiating contracts, vendor management, creating purchase orders, reviewing invoices, expense reporting) and be an embedded partner and active contributor across various teams.","Accounts Payable - Create POs where applicable and provide non-PO invoice coding to enable timely and accurate invoice processing and accurate financial reporting.","Accounting - Drive an accurate and timely month-end close by owning the accrual process and explaining variance drivers.","FP&A - Ensure accurate coding to provide meaningful reporting and identify opportunities to use data to drive business decisions.","IT - Design, simplify, and automate finance and payment workflows and partner on system enhancements to help automate workflows to scale."]},{"title":"Responsibilities Include:","content":["Communicating with the Creative and Product teams to drive the procurement of services from our vendors and understand the status/timeline of delivery of services.","Partner closely with the business to support their sourcing decisions and vendor partnerships for scale, cost efficiencies, and to ensure a diverse and sustainably focused supplier chain to keep pace with the evolving needs of our business.","Setting-up purchase orders (PO’s) in to ensure appropriate classification of expenses to enable financial reporting and analysis.","Driving projects that help to simplify and automate manual workflows. Actively participate in system features development and user acceptance testing.","Managing vendors and invoicing processes: reviewing vendor records, ensuring timely billing, approving invoices, and working with Accounting to ensure accuracy of accrued services."]},{"title":"Qualities We're Looking For:","content":["5+ years of relevant Finance and/or Accounting experience","Experience with sourcing, procurement, and purchase orders, as you will deal with these on day 1 and look for ways to optimize the workflows","Ability to take ownership of tasks while handling competing priorities","Strong analytical skills with the ability to navigate large data sets","Strong communication skills, business acumen, and the ability to lead cross-functional meetings","Relationship builder - Ability to cultivate strong cross functional relationships and communicate effectively with team members and business partners","Strong enthusiasm for implementing systems and processes","Curiosity and passion - Our team members ask probing questions, challenge the status quo, make changes to improve processes, and have fun while doing it; having a positive attitude and never settling for “good enough” are key","Adaptable - You are comfortable in an ever-changing ecosystem of content, finance and accounting issues and projects","For LG based candidate, ability to take occasional trips to the Los Angeles office in Southern California","For LA based candidate, ability to take occasional trips to the Los Gatos office in Northern California"]},{"title":"Extra dose of awesomeness if you have:","content":["Industry experience is a plus","ERP and Procurement systems experience with Workday Financials and Tableau","Bachelor’s Degree in Accounting or Finance; MBA and/or CPA"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/a537138e-232c-4922-80d8-88b04de19b2c"
            }