            {
                "id": 257,
                "companyId": 6,
                "title": "Consumer Messaging Configuration Lead",
                "location": ["Remote, California"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 6,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Consumer Messaging Configuration","Messaging Strategy","Messaging Configuration","Messaging Programs","Merchandising Modules","Technical Capabilities","Business Needs"],
                "skills": ["messaging configurations","messaging capabilities","merchandising modules","technical stack","self-service tooling","messaging performance management","recommendation systems"],
                "overview": "The Consumer Messaging Configuration Lead will be responsible for partnering with the Messaging Foundation teams on messaging configuration and overall messaging strategy, championing messaging guidelines and principles, providing messaging support to partner teams, understanding technical capabilities of messaging, creating tracking processes for messaging programs, and collaborating with cross-functional teams to develop messaging experiences.",
                "description": "Now is an amazing time to join Netflix as we seek to entertain the world. We have over 200 million paid members in over 190 countries, and we won’t stop there. We are looking for a Consumer Messaging Configuration lead to join a newly established Merchandising team. 

The Consumer Messaging Programs team is responsible for Netflix-initiated messaging (email, push-notifications, in-app notifications). This includes end-to-end consumer-facing messaging strategy, messaging creation and performance. As a Messaging Configuration lead, you will be responsible for partnering with the core Messaging Foundation teams on messaging configuration and overall messaging strategy. Consumer Messaging Programs is new to Netflix - this is an opportunity to join a start-up team within Netflix; you will get the chance to define the team’s business impact and set the bar for what this team can deliver.
",
                "extras": [{"title":"In this role, you will:","content":["Lead the vision and requirements for messaging configurations and capabilities - working with Messaging Foundations teams to integrate messaging program requirements into overall core roadmaps and partner on their development. Once developed, work with the Performance Manager to integrate experimentation frameworks and performance evaluation. Ensure the broader team adopts the capabilities and deeply understands the requirements to utilize.","Own and champion messaging guidelines and principles and when/how merchandising modules are used. You will be responsible for ensuring that the guidelines and principles are maintained.","Be messaging support from partner teams - including Product Management and Marketing. In partnership with Consumer Messaging Programs experts, you will be responsible for evaluating business needs and roadmap prioritization. You will assist these teams with messaging set-up (if complex needs arise).","Understand the technical capabilities and limitations of our messaging capabilities and use this knowledge to determine how we best support business needs. You will know messaging capabilities/innovation needs inside and out.","Create the required processes to track messaging programs and work with Merchandising Operations to ensure ongoing tracking health.","Collaborate with a team of stunning colleagues across product management, consumer insights, design, data science to develop great messaging experiences."]},{"title":"Qualifications:","content":["6+ years of experience in consumer and/or customer messaging functions","Experience in developing scaled messaging modules/configurations for products is a must; ideally have experience in building B2C messaging configurations at a large organization","Ability to grasp technical concepts quickly is a requirement - including how messaging ‘works’ (technical stack) and how to innovate/develop new opportunities","Experience in development of self-service tooling is required","Experience in messaging performance management is a plus","Experience in understanding recommendation systems is a plus","Strategic, analytical thinker with a strong customer-focused mindset","Excellent written (memos and presentations) and verbal communication skills; timely communication","Highly motivated self-starter with the ability to work independently and drive alignment amid ambiguity","Ability to build strong relationships with stakeholders, effectively influence and contribute with concrete recommendations/next steps across both regional and global teams","Comfortable applying a combination of qualitative and quantitative methods to define success","Insatiable curiosity to learn new domains, keep up with industry innovation, and constantly ask ‘why’"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/f32b8937-af49-4c13-bb38-2842fce6bcab"
            }