            {
                "id": 271,
                "companyId": 6,
                "title": "Content Designer",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Content Designer","Experience Design","User Experience Design","Streaming Platform","Product Features","Machine Learning","Natural Language","Customer Support","Payment Issues","Content Design Team","Global Experiences","Language Approaches","User Behavior","Consumer Insights","Globalization","Storyteller","Cohesive Narratives","Strategic Direction","Voice","Visual Thinkers","Concepts","Content Design","Writing","Project Execution","UX Solutions","Data","A/B Testing","Global Products","Customer Journeys","Content Flows","Communication Skills","Presentation Skills","AP Style"],
                "skills": ["content design","user experience design","streaming platform","payment issue","consumer-facing opportunities","data analysis","A/B testing"],
                "overview": "Netflix is looking for two experienced Content Designers to join their Experience Design team, combining creative leadership and communication with a passion for user experience design and entertainment.",
                "description": "Netflix is looking for two experienced Content Designers to join our Experience Design (XD) team. The successful candidates will combine creative leadership and communication with a passion for user experience design and entertainment.

About the Roles
As part of a cross-functional team, you’ll create clear, scalable product experiences that minimize friction and help Netflix speak meaningfully to a global audience.

Streaming: You’ll concept and create new product features on our streaming platform. This could include helping resolve members’ playback issues, applying machine learning and natural language best practices to customer support experiences, and making it easier to find and enjoy Netflix titles.

Commerce: You’ll work on how our global members pay for Netflix, what happens if they run into a payment issue, and many more consumer-facing opportunities. On the Content Design team, you’ll help identify and lead opportunities to scale tools and tasks to effectively collaborate across teams and build consistent experiences. 

About You
You love using language to create intuitive, frictionless user experiences. You have a passion for both end-to-end feature development and designing experiments focusing on different language approaches. You possess a strong desire to understand user behavior and business success through data and consumer insights, and are passionate about partnering with Globalization to make Netflix amazing around the world.
",
                "extras": [{"title":"Your Skills:","content":["You’re a storyteller who can craft and orchestrate cohesive narratives across platforms.","You provide both strategic direction and hands-on writing.","You’re comfortable developing hypotheses and test plans and working closely with product partners.","You understand that voice is key to people connecting with a brand and product.","You communicate productively with visual thinkers and will be comfortable advocating for your point of view in our candid, feedback-driven culture."]},{"title":"Key Responsibilities","content":["You’ll work on several projects at once, providing concepts, content design, and writing from early ideation through final execution.","You’ll initiate your own projects and identify opportunities to collaborate with other people and teams, to elevate the quality of their work.","You understand how to rationalize UX solutions with data, improve designs through feedback, and thoughtfully question the status quo."]},{"title":"Qualifications","content":["5+ years experience writing for consumer-facing digital products.","Comfortable with A/B testing: Forming a hypothesis, designing a test, and building off results","Experience designing global products for a diverse range of users.","Analytical thinking about customer journeys and content flows.","Outstanding communication, presentation, and people skills.","Mastery of AP style, with the confidence to know when to break the rules."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/cc9ec253-7850-4694-9bf3-c294dfd37682"
            }