            {
                "id": 206,
                "companyId": 6,
                "title": "Content Accountant - Japan",
                "location": ["Tokyo, Japan"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 4,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Content Accountant","Japan","Financial Accounting","Public Accounting","CPA","Accounting","Business","Economics","Senior","J GAAP","US GAAP","IFRS","Communication Skills","Attention to Detail","Data Analysis","Excel Pivot Tables","Contract Review","Curiosity","Passion","Adaptable","Collaboration","Travel","Netflix Culture","Long-Term View","Tokyo Office","Finance Manager","Content Accounting","LA","EMEA","APAC","Content License Contracts","Accounting Policies","Owned Content","Cross-Functional Relationships"],
                "skills": ["Accounting","Excel pivot tables","Data analysis","Financial statements","J GAAP","US GAAP","IFRS"],
                "overview": "The Content Accountant - Japan is responsible for the financial integrity of content commitments, assets, liabilities, and expenses, including setting up and accounting for content license contracts, reviewing and documenting content license agreements, and maintaining cross-functional relationships.",
                "description": "With over 230+ million paid memberships in 190+ countries, Netflix is changing the way we tell and share stories across the globe. We are growing rapidly, creating TV series, films, and documentaries in a diverse range of countries and languages around the world.  

Have you ever wondered how we account for content in our financial statements? Are you curious and invested in how to automate workflows for Accounting? Do you enjoy managing and analyzing large data that is used in critical business decisions? If yes,  we are looking for you to join other stunning colleagues who share a passion to continue to build the premiere entertainment company in the world that is powered by technology.  

 As part of our growing APAC Content Accounting team, this role provides you the chance to join a team that is committed to transforming the perception of what entertainment is and how it can be enjoyed through the Netflix service, and how to supplement that content through consumer products, music, or other off Netflix service distribution.  With continued investment in a slate of content including original productions, content licensing, and international expansion, it's a great time for you to join Netflix.

Like all great companies, we strive to hire the best and we value integrity, excellence, respect, inclusivity, and collaboration. What is special about Netflix, among other things, is our culture and our long-term view. Please spend time understanding our culture and strategy while you review our role qualifications below.
",
                "extras": [{"title":"","content":["Fundamentals of Accounting - You have a minimum of 4 years of experience in a financial accounting or public accounting role, backed by a Bachelor / Academic degree in accounting, business or economics. While not required, it's preferred that you have a CPA or an equivalent certification.","We find that individuals who quickly obtained Senior level at a studio or public accounting firm are more likely to be suited to this unique challenge. If you’re a Senior or a rising star Senior, we’d love to talk to you!Industry experience is not essential to the position if you are enthusiastic about the position, have a strong accounting background (such as experience with J GAAP, US GAAP or IFRS) and are capable of learning quickly.","You have effective communication skills demonstrated through working with stakeholders.","Attention to detail + love for data - We pride ourselves on producing high quality work, scrutinizing important numbers and formulas for accuracy, and using spreadsheets and system data to reconcile accounts and solve problems; we like our accountants to love Excel pivot tables and be unphased by large data sets.","Enthusiasm and quick learning - Enthusiasm for making improvements to existing systems and workflows. Prior work with contract review (revenue, leases, or other complex documents), data entry and analysis, research, and other problem-solving tasks is helpful, but we understand you probably have never done content accounting. That's OK with us because we'll teach you as long as you're excited about learning.","Curiosity and passion - Our team members ask probing questions, challenge the status quo, make changes to improve processes, and have fun while doing it all; a positive attitude and never settling for “good enough” are key, along with fitting into our unique company culture.","Adaptable - You have to be comfortable in an ever-changing eco-system of content, finance and accounting issues and projects.","Flexible to collaborate with our U.S. and other offices across multiple time zones. Willingness to travel to our offices within APAC and overseas .","You embrace and advocate the Netflix culture and our long-term view."]},{"title":"RESPONSIBILITIES","content":["Based in our Tokyo office, reporting to the Japan Finance Manager and closely working with the Content Accounting teams based in LA (as well as those in, EMEA and APAC).","Part of the team responsible for the financial integrity of the company's content commitments, assets (capitalization), liabilities (payments), and expenses (amortization).","Set up (in proprietary contract management system) and accounting of content license contracts, with focus on license fee uploads and payment term assignments.","Review and documentation of content license agreements, which includes interpreting contractual terms and understanding the application of our accounting policies.","Accounting for owned content produced for Japan.","Maintain cross-functional relationships, including the content finance/international finance, tax, legal and acquisition organizations."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/8e510bda-59fc-417b-93ce-3a638a650de8"
            }