            {
                "id": 210,
                "companyId": 6,
                "title": "Coordinator, Post Production - Live Action (Japan)",
                "location": ["Tokyo, Japan"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Post Production Coordinator","Japanese Live-Action Contents","Post Scheduling","Staffing/Vendors","Content Management","Post Production Supervisor","Medium to High Budget Studio"],
                "skills": [""],
                "overview": "The Coordinator, Post Production - Live Action (Japan) position entails managing both internal and third party co-productions in Japan, overseeing the post production processes from pre-production to launch, coordinating with cross functional teams, and maintaining post schedules, vendors, and creative approval sessions.",
                "description": "We are seeking an experienced Post Production Coordinator based in Japan to help manage both internal and third party co-productions from a post perspective with both scripted and unscripted series. This person will manage the titles from the beginning until the launch supporting Post Production Managers in each phase of the post production processes such as pre-production, principle photography, editorial, picture and sound finishing, including consolidating deliverables. 
 
Together, this team is responsible for supervising all aspects of production with our Japan Content team.
 
The Role
A successful candidate will be self-motivated, proactive, assertive, diplomatic in communication, quick-thinking, flexible and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and unwavering attention to detail at all times while working closely with the cross functional teams.
 
This is a demanding and fast-moving position that requires someone who is a proactive and positive thinker, and able to exercise good judgment and initiative. The role will be focused on supporting Japanese live-action contents that are shot and finished throughout Japan.  Basic knowledge and understanding of scripted and/or unscripted workflow required.

Specific responsibilities include, but are not limited to:
",
                "extras": [{"title":"Post Scheduling:","content":["Proactively lead production partners toward efficient execution of the required post production schedule and workflows","Track and manage all post schedules, keeping stakeholders apprised of the status","Communicate and align with internal cross functional teams for the launch preparation","Set up and manage dailies and cut viewing access for shows","Coordinate onboarding partners for the new projects","Update and manage internal database/trackers","Manage Publicity and Marketing requests and assets"]},{"title":"Staffing/Vendors:","content":["Maintain and curate the preferred vendor list for dailies, motion graphics, and finishing","Research and maintain preferred post staff list"]},{"title":"Content Management:","content":["Set up and attend key creative approval sessions such as final dub playbacks, VFX reviews, or color correction reviews","Schedule and attend Netflix screenings, previews, premieres, etc."]},{"title":"Qualifications:","content":["3+ Years as a Post Production Supervisor or Manager working in scripted and/or unscripted content.","3+ years of experience within a medium to high budget studio, network or high volume production company","Ability to handle a fast-paced environment supervising several projects in various points of production (from development through delivery)","Familiar with the current trends and workflows for both UHD/4K and HDR","Ability to respond after hours for important, timely or urgent matters","Team-player who operates in a fast-paced team-oriented setting","Ability to be discrete and maintain confidential information","Understanding of how to prioritize and respond accordingly","Willingness to continue learning to ensure understanding of current post process","Strong written and verbal communication skills and the ability to multi-task","Proficiency in Microsoft Word, Excel, Movie Magic Budgeting, Google Docs, Google Sheets, Google Slides and Google Mail","Working knowledge of UHD/4K cameras, UHD/4K workflows, Avid, Final Cut Pro, Premiere, Resolve, Baselight, Nucoda, Pablo Rio, After Effects, ProTools, IMF, DCP","Professional working knowledge of English and Japanese languages"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7f9a8b46-d65b-4f4e-ae47-b9fda9ee6f2c"
            }