            {
                "id": 214,
                "companyId": 6,
                "title": "Coordinator, Production Management - Unscripted Series",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Coordinator, Production Management","Unscripted Series","Production Planning","Logistics","Organization","Attention to Detail","Production Coordination"],
                "skills": ["production management","unscripted series","vendor relations","pre production","delivery","production coordinator","network management"],
                "overview": "The coordinator of Production Management - Unscripted Series is responsible for managing both internal and third party productions, supporting the assigned Production lead, establishing and curating vendor & staff/crew relations, managing document distribution & communication flow, and suggesting best practices from pre-production through delivery.

",
                "description": "We are seeking an experienced Coordinator of Production to help manage both internal and third party productions, inclusive of a wide range of unscripted programming from multi-cam stage shows to docu-reality follow and competition. The core focus of this role will include the Network management of various large format series. Responsibilities include supporting the assigned Production lead, establishing and curating vendor & staff/crew relations, managing document distribution & communication flow and supporting/suggesting best practices from pre production through delivery while working with external production companies. This position will report to a Manager/Director of Unscripted Physical Production in Hollywood. Together, this team is responsible for supervising all aspects of production with our global original unscripted programming.

The Role
A successful candidate will be passionate and curious about production planning & logistics. They will be self-motivated, flexible, able to pivot when necessary, thorough, and capable in juggling multiple and diverse responsibilities with a strong emphasis on organization and an unwavering attention to detail at all times. This is a demanding and fast moving position requiring someone who is a proactive and positive thinker that is able to exercise good judgment and initiative while working with a high volume production slate.
",
                "extras": [{"title":"Specific responsibilities include, but are not limited to:","content":["Manage complex calendars for executives and arrange production calls involving multiple internal and external teams.","Complete Administrative duties around processing travel (domestically and internationally) and submit expense reports for executives","Coordinate document distribution and production information flow, with emphasis on updating, maintaining, and championing use of Netflix tools and databases internally.","Audit completion/delivery of production materials during pre, production, and wrap.","Participate in beta testing proprietary apps, while offering constructive feedback about the end user experience.","Collaborate effectively with internal operations and technical teams and other production coordinators to streamline workflows across all apps and content teams.","Participate in initial kick off and ongoing production meetings for a large number of productions.","Liaising with the production partner to ensure they are on-boarded and trained to lean on our various tools and Netflix workflows.","Gathering, tracking and entering various production related data among multiple platforms","Helping coordinate department activities (offsites, team building activities, etc) as well as social events for both internal & external groups when requested","Assist with identification and curation of experienced, high quality production staff and crew.","Research and outreach to potential filming locations and studios in the US and abroad.","Any other duties as necessary to support the productions and the department"]},{"title":"Qualifications:","content":["3+ years experience working in production management, in the field, at a network, or production company. Candidates will likely be at the Production Coordinator level equivalent outside of Netflix.","Ability to handle a fast paced environment, simultaneously supporting several projects in various phases of production (from evaluation to production through delivery) and courage to take educated risks while thinking outside the box while always responding in a timely manner","Team-player who operates in a fast paced team-oriented setting","Ability to be discrete and maintain confidential information","Understanding of how to prioritize and respond accordingly","Passionately curious about all aspects of production.","Strong written and verbal communication skills and the ability to multitask","Proficiency in Google Applications (including Google Docs, Sheets, Slides, Mail and Drive)"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/96fae434-acb5-4593-b622-f13ef2f77506"
            }