            {
                "id": 209,
                "companyId": 6,
                "title": "Coordinator, Marketing Operations - Series",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Marketing Operations","Project Management","Production","Cross-functional","Campaigns","Timelines","Asset Management"],
                "skills": ["AV","Print","Digital","Regional production","marketing and publicity campaigns","video","print/OOH","digital materials","internal and third-party tools","asset tracking","asset management","project collaboration","Video and Digital asset types","asset management","servicing and trafficking"],
                "overview": "The Marketing Operations Coordinator for the Coordinator, Marketing Operations - Series position at Netflix will coordinate production needs, communicate campaign requirements, and liaise with stakeholders to ensure timely delivery of assets for Series marketing campaigns.",
                "description": "It's an amazing time to join Netflix as we continue shaping the future of global entertainment! Marketing Operations & Production is a center-of-excellence for creative operations, cross-functional project management, and marketing production, that works closely with Marketing, Communications, & Product groups at Netflix to connect our stories with millions of people worldwide. 
To support our continued efforts, we are looking for an experienced coordinator to join this department, partnering with a team of project managers in all aspects of production. The ideal candidate for this role is enthusiastic, entrepreneurial, organized, and able to thrive in a fast-paced, ever-evolving environment. You're able to be the calm in the storm, and to prioritize competing objectives across a range of global and regional cross-functional partners. 
In short, you build bridges and connect dots...

The Role

A key support function within Marketing Operations & Production, the Marketing Operations Coordinator will partner closely with the Ops Managers leading large scale Series campaigns, as well as producers in our AV, Print, Digital, and Regional production teams, to communicate campaign production requirements, timelines, and delivery status across our Series marketing slate.  Responsibilities include:

",
                "extras": [{"title":"The Role","content":["Coordinate all production needs across AV, print, and digital assets and assist in the development of production timelines","Ensure relevant production elements such as technical specs are communicated to agencies and delivered on time","Liaise with US and internationally-based stakeholders to align on paid media needs, creative development plans, localization strategy and deadlines","Communicate asset status and final delivery timelines with relevant stakeholders","Contribute to the development of our internal workflow applications","Gather operations and production learnings and insights to inform any post mortem conversations and future campaigns","Work with various in-house creative and operational teams to source assets and initiate internal production work"]},{"title":"Qualifications","content":["3+ years of experience assisting and supporting creative, project management, and/or production teams, preferably at an agency, entertainment studio or network.","Knowledge of and experience working on marketing and publicity campaigns, with a strong foundation in creative and production processes for video, print/OOH and digital materials.","A strong background working with internal and third-party tools, preferably tools designed for asset tracking, asset management, and project collaboration.","Well-versed in Video and Digital asset types and formats while understanding the fundamentals of asset management, servicing and trafficking.","Fluent in the language of marketing and/or tooling","Organized and concise with information and communication","Comfortable working with multiple teams and stakeholders across a wide variety of titles and content"]},{"title":"Personality Attributes","content":["See Who We Are and what our Culture is like.","You are passionate and curious about all aspects of entertainment marketing.","You are an enthusiastic self-starter who can proactively determine next steps without being told","You are a natural born communicator, connecting the dots when others cannot and simplifying complex issues and questions.","You thrive in a fast-paced and demanding environment, possess a high level of intellectual curiosity, and demonstrate strong judgment in the face of ambiguity.","You are an agile, goal-oriented personality, driven to succeed and always up for a challenge!"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/5f2203a0-c23e-49f9-9440-cdfd32e95edd"
            }