            {
                "id": 264,
                "companyId": 6,
                "title": "Coordinator, Talent Programs - EMEA",
                "location": ["Amsterdam, Netherlands"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Coordinator","Talent Programs","EMEA","Project Management","Agile Methodology","Jira","Conflict Resolution"],
                "skills": ["Coordinator","Talent Programs","EMEA","AMsterdam","Coordination","Project Management","Team Operations"],
                "overview": "The Coordinator, Talent Programs - EMEA position at Netflix in Amsterdam involves coordinating and managing daily operations, providing support for key programs/projects, leading project management efforts, streamlining workflows, managing vendors, and supporting learning and development initiatives.",
                "description": "Netflix is transforming entertainment all over the world - we currently have over 237 million paid memberships in over 200 countries.  A lot goes into building the world’s leading Internet TV network.  Our members all across the globe enjoy our TV series, documentaries, and feature films across a wide variety of genres and languages.  We’re continuing to grow, and at the heart of supporting our mission is our Talent Team.

Our Talent team supports our employees across the globe in a variety of ways, including supporting development of our people’s skills and capabilities so they can do the best work of their lives at Netflix.  We believe that the responsibility of growth and development of our employees and leaders is shared between Netflix and all our employees.  

Our Talent Management team specifically plays a key role in this effort, and we are hiring a Coordinator to support our EMEA Talent Management and Inclusion teams.  This is a full-time position that will be part of the Talent Management team based in Amsterdam.  These roles will play a key role in helping us grow and scale our Talent Management and Inclusion efforts.

Responsibilities include, but aren’t limited to:  
",
                "extras": [{"title":"Coordination:","content":["Coordinate and manage daily operations and activities supporting Talent Management and Inclusion team efforts","Own meeting logistics (i.e. meeting scheduling, EDU event setups, Google Meet/Zoom functionality, agenda creation, note taking, etc.)","Deliver onsite and/or virtual support for key programs/projects (e.g., Onboarding programs)","Support Talent Management and Inclusion managers with operational and tactical requests around training sessions and team offsites (such as arrangement of psychometrics assessments and collaterals)"]},{"title":"Project Management:","content":["Lead & support buildout of project/program schedules (annual programming)","Own tracking and reporting of projects and key initiatives, working in close partnership with the broader Talent Management team and key stakeholders","Track program data and metrics (eg. attendance, feedback) and suggest recommendations for improvement","Identify opportunities for process improvement and automation, working with Learning Tech colleagues to implement changes"]},{"title":"Team Operations:","content":["Support the creation and updating of Talent Management materials","Collaborate with Talent Management managers to streamline and/or create workflows, templates","Creation and ownership of team communications (projects, programs, offerings, updates)","Ownership of maintaining EMEA portfolio updates in Talent team central tool (Airtable, Asana)","Update and maintain content on learning platforms, sites and other methods","Maintain regional shared folder assets and Google drives","Collaboration on process development and workflows as needed"]},{"title":"Vendor Management:","content":["Own contracting process with vendors, including development of MSA and SOWs, in partnership with team lead","Audit and approve vendor invoices","Monitor budget spend and tracking","Maintain a log of training providers and coaches, and proactively seek feedback of existing providers and information regarding new suppliers"]},{"title":"Requirements for the Role:","content":["3+ years experience in previous roles such as Talent/Recruiting/L&D/inclusion coordinator, administrative assistant, workplace or event coordinator, in fast-paced, complex environments.","Previous I&D (including, but not limited to ERG) experience is beneficial.","Experience supporting training or learning events and/or broader Talent/HR efforts (e.g. team development activities, Employee Resource Groups efforts, culture conversations, onboarding efforts, organisation of offsite events, recruiting events, etc.)","Experience working with learning systems and technology - e.g. Zoom video conferencing software, Learning Management Systems."]},{"title":"We are looking for someone who:","content":["Is knowledgeable, passionate and gets excited when thinking about inclusion, learning & development, and helping our employees grow: You are thoughtful about what our learners need and focus on delivering exceptional learning experiences for them","Stays organized, communicates diligently, and has a high level of attention to detail and accuracy: You have strong project and program coordination skills; You manage your time well - you can balance multiple projects and multiple work streams simultaneously, and effectively prioritize; You can design scalable workflows that are effective and efficient; You have excellent communication skills and engage effectively with clients, vendors, team members worldwide","Effectively collaborates: You are a selfless team player; You are open to and respectful of different working styles; You welcome diverse perspectives and are open to feedback; You bring others along with you as you work on projects","Thrives in a fast-paced environment and navigates ambiguity well: You self-manage, take initiative, and work independently in an ever-evolving, fast-paced environment; You stay flexible and adapt quickly as situations change","Thinks creatively and outside of the box: You are resourceful and can think of creative solutions for problems without easy and straightforward answers","Holds a growth mindset: You’re someone who is curious and excited to learn and grow on our team; You have the ambition to develop Talent Management skills","You live our inclusion value: You work well with people of different backgrounds, identities, values and cultures; You recognize we all have biases and work to counteract them; You treat everyone with respect regardless of their position at Netflix"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/e546aa39-9c75-42c7-a7bf-9c5df9ed33cb"
            }