            {
                "id": 469,
                "companyId": 6,
                "title": "Coordinator, Content - Korea",
                "location": ["Seoul, South Korea"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Coordinator","Content","Korea","Film & Series","Seoul","Track and evaluate","content submission","content partners","departments","title schedules","market and competitive research","operational efficiency","film/series industry","critical thinking skills","international vendors","licensing contracts","communication skills","time-manage","cross-functional","collaborative","resourceful","analytic experience","English","Korean"],
                "skills": ["Coordination","Content","Film","Series","Organizational Skills","Attention to Detail","Communication Skills"],
                "overview": "The Coordinator, Content - Korea position at Netflix is a demanding and fast-paced role that involves tracking and evaluating incoming material, managing content submission, coordinating with departments, conducting market research, and increasing operational efficiency.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. With this international expansion and a move into International originals, it's a great time to join Netflix. 

The Opportunity
We are seeking a Coordinator, Korean content (Film & Series) based in Seoul, Korea.
The successful candidate will be self-motivated, quick-thinking, flexible, and able to juggle multiple and diverse responsibilities, with a strong emphasis on organization and an unwavering attention to detail. This is a demanding and fast-paced role with growth potential that requires curiosity and significant initiative. She/he will report to the Director of the Content Team in Korea.

",
                "extras": [{"title":"Responsibilities:","content":["Track and evaluate all incoming material (including pitches, scripts, books, etc) and provide recommendations for Film & Series","Managing the process and flow of content submission","Interfacing with prospective content partners","Acting as a liaison with various departments (Content Ops, Marketing, PR, Legal, Product) to coordinate information sharing and address incoming requests","Tracking title schedules and key dates for delivery, payments, start dates, options, etc","Conducting market and competitive research","Maintaining flexibility and openness to take on additional projects as necessary or assigned","Increase the team's operational efficiency"]},{"title":"Qualifications:","content":["Min. 3-5 years of experiences to work in the film/series industry","Demonstrates good judgment and strong critical thinking skills","Experience working with international vendors and reviewing/maintaining their accounts, as well as reviewing and executing licensing contracts","Proven communication skills; must be articulate and professional both in written and verbal form","Ability to work proactively, independently and reliably under tight timeframes in a fast-paced environment","High level of organization, detail orientation and ability to time-manage across multiple deadlines","Demonstrated ability to work cross-functionally","Highly collaborative, resourceful, quick thinking and curious with great calm","Research and analytic experience is a plus","Fluency in English and Korean is required"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/557ee7db-0812-4d74-8832-fe5f692c675a"
            }