            {
                "id": 215,
                "companyId": 6,
                "title": "Coordinator, Production Management, Live Action - Japan",
                "location": ["Tokyo, Japan"],
                "type": [],
                "attendance": ["Onsite"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Coordinator Production Management","Live Action","Japan","Vendor & Staff","Crew Relations","Production Management Deadlines","Administration Support","Best Practices","Pre-Production","Delivery","Internal Co-Productions","Production Meetings","Production Staff","Crew Onboarding","Production Resources","Vendor Relationships","Cost Efficiencies","Travel Coordination","Translation","Interpretation Support","Hospitality Mindset","Japanese Live Action Content","Fast Paced Environment","After Hours Support","Team Player","Cross-Functional Collaboration","Confidentiality","Prioritization","Effective Communication","Google Ecosystem Proficiency","Risk-Taking","Fluency in Japanese"],
                "skills": ["Production Management","Coordination","Vendor & Staff/Crew Relations","Administration","Pre-production","Delivery","Production Meetings"],
                "overview": "The coordinator, production management, live action - Japan, is responsible for managing internal and third-party co-productions of Netflix Originals titles, establishing relations with vendors and staff/crew, meeting production management deadlines, and supporting the production management team with administration and best practices.",
                "description": "We are seeking an experienced Coordinator, Production Management to help manage both internal and third-party co-productions of Netflix Originals titles from a physical production perspective. Responsibilities include establishing and curating vendor & staff/crew relations, ensuring all Production Management deadlines are established and met, assisting the Production Management team with administration, and supporting/suggesting best practices from pre-production through delivery. Together, this team is responsible for supervising all aspects of the physical production processes across the Netflix Originals Live Action Japan slate.
 
The Opportunity
Netflix is the world's leading streaming entertainment service with 230+ million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.
 
The Role
A successful candidate will be self-motivated, proactive, quick-thinking, flexible, able to pivot when necessary, thorough and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and an unwavering attention to detail at all times. This is a demanding and fast moving position that requires someone who is a proactive and positive thinker, and able to exercise good judgment and initiative while working with a high volume production slate.

",
                "extras": [{"title":"Specific responsibilities include, but are not limited to:","content":["Set up, schedule and coordinate initial kick off and ongoing production meetings for internal and partner-produced co-productions","Assist with identification and curation of experienced, high-quality production staff and crew","Coordinate the onboarding process for production companies and freelance producers to the Netflix ecosystem, tools, and resources","Update and maintain inward and outward-facing production resources and documents","Research, curate, and develop relationships with vendors, while continually analyzing cost efficiencies","Assist productions and executives in planning and coordinating travel","Provide translation and interpretation support","Any other duties as necessary to support the productions and the department"]},{"title":"Qualifications:","content":["3+ years of working experience ideally in an environment that required attention to detail , proactiveness and a hospitality mindset","Strong passion for the entertainment industry, especially for Japanese live action content","Strong curiosity to learn and continue learning the most up to date production process and equipments","Ability to handle a fast paced environment and simultaneously support several projects","Ability to respond after hours for important, timely or urgent matters","Team-player who operates in a fast-paced, team-oriented and cross-functional setting including communicating with other overseas teams","Selfless with an ability to help other colleagues and seek what is best for Netflix and not yourself","Ability to be discreet and maintain confidential information","Understanding of how to prioritize and respond accordingly while being an effective communicator","Tech savvy and proficiency in Google Ecosystem (including Google Docs, Sheets, Slides, Mail and Drive) is a plus","Willingness to take educated risks and think out of the box","Willingness to travel across the region to help set up productions","Excellent written and verbal communication in English, and fluency in Japanese"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/0ab21cdc-01af-41e1-8d30-4be8caee8bcf"
            }