            {
                "id": 468,
                "companyId": 6,
                "title": "Corporate Card and Expense Specialist",
                "location": ["Mexico City, Mexico"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 2,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Expense Operations","Corporate Card Program","Employee Experience","Communication Skills","Card Management","Vendor Relationships"],
                "skills": ["Workday Expense","CitiBank systems","ZenDesk","G-Suite","Slack","Microsoft Suite","coding of expenses"],
                "overview": "The Corporate Card and Expense Specialist position at Netflix in Mexico City is responsible for handling corporate card charge inquiries, managing the corporate card program, assisting with employee-related inquiries and projects, and day-to-day management of corporate card and vendor relationships.",
                "description": "At Netflix, we are shaping the future of entertainment by bringing top-quality global content to virtually every country around the world. Members can play, pause and resume watching, all without commercials or commitments. As we expand globally, we continue to look for the best and brightest talent to help us scale. Visit our culture deck and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team. 

Our Global Expense & Corporate Card Operations team is searching for an operations professional to support the global business. This position is located in Mexico City and will be responsible for providing an excellent employee experience for all Netflix Expense & Corporate Card related inquiries from around the globe. The ideal candidate will be detail oriented, organized, able to process a large volume of corporate card orders and inquiries, and will possess excellent communication skills. 

This is an exciting opportunity to be part of a stellar global team and part of a fast-paced and growing international company. 
",
                "extras": [{"title":"Responsibilities","content":["Field and respond to corporate card charge inquiries related to expense report creation and submissions in Workday for Netflix employees from around the world.","Manage administration of the corporate card program, including but not limited to issuance of new cards, increases in card limits, fraud charge inquiries and lost cards.","Assist expense team analysts regarding employee-related inquiries and projects.","Assist in employee outreach and engagement related activities.","Day-to-day management of corporate card management and vendor relationships."]},{"title":"Qualities We’re Looking For","content":["Ability to multitask and handle high volumes of support requests","High professional proficiency in English and Spanish (Portuguese is a plus)","Finance and/or operational experience preferred","Basic accounting understanding related to coding of expenses","Excellent written and verbal communication skills","Extremely organized and detail oriented","Demonstrated ability to identify and drive improvements and continuously simplify processes","Able to communicate effectively with team members","Ticketing system experience - ZenDesk is a plus","Tech-savvy - Experience with G-Suite, Slack, Microsoft Suite a plus","Corporate Card and Expense systems experience - experience with Workday Expense, CitiBank systems is a plus"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7b25263a-7962-45e3-9c0d-1da6c3ed15ca"
            }