            {
                "id": 176,
                "companyId": 6,
                "title": "Counsel, Advertising Legal Affairs",
                "location": ["Los Angeles, California"],
                "type": [],
                "attendance": ["Onsite"],
                "experience": 4,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Advertising Legal Affairs","ad measurement companies","legal challenges","trainings","ad tech","entertainment experience","analytical capabilities"],
                "skills": ["ad tech","ad measurement","entertainment experience","autonomously","reliable","fast-paced","high-performance","interpersonal skills","communication skills","analytical capabilities","sound judgment","problem solving","strategic thinking","commercial thinking","practical thinking","organizational skills","time management skills","multitasking","prioritization","deadlines","strategic interest","professional ethics","flexibility"],
                "overview": "The Counsel, Advertising Legal Affairs role at Netflix is responsible for providing legal support for the ad supported offering, including advising on advertising product/tech features, negotiating agreements with ad measurement companies, proposing solutions for legal challenges, and conducting trainings for the advertising teams.",
                "description": "Netflix is the world's leading streaming entertainment service with 238 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. 

The Netflix Advertising Legal & Policy Team is seeking a talented, passionate and experienced lawyer to support our ad supported offering.  

In this role, the successful candidate will work closely with cross functional teams, including Advertising, AdTech, Product, Business and Legal Affairs, Privacy, and Product Legal, to perform the following functions: advise on advertising product/tech features; negotiate agreements with ad measurement companies; strategize and propose solutions for sticky legal challenges; and prepare and conduct trainings to help increase legal acumen across our newly formed advertising teams.  This is a great opportunity to be an integral part of our Advertising legal team to support our growing advertising offering.  This role is based in either Los Angeles, CA or New York, NY and reports into the VP - Advertising Legal & Policy. The ideal candidate will be intellectually curious, demonstrate great initiative and be excited and inspired by the Netflix culture.
",
                "extras": [{"title":"Requirements","content":["The successful candidate will have 4+ years of relevant experience as a lawyer working in ad tech / ad measurement. Entertainment experience is a plus.","The successful candidate will also possess the following:","Ability to work autonomously and reliably within tight timeframes in a fast-paced, high-performance environment","Exceptional interpersonal and communication skills (both oral and written)","Strong analytical capabilities and ability to exercise sound judgment in the absence of perfect information","Ability to take initiative to identify and solve problems in a business-friendly and solutions-oriented manner","Ability to think strategically, commercially and practically","Excellent organizational and time management skills with an ability to multitask, prioritize and meet deadlines","Strategic interest and outlook","High degree of professional ethics and integrity","Flexibility to work across various projects and teams"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/8bac2b97-9b96-4e7c-a31e-125a936ad665"
            }