            {
                "id": 484,
                "companyId": 6,
                "title": "Counsel, Employment Legal - Netherlands (Fixed Term)",
                "location": ["Amsterdam, Netherlands"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 6,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Counsel","Employment Legal","Netherlands","Fixed Term","Parental Leave","EMEA Head Office","Amsterdam"],
                "skills": ["employment legal","employment issues","employment matters","employment law risk","employment-related legal developments","employment-related litigation","outside counsel"],
                "overview": "Netflix is seeking a Counsel, Employment Legal - Netherlands for a fixed term to provide support on corporate employment matters, advise on employment issues, proactively assess and balance legal risk, stay updated on employment law, handle litigation when necessary, collaborate with global legal team, and maintain a diverse and inclusive workplace. The ideal candidate is a qualified lawyer in the Netherlands with 6 to 12 years of employment law experience, strong English skills, and preferably experience in an international environment.",
                "description": "Netflix is one of the world’s leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anywhere, and can change their plans at any time. 

Netflix is looking for a Counsel, Employment Legal - Netherlands to cover for a parental leave on the team ideally between December 2023 to August 2024 (9 months).

We are looking for someone who ideally has great passion for the Netflix brand and our content, and who - although temporarily - wants to be a part of our global team of employment lawyers who use their legal knowledge and experience in the most practical and risk-tolerant way possible to support our ever-growing business.

This position is based in our EMEA head office in Amsterdam and will support our operations in The Netherlands. The role reports to the Director, Employment Legal - EMEA also based in Amsterdam. Next to them, you’ ll be working closely with our other Director, Employment Legal - EMEA based in London, a senior counsel, also based in London and the team’s leader and Global Director, Employment Legal based in Los Angeles, California. Our other global employment lawyers on the team in APAC and LATAM will also work closely with you.

We have multiple corporate offices and a large slate of local language original series and films being produced all across the region in Europe, the Middle East and Africa. This means that we have a wide array of different roles and employees based across our EMEA offices. From Marketing to Business Development and from Tax to Physical production. All these teams are supported by an amazing HR/Talent team and employment legal. While part of this job might be to handle issues on productions, the main focus will be to provide support to our corporate operations. 
",
                "extras": [{"title":"Some other examples of what you’d be doing:","content":["Main focus: Advise on corporate employment matters in close collaboration with members of HR (Talent), Employee Services, Employment Tax, Mobility & Immigration etcetera.","Provide subject matter expertise and, when appropriate, train on a broad range of employment issues, including recruiting, contingent workers, employment practices, and terminations, to name a few;","Proactively identify, assess, and balance employment law risk, and be able to offer practical, business - oriented and creative solutions in partnership with the business teams;","Stay current with, and advise Netflix on, meaningful employment-related legal developments;","When necessary, help investigate incidents and/or complaints and manage employment-related litigation in The Netherlands;","Actively collaborate with the Global Employment Legal team on projects and issues;","Select, manage and use outside counsel effectively; and","Support Netflix’s commitment to maintaining a diverse and inclusive harassment-free workplace."]},{"title":"Requirements :","content":["The successful candidate will be a qualified lawyer in The Netherlands and have 6 to 12 years of experience in an employment department of a firm and in-house experience counseling on employment issues in The Netherlands. The ideal candidate:","Is strong at both written and spoken English","Preferably has proven experience working in an international environment or working for international clients","thrives in an environment where freedom and responsibility are core values, and passion, innovation, collaboration, and curiosity are essential."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/6b53f72e-c545-4131-8251-eeed458d0457"
            }