            {
                "id": 243,
                "companyId": 6,
                "title": "Creative Writing Strategist, Growing & Emerging Markets - EMEA",
                "location": ["Amsterdam, Netherlands"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 10,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Creative Writing Strategist","Growing & Emerging Markets - EMEA","Writing Strategy","Multilingual Proficiency","Content Editing","Copywriting","Communication Skills"],
                "skills": ["English","Arabic","EMEA media knowledge","writing and editing","communication skills","organizational skills","AP style"],
                "overview": "The Creative Writing Strategist, Growing & Emerging Markets - EMEA position at Netflix involves writing and overseeing clear, engaging, and accurate copy in English and at least one of the GEMs market languages, working with a team to build context around titles and connect users to content they love, collaborating on cross-functional innovation projects, and overseeing resources and providing editorial guidance.",
                "description": "Netflix is building the world’s leading entertainment platform, offering great films and series that push the boundaries of storytelling and delight members of all ages and tastes across the world. Our team, Creative Writing Strategy, shapes the words that guide members to the content that is right for them. 

We are seeking a seasoned writing strategist to join our team. The ideal candidate is a skilled writer and editor who is an expert on media coming from the Europe/Middle East/Africa Growing and Emerging Markets (EMEA GEMs) slate of Netflix. We are particularly interested in writers who have proven multilingual proficiency in writing and editing world-class creative content. Expertise in content from Arabic countries is particularly welcome.

Responsibilities 
You'll be expected to write and oversee clear, engaging, accurate copy in English and at least one of our GEMs market languages. In addition to executing writing tasks yourself, you'll work with a talented team of entertainment writers, editors, and colleagues across the globe to build context around titles and help connect users to the content they love.

You’ll apply your writing expertise and passion to cross-functional innovation projects, collaborating with other writing, analysis, localization, design and product teams. Since we are part of a distributed team, you’ll use Slack, Google Workspace, email and other digital tools to communicate about assignments, projects and publishing deadlines. 

You’ll work with a Managing Editor to ensure that projects are adequately resourced with the right writers, and you’ll ensure that external resources (vendors) have access to relevant information and provide editorial guidance for high-priority titles. You’ll also collaborate closely with other stakeholders to gather insight on Netflix original language content and support the writing efforts to bring this content to a global audience.

",
                "extras": [{"title":"What Will Help You Succeed","content":["Deep content and cultural knowledge about EMEA media, including current trends in entertainment. Simply put, you’re a superfan who’s excited to write about film and TV from the region — and help Netflix members around the globe get excited about it, too.","Experience and comfort collaborating with multifaceted digital production teams.","A love of language. Even though you’re an expert with deep knowledge, you’ll always write with an empathetic understanding of a broader audience in mind. You must be comfortable with rigorous editing, tight deadlines and workshopping copy with a team of writers and editors.","Flexibility and versatility as a writer. Whether the assignment at hand is a trailer script for highbrow film, a synopsis for blockbuster rom-com or an animated educational series for kids, you understand that different types of content should have copy tailored to their respective tones.","A commitment to our team’s core values, like candid feedback, passion and curiosity.","Experience with creating at scale and working with outsourcing models.","Innovative thinking. We’re looking for someone who’s constantly looking for ways to improve the member experience through experimentation and testing."]},{"title":"Key responsibilities:","content":["Align with stakeholders on creative briefs to ideate, oversee and/or execute copy for high-touch, high-priority titles on the service. This could pertain to films, series, games, trailers, and other copy found on the product","Create and supervise creative briefs for external vendors working on high-touch titles","Contribute to innovation initiatives and give feedback to continuously improve writing tools and workflow","Share context around specific markets and initiatives with cross-functional partners and Managing Editors — these include presentations, regular syncs with partners, etc.","Work with the Managing Editor to continuously update documentation for writing standards and quality control, including sensitive language style guides, regional workflow, etc.","Audit and provide feedback on writing tasks executed by external partners. This includes regularly reviewing synopses and other relevant writing tasks, completing scorecards, providing meaningful and actionable feedback to partners, and escalating concerns to the Managing Editor as needed"]},{"title":"Key Qualifications","content":["10+ years experience in writing and editing in creative spaces, such as consumer-focused copywriting, short-form digital, scriptwriting or entertainment journalism","Full native fluency in English and Arabic (written and spoken)","Strong business acumen and proven stakeholder management skills","A nuanced perspective on EMEA media","Independent and self-motivated working style","Mastery of AP style","Excellent organizational skills","Outstanding communication skills"]},{"title":"Good-to-Haves","content":["Fluency in a third language is a plus","Recently published examples of film/television criticism or culture writing","Experience working with global brands","Experience with AB testing","Management experience"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/e2372d07-f141-4cd9-95e7-42987a916c77"
            }