            {
                "id": 223,
                "companyId": 6,
                "title": "Data Scientist (L5) - Promotional Media - EMEA",
                "location": ["Amsterdam, Netherlands"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Data Scientist","Promotional Media","EMEA","Java","Project Management","Agile Methodology","Jira"],
                "skills": [""],
                "overview": "Data Scientist (L5) - Promotional Media - EMEA: A senior data scientist based in Amsterdam, partnering with cross-functional teams to uncover insights and drive innovations, ultimately shaping promotional content.",
                "description": "Our mission at Netflix is to connect global stories with global audiences. When a Netflix member opens our app, we have a few precious moments to help them choose a story that is right for them at that instance. Presenting them evidence – Artwork, Trailers, Synopses – that authentically represents each title and resonates with the member is essential to this effort.

Getting this evidence just right for each title is a tall order but our creative strategists, art designers, and video editors are masters of this. Perhaps a more unique aspect of Netflix is that these teams leverage data to inform their decision-making. This is made possible because Netflix UI is a thriving learning machine, personalized via reinforcement learning. 

Europe is a significant center for our broader Studio and Creative Production teams. We’re looking for a Senior Data Scientist based in our Amsterdam office to join our growing European team. In this role, you would serve as a trusted partner for regional Creative Production leadership. Given this data & insights-rich landscape, we are looking for a highly motivated Senior Data Scientist to partner with teams and product managers. This is an opportunity for you to have direct influence on strategic decisions through technical and thought partnership that will ultimately shape promotional content.
",
                "extras": [{"title":"As a Senior Data Scientist in this space, you will…","content":["As a Senior Data Scientist, you will be partnering with a diverse range of cross-functional partners to uncover new opportunities, design, execute, and analyze experiments, and deliver solutions that have a significant impact and implications for our users","You will help drive innovations through effective identification and application of analytics, causal inference, experimentation, and machine learning","This is a high-impact role in which you will have a direct influence on how product decisions are made","Effectively identify and apply analytics, causal inference, experimentation, and machine learning techniques for given problems","Lead the design, analysis, and interpretation of experiments Proactively perform data exploration on engagement behaviors to discover future opportunities","Identify, compute and validate the appropriate metrics to measure success in a product area","Cultivate strong partnerships with cross-functional stakeholders from product, engineering, operations, design, consumer research, etc"]},{"title":"You are…","content":["Advanced degree in Statistics, Mathematics, Physics, Economics or related quantitative field","5+ years relevant experience with large scale data","Strong statistical knowledge and intuition - ideally utilized in experimentation or other product analytics settings","Strong product knowledge and intuition - ideally utilized in consumer/ or user interface settings or internally serving technical audiences such as engineers","Demonstrated ability to communicate and drive product change","Strong SQL skills","Strong Quantitative Programming skills in Python or R","Ability to work independently and drive your own projects","Ability to communicate technical and statistical concepts clearly and concisely among audiences at many different levels","Plus: Experience in building real-world machine learning models with demonstrated impact","Plus: Experience creating data products and dashboards such as Tableau","Plus: Experience in building causal inference solutions","Plus: Familiarity with software engineering practice and working with APIs","Netflix culture resonates with you"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7e3cf052-d468-479d-a171-babf082d0ca4"
            }