            {
                "id": 277,
                "companyId": 6,
                "title": "Director, Product and Live Ops",
                "location": ["Helsinki, Finland"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Product Management","Product Marketing","Player Support","Community","Live Operations","Portfolio Strategy","Go-to-market Strategies"],
                "skills": ["Product Management","Product Marketing","Player Support","Community","games-as-service","free-to-play","early-phase development"],
                "overview": "The Director of Product and Live Operations is responsible for product management, product marketing, player support, and community engagement, collaborating closely with the Studio Creative Director and Leadership team to form a portfolio strategy and ensure live-operable games with effective go-to-market and post-launch operations.",
                "description": "The Director of Product and Live Operations is responsible for four key strategic areas: Product Management, Product Marketing, Player Support  and Community. They will play a pivotal role in forming a portfolio strategy for the studio from their perspective, in close collaboration especially with the Studio Creative Director, Studio Director, as well as the rest of the Leadership team. 

The Director of Product and Live Operations works in partnership with the Studio Creative Director to ensure our games are built as services and live-operable from the get go, with a deep focus on building go-to-market strategies and tactics and scalable post-launch live-operations operations as well as related KPIs and measurement. The Director of Product and Live Operations also collaborates closely with the Studio Development Director, responsible for production and project management, to ensure ways of working and structures support building live operable mobile games in an efficient way.

Director of Product and Live Operations role in relation to Studio Creative Director role
Director of Product and Live Operations focuses on the portfolio and service whereas the Studio Creative Director focuses on creative strategy and gameplay experience. These two roles are together responsible for establishing and leading the studio’s game portfolio strategy leaning heavily on Netflix’s internal studio goals. 
New games incubation, prototyping and concepting efforts are under Studio Creative Director and game projects prior to moving to production report to Studio Creative Director. As games approach launch and the live-service phase, they will report to the Director of Product and Live Operations.

Key responsibilities

Product Management: The Director of Product and Live Operations is responsible for the Product Management (PM) discipline and building and executing a live-operations strategy and tactics across Next Games’ titles. They ensure our games are built live operable from the get go, with appropriate tooling, data-driven strategy and campaign tactics in mind. Works closely with their own team (4 people in Product Management)  and the rest of the studio, especially game team leadership and product marketing, Player ExperienceX and Community. 

Product Marketing: Responsible for developing and directing all the marketing activities across the studio’s game portfolio. This includes go-to-market planning, active involvement in game development in order to ensure on-point branding, product-market fit and marketability. They plan and execute marketing strategies and tactics for product launches and major game updates in close collaboration with Netflix teams. Works closely with their own team (2 people in Product Marketing) and the rest of the studio, especially game team leadership and product management, Player ExperienceXpereince and Community.

Player Support & Community: Responsible for defining, communicating and  maintaining our player support and community engagement vision as well as ensuring alignment with the studio’s strategic direction and ability to drive economies of scale in service delivery. Works closely with their own team (1 +2 in Player ExperienceX), and the rest of the studio, especially game teams, product Marketing and Product Management.
",
                "extras": [{"title":"Skills, characteristics & qualifications:","content":["Robust experience from crafting player engagement strategies and operating in a games-as-service and free-to-play environment.","Skilled in combining perspectives from different disciplines such as Product, Data, Player Support, Marketing and Design to craft integrated plans to engage, retain and acquire players.","Experience and understanding of early-phase development and how to inflict concepting and prototyping with a product-mindset in order to facilitate building games live operable from the get go","Data-informed, growth mindset: top capability to interpret data into actionable insights to help inform product strategy","Previous experience in a leadership role on preferably multiple mobile game projects and an exceptional track record in people management.","You have exceptional communication skills which will help you bridge the gap between the business and creative sides of the company. You can take charge in a deadlock situation, and help reach a unified vision supported by everyone."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/0fe38f95-27f0-47b3-a2ff-2668c9ce1c5f"
            }