            {
                "id": 275,
                "companyId": 6,
                "title": "Director / Senior Manager, Inclusive and Accessible Game Development",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": ["D&I strategy","game sourcing","development","design framework","inclusive design","accessibility guidelines","inclusion and accessibility"],
                "overview": "",
                "description": "This is your chance to be at the forefront of Netflix's new offering of Video Games. Netflix is revolutionizing entertainment. We connect people globally with movies and shows by delivering outstanding content and technological innovation through the world's leading streaming entertainment app, with 220 million paid memberships in over 190 countries.

Members can watch as much as they want, anytime, anywhere, and now they can enjoy an expanding collection of Netflix curated and produced Games.  At Netflix, we have an insatiable need to continually improve our product experience and the creative elements that support it, providing great value to our members, and this team sits at the forefront of the effort.

Netflix is looking for an experienced Diversity and Inclusion Lead to join the External Games team. This role will report to the VP of External Games and lead the formation and execution of our games D&I strategy across the External Games portfolio, including plans for inclusive and accessible games. This role interacts with External games leadership, Producers, Business Development, Product Manager and Creative Leads across External Games, as well as cross-functional partners, to create rigor around Game Design and development to ensure we are focused on Accessibility, Inclusion and Diversity. Additionally, the Diversity and Inclusion Lead will drive change within the industry and identify opportunities for Netflix games to support and amplify underrepresented developers and voices. 

The candidate will have a proven track record of building a strong D&I strategy for games with the ability to execute, whilst supporting external development teams to deliver must-play games. 
",
                "extras": [{"title":"Responsibilities:","content":["Develop and manage a shared D&I strategic vision for External games including best practices, programs, goals and budget","Inspire the External Games team to integrate the D&I strategic vision as an integral part of our game sourcing, development and design framework so that the vision comes to life.","Partner with the External Games team to ensure diversity is an integral part of our game sourcing, development and design frameworks","Provide External Partner education to ensure our developers are set up for success and understand what our members need","Work with game teams to support their inclusive design needs","Build, maintain and operationalize accessibility guidelines and workflows to support inclusion","Support external partners as they approach game development with an inclusion lens, including providing feedback and overseeing the work of specialized consultants and vendors","Partnering cross-functionally to influence and embed inclusion and accessibility into strategies for Games research, QA, platform and discovery","Ensuring the development teams get access to the right training and learning opportunities to improve their ability to make accessible and inclusive games","Work with VP, External Games to create a clear Games industry impact strategy to define how we can best serve the industry as well as support and amplify underrepresented talent. This includes partnering with organizations such as WINGs, BVIG, IDGA and more.","Oversee daily operations of all programs related to the initiative, applying structured methodology to lead change management activities"]},{"title":"Qualifications:","content":["8+ years experience within game diversity, inclusion and accessibility","Experience in game development environments across mobile and PC","Deep inclusion strategic knowledge with experience implementing high-level strategy into successful programs that drive change","Experience planning and leading global programs at scale with an established point of view on how D&I can impact the games industry","Strategic leadership expertise","Experience leading through influence and inspiration, with the ability to use relationships to promote results","Collaborative with the ability to structure mutually beneficial partnerships","You have an uncanny knack for arriving at solutions through unconventional methods and developing a plan to put them into action","You have excellent communication and are able to work with a variety of people, effectively communicating everything from data to creative feedback","Passion for video games, innovations in software and how they enrich the player experience","Understanding of the landscape and new inclusion, accessibility and representation developments in new media, tech, and the entertainment industry"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/393aabd3-2be4-44a1-bbc4-9369379964a8"
            }