            {
                "id": 229,
                "companyId": 6,
                "title": "Distributed Systems Engineer (L4/L5) - Cloud Engineering",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Distributed Systems","Cloud Engineering","Java","C++","Go","Python","Reliable Systems","Cloud Environment","Technology","Pragmatic Thinking","Complex Problems","Services","APIs","Tooling","Bets","End Engineering Users","Business Needs","High-Quality Solutions","Proactiveness","Effective Communication","Ambiguity","Test-and-Learn Approaches","Independent","Self-Driven","Netflix Culture"],
                "skills": ["Java","C++","Go","Python","distributed systems","cloud environment"],
                "overview": "The Distributed Systems Engineer (L4/L5) - Cloud Engineering position at Netflix involves building and operating highly reliable distributed systems in a cloud environment, contributing to network platform enhancements, delivering scalable and efficient compute platforms, and managing storage services at exabyte scale.",
                "description": "Netflix is one of the world's leading streaming entertainment services with over 231 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.

Netflix has been on the leading edge of the cloud since beginning the migration to AWS 15 years ago and runs one of the largest Cloud footprints around. The Cloud Engineering organization exists to manage that massive scale, constantly innovating to increase fleet-wide agility, efficiency, and reliability of the Netflix cloud infrastructure, while solving scale problems that we are the first to ever hit. We build, operate, and maintain Compute, Network, and Storage services so that developers at Netflix can rely on foundational building blocks when entertaining hundreds of millions of customers around the world. Join us as we push the boundaries of performance and resilience, empowering developers to create groundbreaking applications on a reliable platform.

We are looking to add new stunning colleagues to all of our subteams outlined below.

Networking
The Network Platform at Netflix focuses on providing developers with a highly reliable and efficient network infrastructure. Our goal is to enhance the network's reliability, availability, scalability, security, and observability while abstracting away complexity, so application owners can concentrate on addressing business challenges. Our scope includes components such as Edge Proxies/Gateways, mid-tier Service Mesh & Service Discovery, Cloud DNS, Network Observability, Network-as-a-Service, VPC & eBPF infra, and Cloud Load Balancing. By joining the Network Platform team, you'll be part of an engineering group that plays a vital role in improving Netflix's Network infra, directly impacting the company's overall performance and user experience.

Compute
The Compute team’s mission is to deliver a scalable, reliable, secure, agile, and efficient Compute Platform to provide innovative experiences for our members and content creators around the world. Our products power workloads across our Data Platforms, Stream Processing, Studio and Content, Encoding, Streaming, Content Delivery, Machine Learning, and Engineering Tooling. The team not only designs and develops our tier-one systems but also operates and supports them 24 by 7.

We are hiring for multiple roles across our teams which span problem domains including capacity management, traffic and failover, container execution across EC2 and our multi-tenant container platform, and on-host runtime execution and performance.

Storage
The storage team offers storage and insights products. Our products provide storage services to platforms, applications and users around the globe which are performant, secure and centrally managed; enabling platforms to move, store and efficiently archive data in the cloud. We offer a consistent mechanism to create & manage object/block/file resources, integrate Netflix ecosystem for access control and provide observability into the cost & lifecycle of these resources, by taking ownership of existing tools and shaping a more cohesive strategy. We manage storage at exabyte scale and enable Netflix to serve a huge amount of content around the globe.
",
                "extras": [{"title":"Must-have skills & experiences","content":["Recent and proficient experience with Java, C++, Go, Python, or similar","Experience building & operating highly reliable distributed systems in a cloud environment","Passion for technology, pragmatic thinking, ability to jump into an ambiguous area and break down complex problems"]},{"title":"What you'll be doing in the role","content":["Building and operating Services, APIs, and Tooling for a variety of use-cases","Balancing bias to action with the ability to make well-informed bets","Engaging directly with end engineering users to understand their needs and improve their experience","Understanding and solving business needs at scale with high-quality solutions","Leaning into proactiveness and effective communication in pursuit of cross-functional alignment"]},{"title":"You will be successful in these roles if","content":["You thrive in ambiguity; complex and fuzzy requirements are more common than clearly defined customer expectations","You take incremental steps toward solving big problems; test-and-learn approaches work better than heads-down development","You are independent and self-driven; progress is often self-directed by teams & individuals","You’ve read about Netflix’s culture and think you would thrive here"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/318e0378-8ef5-47a3-8921-db4c308e0bf3"
            }