            {
                "id": 232,
                "companyId": 6,
                "title": "Editorial Communications Coordinator - APAC",
                "location": ["Manila, Philippines"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Editorial Communications","APAC","writing","editing","entertainment industry","business","technology","digital platforms","fast-paced","collaborative","editorial services","publicity","communications teams","drafting materials","company assets","communications strategies","Asia Pacific","Pan-Regional Communications team","Senior Manager","About.Netflix.com site","corporate writing","journalism","entertainment industry","technology industries","digital platforms","content management systems","strategic thinking","organizational skills","project management skills","global environment","clear and concise communication","English","Asian language","Contentful","content management systems","writing samples","Netflix culture","good judgment","innovation","selflessness","courage","impact","candid communication","passion","curiosity"],
                "skills": ["content management systems","strategic thinking","organizational","project management","global environment","English","Asian language"],
                "overview": "The Editorial Communications Coordinator - APAC will assist with editorial duties, including updating the company's website and Netflix Newsroom, providing brainstorming and editing services to publicity and communications teams, and managing digital platforms.",
                "description": "Do you want to help tell the story of Netflix? Do you enjoy writing and editing succinctly and clearly for sophisticated entertainment industry, business and technology audiences? Do you enjoy helping create and manage digital platforms that better help tell and share these stories? Do you thrive in a fast-paced, collaborative environment? If so, we may have just the opportunity for the right person on our growing communications team. 

The Role
The Editorial Communications Coordinator, APAC, will help with a range of editorial duties including updating the company’s About.Netflix.com website and specifically our Netflix Newsroom. This position will provide editorial services, including brainstorming formats and editing drafts, to our various publicity and communications teams in the region, and also help draft other materials and update company assets as needed. This role will help bring our communications strategies to life through the assets and tools they help manage. The ideal candidate is able to work quickly and meet deadlines. The role is a part of the Asia Pacific Pan-Regional Communications team, and will also work closely with our Senior Manager, Editorial Communications based in UCAN to ensure that the About.Netflix.com site is operating exceptionally, and reflecting regional priorities.

",
                "extras": [{"title":"Qualifications","content":["3-4+ years of past experience in corporate writing and editing or journalism, preferably with deep experience in the entertainment and/or technology industries","Experience and enthusiasm for helping improve and manage digital platforms such as content management systems, and have strong strategic thinking, organizational, and project management skills","Be able to manage multiple tasks simultaneously under deadline and thrive in high energy, fast-paced environment","Be able and willing to operate in a global environment","Be a clear and concise communicator in English, additional Asian language a bonus","Working knowledge of Contentful or similar content management systems is a plus.","Writing samples are also required."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/068d588d-fcac-4856-a697-c640d0f11746"
            }