            {
                "id": 293,
                "companyId": 6,
                "title": "Engineering Manager, Consumer ML Model Compute & Serving Foundations",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Engineering Manager","Consumer ML Model","Compute","Serving Foundations","Java","Project Management","Agile Methodology"],
                "skills": ["ML infrastructure","scalable systems","distributed systems","ML models","engineering management","technical acumen","hiring and growing engineers"],
                "overview": "The Engineering Manager, Consumer ML Model Compute & Serving Foundations position at Netflix involves building scalable, robust systems and infrastructure for running machine learning models at scale across various Consumer domains.",
                "description": "Location: Los Gatos, CA

Netflix is the world's leading streaming entertainment service, with over 230 million paid memberships in over 190 countries, enjoying TV series, documentaries, and feature films across various genres and languages. Members can watch or play as much as they want, anytime, anywhere, on any internet-connected screen. 

Machine Learning/Artificial Intelligence powers numerous aspects of the Consumer Experience, including innovation in content discovery and personalization for members, identifying and attracting new members to our product, optimizing our payment processing, and many more. 

The Opportunity

The Consumer Model Compute & Serving Foundations team provides the foundation for model computation, inference, and serving for all ML/AI innovation across the various Consumer ML domains. The team is responsible for developing all the building blocks required to run ML models at scale. These building blocks include a model serving platform, an event-driven model compute framework, a compute orchestration engine, and many more.

We are looking for an experienced engineering leader for this area, which is a central focus of our business. You will be highly cross-functional in partnering with other engineering, product management, machine learning, and data teams to take Netflix’s ML/AI initiatives to the next level. To be successful in this role, you need a strong ML infrastructure background and a passion for building scalable, robust systems that enable and accelerate our ability to apply large and complex ML models across a wide range of Consumer domains. 

",
                "extras": [{"title":"Minimum Job Qualifications","content":["3+ years of engineering management experience","Experience leading a team responsible for building high-traffic distributed systems and ML infrastructure to support large-scale ML models with a direct impact on the customer experience","Strong technical acumen and can act as a credible technical advisor to the team, set and enforce a high-quality bar for code and system design, and be a mentor for the team","A track record of hiring and growing diverse, highly talented tenured engineers deep into their careers to maximize their impact","Excellent at communicating context with the team, stakeholders, partners, and leadership, giving and receiving feedback, fostering new ideas, and empowering others without micromanagement","Passion for translating the needs of ML practitioners into infrastructure offerings with an eye toward automated and self-serve capabilities","Demonstrated ability to develop, drive, and execute a technical vision and roadmap","Comfortable managing a majority-remote team with partners distributed across (US) geographies & time zones"]},{"title":"Preferred Qualifications","content":["BS/MS in Computer Science, Applied Math, Engineering, or a related field","10+ years of software engineering experience","Experience building high-scale services on a public cloud like AWS, Azure, or GCP and comfortable with Java","Built ML infrastructure offerings for ML Researchers, Data Scientists, and other ML practitioners"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/8693f049-58dd-4687-a6d0-50fb50168328"
            }