            {
                "id": 295,
                "companyId": 6,
                "title": "Engineering Manager, Game Lifecycle Engineering",
                "location": ["Los Gatos, California"],
                "type": [],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 180000,
                "salaryMax": 900000,
                "salaryFormat": "per-year-salary",
                "salaryCurrency": "USD",
                "salaryBonus": "Unspecified",
                "tags": ["Game Lifecycle Engineering","Software Development Lifecycle","Backend Services","Full-stack","Management","Project Execution","Partnerships"],
                "skills": ["Java","Python","AWS","Docker","Kubernetes","Git","RESTful APIs"],
                "overview": "The Engineering Manager, Game Lifecycle Engineering will lead a team of software engineers to deliver outsized impact in reinventing video games on a global scale.",
                "description": "Bring your passion for games and engineering to help us achieve our next big objective, to reinvent video games on a global scale. Netflix fundamentally changed how the world watches television, with over 230 million members enjoying award-winning TV series, documentaries, and feature films.  Join our team to help pioneer a next-generation video game platform.

Game Lifecycle Engineering (GLE)

GLE enables game studio partners to publish their games and to integrate with the Netflix Game Developer Platform (NGDP).  The team works with game producers, technical account managers, and partner engineers to deliver “games workspace”, a product to manage the software development lifecycle for game builds and feature integration.  The application is web-based with backend services and customer workflows.  The team is full-stack to allow for rapid iteration.

In this role, you will

Lead a team of highly capable software engineers to deliver outsized impact.  A successful manager leads by role-modeling the Netflix culture.  
",
                "extras": [{"title":"The following qualities and behaviors will help you thrive in the position:","content":["Drawing from video games experience will help to understand the domain quickly.","Leverage 3-5 years of management experience to influence successful outcomes.","Act like an owner with a bias-to-action mentality.","Be a credible technical advisor by drawing from past work with complex software systems.","Can effectively manage project execution both internally and cross functionally.","Committed to building and maintaining healthy partnerships.","Able to grow individuals and boost collective performance.","Can articulate complex ideas and influence decisions.","Prioritizes psychological safety to facilitate a healthy level of team engagement.","Strategic in thinking, can build a coherent vision for the future.","Strives for high-quality and high-value results, able to negotiate what’s best for Netflix."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7d81ad38-c9c9-4292-a041-7c733286d8f1"
            }