            {
                "id": 296,
                "companyId": 6,
                "title": "Engineering Manager, Games Discovery",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "",
                "description": "Engineering Manager - Games Discovery

Who We Are
Netflix is one of the world's leading entertainment services with over 230 million paid memberships in over 190 countries. We are passionate about delivering joy to hundreds of millions of Netflix members around the world, whether they’re traveling to a remote location or at home with family. In addition to great shows and movies, our membership now also includes exclusive access to a growing portfolio of high-quality games. 

The Games Discovery team is responsible for the experiences that allow members to find their next favorite game on any platform of their choice. The team innovates across the entire Netflix app as well as external canvases, and utilizes A/B tests to understand member needs. We are looking for an engineering manager to lead the team comprising highly capable software engineers, to deliver outsized impact. 

",
                "extras": [{"title":"Who You Are","content":["You are an experienced engineering manager with a focus on leading UI teams.","You have relevant technical experience, building user-facing products on Android or iOS.","You have experience building and leading high performing engineering teams.","You are great at building relationships with cross-functional partners.","You are a people-centric leader who leads with empathy and creates a psychologically safe work environment.","You proactively give and receive feedback, and are not afraid to have difficult conversations.","You are comfortable dealing with ambiguity and thrive in a fast paced environment.","You are excited to work in the gaming space."]},{"title":"What you will do","content":["Lead a team of cross-platform engineers to experiment and innovate on Netflix Games Discovery.","Empower, challenge, and coach team members to grow their impact as individual technical leaders by providing them with context and continuous feedback.","Effectively identify, prioritize, and manage high-impact initiatives on the team’s technical roadmap.","Lead technical discussions and make informed decisions regarding the platform-specific technical strategy.","Collaborate, build alignment, and develop strong relationships with cross-functional partners across business areas, leveraging exceptional written and verbal communication skills.","Foster an inclusive team culture that enables team members of all backgrounds to succeed and thrive.","Exemplify the Netflix culture by understanding, advocating, and demonstrating its values."]},{"title":"Learn More","content":["We believe safe spaces where everyone can be their authentic selves is the key to a successful team so we welcome and embrace all identities, cultures, and backgrounds.","Our US-based team is happy to embrace remote work."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/cb1c2c4b-ba98-4f3b-9f9a-6d45ecbd68e1"
            }