            {
                "id": 235,
                "companyId": 6,
                "title": "Engineering Manager - Ads Platform Engineering",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Ads Platform Engineering","Client and Server Side Ad Insertions","Content Delivery System","Ad Encoding","Content Understanding","Metadata","Brand Safety"],
                "skills": ["Java","Python","AWS","Docker","Kubernetes","SQL","A/B testing"],
                "overview": "",
                "description": "At Netflix, we want to entertain the world and are constantly innovating on how entertainment is imagined, created and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 233 million paid subscribers. 

We launched a new ad-supported tier in November 2022 to offer our members more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point, while also creating a compelling path for advertisers to reach audiences that are deeply engaged.
Our Team

The Ads Platform Engineering teams build advertising systems and integrations that powers the delivery of ads using our world class content delivery ecosystem. We use a number of Netflix investments and innovations to power our ads - unique mix of client and server side ad insertions, state of the art content delivery system, ad encoding recipes, content understanding and metadata etc. We deliver ads in a manner that’s thoughtful of our member’s viewing experience and drive great outcomes for advertisers. We also ensure that advertiser brand safety is ensured during serving, members only see the most appropriate ads for them.

Our team is new and yet faced with the enormous ambitions of building highly performant advertising systems and delivering high impact to our business by monetizing our incredible slate of content. As one of the newest entrants in the Connected TV advertising space that’s rapidly growing, we seek to build unique value propositions that help us differentiate from the competition and become a market leader in record time.

We are looking for a people manager to join us on this journey, to lead some exciting initiatives and the talented engineers who work on realizing our ambitious vision.
",
                "extras": [{"title":"As a Engineering Manager you will:","content":["Drive success in a fast paced, flat organization with minimal process and a heavy emphasis on ownership.","Support your team by contextualizing the larger vision, enabling prioritization and fostering high focus and executional excellence.","Becoming an ambassador of the Netflix Culture","Create a dream team by hiring, retaining, and growing high performing talent."]},{"title":"Skills & experience we’re seeking:","content":["10+ years of total experience with 3+ years of management experience in building and leading diverse software engineering teams.","A strong product mindset along with experience in delivering large complex projects collaborating with a variety of cross-functional stakeholders that are technology, operations or business focused.","Well grounded domain experience in advertising, having built and operated ad delivery systems such as ad servers, bidders, yield optimizer etc.","Familiarity with or built identity graphs and audience targeting, and various flavors of ads measurement.","General understanding of the advertising marketplace and landscape. Familiar with A/B testing and experimentation."]},{"title":"Nice to haves:","content":["Familiarity with legal compliance and changing landscape of ads regulations around the world.","Familiarity with ML and advertising systems that leverage data to drive optimal outcomes for the users and the business.","Experience working in the CTV space and knowledge of it’s unique constraints","Awareness of ads industry technology standards (e.g VAST, OpenRTB) or worked on an industry consortium effort, working group etc."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/716136e7-e49c-44a5-80b9-7dbae0c95d15"
            }