            {
                "id": 174,
                "companyId": 6,
                "title": "Events Manager - CEE",
                "location": ["Warsaw, Poland"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Events Manager","CEE","Events Strategy","Marketing","PR","B2B Events","Campaigns"],
                "skills": ["Events Manager","CEE","Warsaw","Events Strategy","cross functional team","end to end project management","agency pitches"],
                "overview": "The Events Manager - CEE will be responsible for creating and delivering the CEE Events Strategy, including external events, employee moments, and B2B events, to drive conversation around Netflix titles, talent, and brand through curated events and experiences.",
                "description": "The Opportunity
It’s an amazing time to be joining Netflix as we continue to transform entertainment globally. Netflix is the world's leading internet entertainment service with over 231 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films and games across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, as much as they want, anytime, anywhere, and can change their plans at any time. 

The Role
We are looking for an Events Manager to lead our events efforts for the CEE, based in Warsaw. 

Responsible for the creation and delivery of the CEE Events Strategy, which is made up of a variety of events from external events which are key beats in marketing and PR campaigns, alongside shaping the strategy for our employee moments in the Warsaw office and our important B2B Events. 

At Netflix events are valued as an important tactic in our campaigns and the goal of the team is to drive conversation around Netflix titles, talent and the brand through curated events and experiences.

",
                "extras": [{"title":"Responsibilities","content":["This experienced events person will work with the cross functional team to identify which titles will benefit from events as part of their campaigns for the CEE region.","Work in sync with the cross-functional team and show a curiosity about promotional efforts and contribute to building campaigns with new and innovative event ideas.","You will collaborate with the Country Leadership team to advise and shape the employee event strategy for the year.","This is also a hands-on role and one that requires end to end project management of some of the events - that will mean jumping in to lead cross functional project task force groups, managing agency pitches, ideating creative show flow, overseeing guest communications, formulating budgets, and much more.","Management responsibilities will include monitoring the resource needs of the CEE events slate, ensuring all projects are staffed effectively across the team, identifying resource gaps and hiring in additional temporary resources if deemed.","The role will also be accountable for the CEE events budget and managing the CEE stakeholders across comms, marketing and content.","Most importantly the role will continue to evaluate our events across CEE ensuring we are best in class, identifying areas for improvement and putting in the necessary frameworks / solutions to make the improvements identified."]},{"title":"Candidate Profile","content":["Has a minimum of 10 years of experience in an events management role, leading strategy through to execution at an entertainment studio, network or with a global brand.","Strong problem solving skills, with the ability to get to the root cause of issues quickly and independently solve them. A simplifier V a complicator, with a strong bias to action","Strong sense of independent thinking - someone who can garner a deep understanding of a campaign's goals and determine if an event is, or is not, the right approach, and challenge project ROI.","Priority on strategy V tactics. Whilst both are important this role needs to have a clear eye on the bigger picture with curiosity into how other countries are solving challenges","Passionate and excited by the work we do and a drive to constantly improve with openness to feedback and willingness to act on it.","You have a succinct and candid communication style, both written and verbally, with a strong POV, and can expertly influence key stakeholders and foster deep relationships across the business, even when saying no.","Thrives in a fast-paced and collaborative environment, comfortable in managing multiple projects concurrently."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7738fa6d-bf9b-4198-a842-728847d6e155"
            }