            {
                "id": 301,
                "companyId": 6,
                "title": "Games Service Reliability Manager",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 6,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Operational Strategy","Reliability","Player Services","Development Services","Operations Team","Infrastructure","Processes","Game Platform Partners","Standards","Incident Management","Prevention","Continuous Improvement","Stable Infrastructure","Strategic Directions","Operation Structures","Incident Management Program","KPIs","Service Delivery","Continuous Improvement Processes","Workflow Understanding","Industry-leading Reliability Patterns","Stakeholder Relationships","Experience","Live Game Service Operations","Partnerships","Platform Engineering","Technical Product Management","Game Development","Customer Support","Big Picture Strategy","Plan Execution","Scaling Business","Problem Solving","Project Management","Organization Skills","Core Hours","Meetings","PST"],
                "skills": ["incidents management","continuous improvement processes","reliability strategy","live game service operations","strong partnerships","big picture strategy","project management"],
                "overview": "The Games Service Reliability Manager is responsible for delivering an operational strategy to strengthen the reliability of player and development services for games on Netflix, setting standards of reliability, incident management and prevention, and establishing a stable infrastructure for players and developers.",
                "description": "We are looking for a highly-skilled and motivated leader to help deliver an operational strategy that will strengthen the reliability of our player and development services. This role is a part of the Operations team, our mission is to establish best-in-class infrastructure and processes that support development and live operations of games on Netflix. In this role, you will work closely with game platform partners and game studios to set standards of reliability, incident management and prevention. You will be responsible for establishing a reliability strategy, executing that strategy, and continuously improving, resulting in a stable infrastructure for our players and developers.
",
                "extras": [{"title":"Responsibilities:","content":["Develop strategic directions and operation structures to serve the growing service reliability needs for games on Netflix","Manage and enhance our incident management program and develop KPIs for effective prioritization of work","Deliver quality service by establishing a world-class continuous improvement processes to identifies and addresses operational issues","Collaborate and support partners including engineering, technical product management, and customer support by understanding their workflows and needs","Influence peers to adopt industry-leading reliability patterns and practices","Cultivate and maintain strong relationships with stakeholders across the company"]},{"title":"Requirements:","content":["6+ years of experience managing reliability of games, technology, and publishing services","Experience with live game service operations; supported games that operated a live service model of build and content updates","Proven ability to build strong partnerships across organizations and disciplines, including: platform engineering, technical product, operations, game development, and customer support","Experience driving big picture strategy and plan execution to support a scaling business","Ability to manage ambiguity. You use your instincts, experiences, and team to identify, assess, and solve problems quickly and frequently","Project Management and Organization Skills. Your communications are clear, concise, and specific","Work core hours are 9am to 4pm PST; which means you should be available for meetings etc. during this time"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/d1c753e6-bdd4-49a0-953d-fb5dbbe9699e"
            }