            {
                "id": 302,
                "companyId": 6,
                "title": "Global Client Partner",
                "location": ["London, United Kingdom"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "",
                "description": "Netflix is one of the world's leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as they want, anytime, anywhere, and can change their plans at any time. 

With the launch of our ad-supported model in 12 major markets, we are now working toward providing more choices for consumers and a premium, better-than-linear TV brand experience for advertisers. That said, we are looking for founding team members who will be instrumental in shaping this new business area for Netflix!

We are seeking a Manager, Global Brands to help shape multinational partnerships that deliver customer solutions while helping accelerate the overall growth of Netflix Global Business Solutions. The Global Brands team will play a critical role in establishing and leading strategic partnerships between Netflix and key Global Brands. This team is consultative in nature and will lead the long-term growth of each global account. 

As a Manager, Global Brands, you will act as the strategic ambassador responsible for building Netflix's reputation and revenue. The ideal candidate is creative, entrepreneurial, deeply passionate about cross-functional account development, proficient in high-level strategic thinking and local market enablement. This role requires the ability to work across different time zones and cultures and bring a philosophy of client-centricity to the role both internally and externally.
",
                "extras": [{"title":"Key responsibilities:","content":["Build on the strengths of the Netflix portfolio of product offerings to shape the vision, global strategy, approach, local coordination, and success metrics for Netflix top global brand customers.","Develop and maintain C-level relationships to expand Netflix's presence, and educate and inform on the power of Netflix","Partner with Microsoft, Category teams, and other teams to grow revenue across the business","Work with Netflix Ad Sales Product, Marketing, and Research to ensure that client’s needs are being met","Build 'ground up' comprehensive business plans, global in nature and local in execution, that will drive top line revenue growth & communicate go-to-market strategies with internal stakeholders while accounting for local and regional considerations","Stay current on video advertising trends and digital innovations","Work with regional sales leadership to establish/set strategic objectives and goals that maximize business impact.","Regularly consult with local/regional sales leadership to enhance brand and product level positioning and engagement in their markets.","Sustain close communication and alignment with clients and local sales counterparts to maximize client strategies and maintain trust and collaboration.","Represent Netflix at key client events, as a thought leader & speaker."]},{"title":"Qualifications","content":["Minimum 15+ years of experience including considerable time managing global accounts for a platform/publisher","Extensive Advertising Partner strategy development and consultative skills and proven track record working across multinational organization leadership teams","Truly global experience operating at global networks or with global brands in previous roles and have deep understanding of countries, cultures, and languages","Proven strategic thinker with the ability to analyze data and translate it into specific and measurable tactics, actions, and outcomes","Consultative and Problem solver with the ability to collaborate and work across functions","Understanding of how our clients set priorities and performance goals, and how we can align our product portfolio to best fulfill those needs","Excellent written, verbal and interpersonal communication skills","Strong, confident presentation skills"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/110b84f1-71c4-40dc-b9aa-a42993502ccd"
            }