            {
                "id": 313,
                "companyId": 6,
                "title": "Language Production Manager, Dubbing - India",
                "location": ["Mumbai, India"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Dubbing Production","Localized Experience","Creative Intent","Language Production Manager","Audio Assets","Dubbing Partners","Dubbing Infrastructure"],
                "skills": ["Dubbing production","Localization production","Localized audio assets","Dubbing infrastructure","Dubbing partners","Talent casting","Dub translation"],
                "overview": "The Language Production Manager, Dubbing - India position at Netflix is responsible for overseeing the creative aspects of localization production in the Indian region, ensuring compliance with technical and creative standards, building relationships with talent, and addressing localization challenges.",
                "description": "THE OPPORTUNITY
Netflix is the world’s leading internet entertainment service with over 200  million memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. The Netflix Dubbing Production team is responsible for getting those amazing programs to our growing international audience. Centered around dubbing/VO production, a great team environment, and cutting-edge technology, this group is critical to Netflix’s ability to provide the best localized experience of our great content. With this international expansion, the preservation of creative intent in the production of a localized experience is of utmost importance, what a great time to join Netflix!

This position will report to the Dubbing Manager - India. Together, this team is responsible for the creative aspects of their region’s localization production working closely with various teams across Netflix.  The ultimate goal of the Dubbing team is ensuring Netflix customers across the globe get the highest quality experience from our localized audio assets. As we continue to add support for new languages and expand our global membership, providing best-in-class localized content is critical to our success.

THE ROLE
The ideal candidate will have a great passion for language, experience with the production of dubs in the Indian region, a deep appreciation of regional cultural differences, and a high level of intellectual curiosity. The role requires you to develop a deep understanding of our original content and be able to strategically identify the challenges and complexities dubbing localization will face before production begins. Preserving original content creative intent will be your mission and developing creative approaches to the local challenges at hand will be your passion. 

As a Language Production Manager, Dubbing, your goal will be to represent Netflix’s quality, culture, and mission in the territory. Making sure our dubbing partners are compliant with our technical and creative standards is crucial for the local strategies. This is a demanding and fast-moving position that requires someone who is a proactive and positive thinker, and able to exercise good judgment and initiative.  Deep understanding and awareness of local dubbing infrastructure, talent market, and nuances will be the key to success in this role.

",
                "extras": [{"title":"RESPONSIBILITIES","content":["Be the leading voice of dubbing production in the respective dubbing market","Define standards for excellence and general creative guidelines for the respective territory/country","Analyze content to identify and solve localization challenges in collaboration with the Title Managers/Coordinators on select titles","Build and leverage strong relationships with the talent community in the respective territory/country. Maintenance and growth of existing talent databases","Collaborate with Dubbing Partners and/or Title Managers and Coordinators on dubbed talent casting and enforcement of creative guidelines on select titles","Supervise eligible recording and/or mixing sessions for sensitive and/or high-priority titles","Accommodate and/or provide risk assessment for any special upstream localization requests in the territory. Address, resolve and escalate issues and concerns as needed","Constantly monitor and support local existing dubbing partners to ensure creative and operational excellence is maintained.","Keen awareness of the local dubbing market and future collaborations","Consistent upkeep and education around union/labor/talent-related situations that could impact Netflix’s content","Support and collaborate with cross-functional partners for Inclusion & Diversity initiatives to ensure our strategy is consistent across the organization","Be sensitive to the competitive landscape in the respective market"]},{"title":"REQUIREMENTS","content":["5-10+ years prior experience in managing localization and/or creative workflows within the entertainment industry; background in dubbing creation and a passion for languages and translation quality.","Excellent written and verbal communication skills. Native speaking skills in at least one regional language, preferably Tamil and/or Telugu is preferred.","Prior experience in managing localization workflows in the entertainment industry; background in dubbing and subtitling creation and a passion for languages and translation quality.","Deep understanding of differences, subtleties, and nuances between subtitle and dub translation.","Attention to detail: able to get to the root cause of a problem; able to creatively figure out a solution or propose changes to existing workflows, priorities, tools & technologies, as required.","Sensitivity to servicing, particularly within the internal organization, including but not limited to the Marketing team, Public Relations, and Content team.","Creativity and the passion to challenge current industry standards & practices.","Able to represent Netflix in any industry event on the respective territory/country.","Familiarity with the current trends in the entertainment industry in the respective country/territory is a must.","Understanding of all forms of professional audio formats, technology, best practices, and maintenance."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/f3ab56d7-fa12-4d2f-9e2c-26c0685f3000"
            }