            {
                "id": 315,
                "companyId": 6,
                "title": "Lead Product Manager, Boss Fight Games",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": ["Product Strategy","KPIs","Game Performance","User Research","Analytics","A/B Testing","Team Management"],
                "overview": "The Lead Product Manager at Boss Fight Games owns player engagement, retention, and lifetime value for one or more games in the company's portfolio, defining product strategy, KPI goals, and success criteria, leveraging data for actionable insights, managing and coaching other PMs, and collaborating with multi-disciplinary teams and external partners.",
                "description": "The Lead Product Manager owns player engagement, retention, and lifetime value for one or more of the games in Boss Fight’s portfolio. The Lead PM will play a key role in defining product strategy, KPI goals, and success criteria for live operations and feature development on the game(s). The role will be responsible for setting reporting standards and leveraging data to deliver actionable insights that will shape the direction and roadmap for the game(s) under their purview. The Lead PM will manage and coach other PMs, and collaborate across multi-disciplinary teams including production, design, art, engineering, marketing, and with external partners.
",
                "extras": [{"title":"Essential Functions/Responsibilities","content":["Product Strategy","Partner closely with the General Manager to define an overall vision for the product and to create a clear product roadmap of prioritized features and initiatives that work toward that broader vision","Monitor game performance and guide the PM team to define and drive KPIs and targets for products and features","Implement effective review cycles of the state of our games that carefully consider internal and external feedback as well as key product metrics to continually improve the product","Drive user and competitive research to identify user segments, highlight player needs and product value propositions to maximize player engagement, retention, and LTV"]},{"title":"Player Insight","content":["Define and implement metrics and tracking tools for the product and use the data to inform game design and drive decisions for optimization and future feature development","Partner with analytics to establish experimentation road map, using A/B testing to meet goals and create product and player insight. Translate outcomes into actionable recommendations","Leverage live ops tools, analytics, A/B testing, and other tools to optimize player experience and drive business objectives","Identify opportunities to maximize player experience and performance"]},{"title":"People Management","content":["Manage, mentor, and motivate other Product Managers in a way that encourages autonomy, mastery, and purpose","Lead and inspire team members to find a resolution for complex problems","Develop successful relationships across the studio and with external partners to deliver meaningful business outcomes"]},{"title":"Skills and Abilities","content":["Strong business & creative capabilities. You can connect detailed player behavior and financial outcomes","Ability to perform research analytics at industry, genre, and game level to shape products","Able to manage multiple, and competing tasks and be self-directed in a quickly evolving environment and meet deadlines with limited direction","Excellent attention to detail and strong desire to iterate and improve on processes","Strong critical thinking and problem solving skills","Ability to coach, manage, mitigate, and prioritize through stressful situations for you and your team","Excellent written and verbal communication. Comfortable interacting and presenting to all levels of the company, especially key stakeholders, and publishers","Exceptional mentoring and supervisory skills and abilities","Self-motivated team player able to work in a team environment with maturity and leadership"]},{"title":"Education and Experience","content":["8+ years of experience in product management, games systems design, or data analytics in games as a service (mobile, PC, or console)","3+ years of experience managing direct reports","Strong experience in quantitative analysis, including the ability to model game parameters using Excel, SQL, and business intelligence tools such as Tableau","Experience with A/B and multivariate testing","Understanding and experience with a wide range of business models including, but not limited to, free-to-play and subscriptions business models","Bachelor’s degree in math, finance, statistics, economics or related field preferred","MBA a plus"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/d8bc0fcd-5fe4-4a98-b28c-6a7be673460d"
            }