            {
                "id": 323,
                "companyId": 6,
                "title": "Machine Learning Engineer (L6) - Globalization",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 2,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Machine Learning Engineer","Algorithmic Strategies","ML Engineering","Localization","Global Entertainment","ML Systems","Infrastructure"],
                "skills": ["Machine Learning","ML Engineering","Production Systems","Distributed Data Processing","Model Training","Algorithmic Strategies","Roadmaps"],
                "overview": "The Machine Learning Engineer (L6) - Globalization at Netflix is responsible for designing and developing systems and infrastructure for high-quality localization at scale, collaborating with cross-functional teams to deliver business impact and shape algorithmic strategies for global entertainment.",
                "description": "At Netflix, our mission is to entertain the world by connecting our members to an extensive library of stories from all over the globe. We are revolutionizing international storytelling as we deliver billions of hours of movies and TV shows per month to 200+ million members across 190+ countries in 30+ languages. 

The Globalization Data Science and Engineering team is at the forefront of removing language barriers and providing a stellar member experience to all our members regardless of their language preferences. We are responsible for the translation and cultural adaptation of all aspects of member interaction, including beautiful localized user interfaces, subtitles, and dubbing of award-winning Netflix originals.

We are looking for an experienced Machine Learning Engineer to design and develop systems and infrastructure for algorithms that power high quality localization at scale. In this rare opportunity, you will have the chance to shape visions for algorithmic strategies and lead executions of ML engineering solutions for localization and global entertainment. You will partner with a talented cross-functional team of scientists, engineers, product managers, and domain experts to deliver business impact with these strategies and solutions.
",
                "extras": [{"title":"Responsibilities","content":["Act as tech lead for identifying impactful Machine Learning (ML) opportunities and proposing algorithmic strategies in greenfield areas under a multi-modal setting","Be a thought leader for stakeholders and cross-functional collaborators to define and drive multi-year roadmaps for ML systems and infrastructure that can support growing business needs in global markets","Mentor, brainstorm with and enable other scientists and engineers to transform ML and Deep Learning (DL) research into scalable engineering solutions integrated into production workflows","Build and foster strong communities of ML engineering collaboration, innovation and best practices internally and externally","Uplevel the greater team through sharing knowledge and guiding thought on the adoption of new ML methodologies"]},{"title":"About you","content":["Extensive experience in ML engineering for production grade systems that require skills in large-scale distributed data processing and model training","Experience leading ML initiatives with a proven track record of bringing clarity to and leading ambitious roadmaps for algorithmic strategies in collaboration with business stakeholders","MS or PhD in ML, Computer Science or related fields","Broad knowledge of ML and DL research especially for text and speech","Familiarity with common ML and DL frameworks such as PyTorch or Tensorflow","Exceptional communication and collaboration skills coupled with strong business acumen","Comfortable with ambiguity; able to take ownership, and thrive with minimal oversight and process","Netflix culture resonates with you"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/acc077a2-d3c1-442c-bdfe-fdb00f5d4ade"
            }