            {
                "id": 322,
                "companyId": 6,
                "title": "Machine Learning Engineer (L5) - Ads",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Machine Learning Engineer","Ads","Advertising Technology","Optimization Methods","Forecasting Services","ML Algorithms","Data Pipelines"],
                "skills": ["Python","TensorFlow","PyTorch","Spark","REST","GraphQL","API"],
                "overview": "The Machine Learning Engineer (L5) - Ads position at Netflix involves building the foundation of the ads business, conducting analyses, developing predictive models, and implementing new algorithms to create more choices and joy for members.",
                "description": "At Netflix, we seek to entertain the world. We have more than 200 million members in 190 countries, reflecting that great stories can come from anywhere and be loved everywhere.  In April 2022, we announced that we are creating a new lower priced, ad-supported tier for our customers. We are now working toward our goal of providing more choice for consumers and a premium, better-than-linear TV brand experience for advertisers.

The Ads Data Science and Engineering team at Netflix’s mission is to help build the foundation of the ads business at Netflix. We conduct analyses and develop analytic tools, build predictive models and algorithms using machine learning, all with the goal of creating more choices and joy for our members. We are looking for a Machine Learning Engineer with a background in advertising technology, preferably in either optimization methods or forecasting services. In this role, you will work cross-functionally from research through the implementation of new algorithms that will help lay the foundations for our advertising business. 
",
                "extras": [{"title":"In this role, you might tackle these kinds of problems:","content":["Implement scalable and performant ML algorithms to mimic the behavior of ad server algorithms and bidder systems. Optimize and fine-tune these models as real-world systems evolve.","Design data pipelines to generate realistic and diverse data sets representative of real user behavior, ad impressions, and ad requests.","Detect shifts in data used by ML models to identify issues in advance of deteriorating prediction quality, estimating the uncertainty of model outputs, automating prediction explanation for model diagnostics.","Work on the architecture and implementation of a feature store that facilitates seamless sharing and access to data among various machine learning models. Ensure data consistency, security, and efficiency to promote collaborative model development and optimization.","Design and implement forecasting as a service for various customers across sales and ads serving.","Develop infrastructure to run performant and efficient simulations of ads platform behavior."]},{"title":"In this role, you will:","content":["Independently deliver effective solutions to problems.","Own full-stack technology, from data to product and the feedback loop.","Synthesize common patterns & build effective abstractions across different ML pipelines that accelerate the impact of ML driven insights.","Develop horizontal solutions to Increase robustness of the team’s ML model portfolio.","Partner with the Data Engineering, ML Infrastructure and Ads Platform Engineering teams in a two-way exchange of best practices.","Communicate results to a variety of audiences, technical and non-technical.","Enact Netflix values in daily work and interactions."]},{"title":"Qualifications:","content":["At least five years of experience in applied ML or ML systems/infrastructure.","Strong proficiency in programming languages such as Python, and experience with machine learning libraries (e.g., TensorFlow, PyTorch).","Familiarity with big data technologies and distributed computing frameworks (e.g., Spark) to handle large-scale simulations.","Experience in implementing techniques for uncertainty estimation and prediction explanation to enhance model interpretability.","Experience building and designing low-latency API frameworks, using paradigms such as REST, GraphQL etc.","Experience building out reliable ML-based microservices that seamlessly integrate with systems such as Ad Servers, OMS, and Internal tooling. Solid understanding of ad-serving technologies, programmatic advertising, and real-time bidding (RTB) mechanisms is a plus.","Excellent communication skills and an ability to translate business context and intuition into data-oriented hypotheses to drive impact.","Excellent problem-solving skills and the ability to think critically in complex, dynamic environments.","Proactive attitude towards learning and a willingness to stay updated with industry trends and advancements."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/c1aad31d-7358-452b-b467-7d9d76b419b2"
            }