            {
                "id": 325,
                "companyId": 6,
                "title": "Manager, Accounts Payable - EMEA",
                "location": ["Amsterdam, Netherlands"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Manager Accounts Payable","EMEA Teams","Invoice Processing","Invoice Resolution","Payments","Process Improvement","Automation"],
                "skills": ["Accounts Payable processes","workflows","leadership skills","communication skills","collaboration","metrics","SOX compliance"],
                "overview": "The Manager, Accounts Payable - EMEA position is responsible for leading the EMEA team in invoice processing, resolution/dispute management, and payments, while ensuring compliance, customer service, fraud prevention, and process efficiency.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.

It's an exciting time at Netflix as we continue to expand our business globally. We are revolutionizing the way people watch their favorite shows and movies, and building our own library of original Netflix content for all to enjoy. Visit our Culture Memo and Long-Term View to learn more about our unique Netflix culture and our bold goals for the future.

We are looking for a Manager of Accounts Payable to lead our EMEA Teams which includes invoice processing, invoice resolution/dispute management, and payments. In this role you will set the strategic direction for the AP organization and manage relationships with key internal and external stakeholders. Your focus will be on scaling the team and workflows to ensure compliance, excellent customer service, reduce fraud/risk, and drive process efficiency, all while maintaining accuracy and safeguarding the company’s resources. This position will reside in the company’s EMEA Headquarter office in Amsterdam and will report to the US-based Global Sr. Director of Finance Procurement Operations and the Amsterdam-based VP, Controller EMEA, LATAM & APAC.
",
                "extras": [{"title":"Responsibilities:","content":["Lead and manage the EMEA team; EMEA process owner responsible for invoice processing, invoice resolution/ dispute management, and payments","Safeguard company assets, prevent fraud, and ensure compliance with financial regulations and policies (e.g. SOX requirements, GAAP, etc.,)","Identify, drive, and implement opportunities for process improvements and automation. Build scalable workflows by leveraging technology that can be applied across an expanding geographic footprint","Drive increased OCR adoption","Partner closely with the other team within FPO (Procurement Business Partners, Supplier Management, and Supplier Diversity) to ensure alignment and direction towards our vision/strategy","Foster a positive and inclusive team environment that encourages collaboration, accountability, and continuous learning and growth","Collaborate with key cross-functional stakeholders in Engineering, Accounting, Finance, Tax and Treasury departments","Develop and maintain AP controls and policies over the payables process: Monthly AP close procedures; Process flow and internal control documentation; Regulatory reporting, such as 1099’s; Internal and external auditors; Business continuity planning; Review and approval of all daily pay cycles and off cycle payments","Develop performance metrics and service level agreements","Enhance and managing an AP location strategy based in Manila"]},{"title":"Skills & Experience:","content":["Deep understanding of Accounts Payable processes with the ability to rebuild workflows","Strong leadership skills and decision-making ability as well as comfort being a hands on leader","Effective communication and interpersonal skills for successful collaboration and relationship-building","Enthusiasm for collaboration and a willingness to work across departments and companies to establish effective working relationships","Ability to utilize metrics to measure and improve performance and drive targets for the team","Understanding of SOX compliance rules and guidelines, GAAP, and the P2P process","Experience with implementing process improvements and leveraging technology to streamline AP operations","Proven track record of successfully managing large AP teams and complex payment processes","Ability to prioritize and manage multiple competing tasks and demands in a fast-paced and dynamic environment.","Proficient in Excel and knowledge of cloud related ERPs systems a plus (Workday experience a plus)"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/af7e49d1-fa99-470d-87ce-87eb4bc71dc3"
            }