            {
                "id": 349,
                "companyId": 6,
                "title": "Managing Editor, Creative Writing Strategy - EMEA",
                "location": ["Amsterdam, Netherlands"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 2,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Managing Editor","Creative Writing Strategy","Editorial","Content Management","Media Operations","Content Creation","Copywriting"],
                "skills": ["English","Outsourcing","Editing","Writing","Creative Work","Project Management","Communication"],
                "overview": "The Managing Editor, Creative Writing Strategy - EMEA position at Netflix is responsible for overseeing the production of clear, engaging, and accurate copy in English, working with external partners and collaborating with global teams to connect users to the content they love, while also providing editorial guidance and updating writing guidelines for external partners.",
                "description": "Netflix is building the world’s leading entertainment platform, offering great films and series that push the boundaries of storytelling and delight members of all ages and tastes across the world. Our team, Creative Writing Strategy, shapes the words that guide members to the content that is right for them. 

We are seeking a seasoned Managing Editor to join our team. The ideal candidate is a skilled writer and editor who is an expert on media and operations and is deeply knowledgeable about content coming from the Europe/Middle East/Africa (EMEA) slate of Netflix. We are particularly interested in candidates who have experience working in creating copy at scale and deep experience in working with external fulfillment partners.

Responsibilities 
You'll be expected to oversee the scaled production of clear, engaging, accurate copy in English with a team of external partners. While this is not a people manager role, prior management experience will set you up for success. You’ll work with a talented team of entertainment writers, editors, and colleagues across the globe to build context around titles and help connect users to the content they love.

You’ll apply your writing expertise and passion to cross-functional innovation projects, collaborating with other writing, analysis, localization, design and product teams. Since we are part of a distributed team, you’ll use Slack, Google Workspace, email and other digital tools to communicate about assignments, projects and publishing deadlines. 

As Managing Editor, it is your job to ensure that projects are adequately resourced with the right writers, and that external resources (vendors) have access to relevant information and provide editorial guidance for high-priority titles. You’ll also help guide innovation programs, implement their findings, and constantly evolve and update writing guidelines for external partners.
",
                "extras": [{"title":"What Will Help You Succeed","content":["Deep content and cultural knowledge about EMEA media, including current trends in entertainment. Simply put, you’re a superfan who keeps up with film and TV from the region — and help Netflix members around the globe get excited about it, too","Experience with managing creative work at scale and working with outsourcing models","Experience managing creative teams. Our source copy is written in English, so you must have the professional authority to enforce standards among a team of high-performing writers","A love of language. Even though you’re an expert with deep industry knowledge, you’ll always advocate for writing with an empathetic understanding of a broader audience in mind. You must be comfortable with enforcing rigorous editing, tight deadlines and workshopping copy with a team of writers and editors","An expert-level understanding of different tones and platforms for writing. Whether the assignment at hand is a trailer script for highbrow film, a synopsis for blockbuster rom-com or an animated educational series for kids, you understand that different types of content should have copy tailored to their respective tones, and you know how to assign the right writers to the task","A commitment to our team’s core values, like candid feedback, passion and curiosity","Innovative thinking. We’re looking for someone who’s constantly looking for ways to improve the member experience through experimentation and testing"]},{"title":"Key Responsibilities:","content":["Manage an editorial schedule to ensure on-time delivery for written assets","Leverage the scale efficiencies of the externalization program to forecast and direct assignment allocation, partnering closely with regional leads to prioritize schedules","Partner with engineering teams to establish, refine and adopt a scalable, automated assignment logic based on strong editorial judgment and suits the needs of members and our business.","Digest and distill feedback from internal auditors to pass on comprehensive and actionable feedback to external partners","Identify region-specific workflow issues and proactively address discrepancies","Implement learnings from innovation initiatives to coach and implement with internal and external partners"]},{"title":"Good-to-Haves","content":["Experience in EMEA media and native fluency in at least one European language are a high priority","People management experience","Experience working with global brands","Experience with AB testing"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/6fa0cbd4-ff14-4704-9ebb-54d200b76229"
            }