            {
                "id": 340,
                "companyId": 6,
                "title": "Manager, Marketing Planning - Korea",
                "location": ["Seoul, South Korea"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 7,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Marketing Planning","Campaign Management","Content Strategy","Title Campaigns","Strategic Insights","Stakeholder Management","Global Forums"],
                "skills": ["Content Strategy","Campaign Management","Global Marketing","Regional Partnerships","Cross-functional Collaboration","Strategic Insights","Multi-market Opportunities"],
                "overview": "The Manager, Marketing Planning - Korea position at Netflix is responsible for understanding content strategy and leading campaign management for titles that travel, collaborating with regional partners, analyzing title and campaign opportunities, and representing regional priorities in global forums.",
                "description": "Netflix is one of the world's leading entertainment services with 233 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 

We offer great TV series, documentaries and feature films across a wide variety of genres and languages that push the boundaries of storytelling and delight members of all ages and tastes around the world. As we grow our business and teams, we seek talent from a wide range of backgrounds that reflect the global nature of our members. It takes diversity of thought, culture, background, and perspective to create a truly global business. 
 
The Netflix culture is unique and attracts individuals who exhibit good judgment, innovation, selflessness, courage, impact, candid communication, passion, and intellectual curiosity. Read our culture memo to learn what it’s like working for Netflix. To excel in this environment, you must be independently minded, have impeccable creative taste, and a strong instinct for stories that will get consumers talking about Netflix and our shows more passionately and frequently than ever before.

It's an amazing time to be joining Netflix. The Asia region is a critical piece of our international business and an area of rapid growth. People are discovering Netflix every day across Asia, and we want our content to be relevant and irresistible. Finding the perfect strategic and creative mix of entertainment, brand messaging and product experience is key to unlocking waves of new consumers for us in Asia. We are also excited to see our content from Asia traveling more and more, and reaching and delighting audiences around the world.
 
At Netflix, Marketing’s core purpose is to maximize the impact of our content, product and brand so that everyone, everywhere wants to watch Netflix. The Marketing Planning team helps achieve that purpose as a global idea and strategic planning partner, connecting across markets and regions to maximize the impact of our title campaigns and initiatives for audiences around the world.

As an integral part of the APAC marketing team, this role will be responsible for understanding Content Strategy and leading Campaign Management for titles that travel.

Starting with analyzing and identifying which series and films will grow the business in the APAC region and beyond as multi-market opportunities, the job also involves supporting the strategy and creative campaign development of global and Korean titles, providing strategic insights on title and campaign opportunities, and collaborating with regional partners such as marketing, social, PR, partner marketing, consumer products, and content planning & analysis.  The ideal candidate should have a passion for Korean content and the opportunity for its reach to audiences around the world,  and be able to work with stakeholders in Korea and marketing teams outside of Korea.



",
                "extras": [{"title":"Key Responsibilities:","content":["Build and maintain strong working relationships with key Marketing stakeholders in markets across APAC, UCAN, EMEA, and LATAM, as well as with cross-functional Marcomms partners within Korea.","Be knowledgeable about both the Korean market and broader APAC markets and represent regional priorities and POV in global forums.","Work closely with Content and x-functional marketing partners to assess the slate with relevant data inputs and identify title and campaign opportunities that will have impact in APAC and other regional markets.","Contribute to the strategic development of Korean export campaigns, from upstream planning to rollout, ensuring that campaigns are best set up for success to drive impact outside of the home territory.","Serve as the point of contact for key Korean content priorities, socializing titles and initiatives with other markets, and identifying opportunities for the campaigns to travel and have business impact.","Drive early strategy and ideation partnership with both Creative/Title Marketing and upstream cross-functional teams.","On priority campaigns, partner with Marketing teams to define the campaign marketing strategies that resonate with global audiences outside of the home territory – eg. via culturally applicable positioning, early brief and roadmap development, campaign deployment timelines etc.","Ensure guidance and alignment on campaign strategy, creatively excellent ideas, global and regional tactics, and rollout both within and outside of APAC.","Provide global IQ insights and regional learnings back to Korean content and cross functional teams. (e.g cultural behavioral, trends, learnings, title assessments).","Lead select global and regional initiatives as APAC marketing representative, ie multi-title campaigns, tooling developments, and other business priorities.","Maintain knowledge of Korea and broader APAC markets and represent regional priorities and POV in global forums."]},{"title":"The Ideal Candidate Is/Has…","content":["Minimum 7 years of experience directly collaborating with Marketing teams, demonstrating a deep understanding of marketing strategy.","Someone who exemplifies the Netflix culture and values.","A natural problem-solver who can work through challenges and navigate comfortably in ambiguity.","An excellent communicator, a creative partner and strategic thinker who can contribute to early decision-making on campaigns in partnership with Content, MarComms, and other cross-functional and regional partners.","Selfless and collaborative, and naturally willing to go beyond roles and titles to get great work done.","A track record of successful cross-functional work and someone who can distill insights and information and lead deftly across the many aspects of campaign development.","A collaborative spirit who possesses a strong creative and strategic sensibility and who can expertly build trust and partnership, influence key stakeholders, and foster deep relationships across the business.","Ability to thrive in a fast-paced and collaborative environment and demonstrate strong judgment and a solution-driven mindset. Multi-tasker, but with clear time management and prioritization skills.","A deep curiosity about our global business and an ability to quickly build global IQ and an understanding of regional and cultural nuances that inform our strategies and campaign development.","Passionate about TV and film content, and Korean content in particular, with some knowledge of the entertainment landscape and industry trends and the desire to bring Korean content to audiences around the world.","Experienced in working in Asia and with other international markets.","Fluent in both Korean and English."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/91b67613-6b9a-4223-8065-8d277b4c17a3"
            }