            {
                "id": 338,
                "companyId": 6,
                "title": "Manager, Marketing - UK Series",
                "location": ["London, United Kingdom"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Marketing Campaigns","Integrated Marketing","Social Media Strategy","Marketing Shoots","Innovative Campaigns","Cross-functional Collaboration","Global Campaigns"],
                "skills": [""],
                "overview": "The Manager, Marketing - UK Series position at Netflix in London involves leading the development and launch of marketing campaigns for a diverse range of UK-produced scripted and unscripted series, and requires an experienced candidate with a proven track record of building world-class creative campaigns and a deep understanding of social media strategies.",
                "description": "The Opportunity

It’s an exciting time to join Netflix as we continue shaping the future of global entertainment. With over 220+ million streaming members in over 190 countries, our approach to Marketing is to defy convention, disrupt industry norms and break new ground through innovative, culturally relevant, breakthrough campaigns that pierce the zeitgeist and drive conversation.

We are looking to fill an integral role on the marketing team for a Manager of Marketing - UK Series, based in London. This is a great opportunity to join a team that leads the development and launch of marketing campaigns across a diverse range of Scripted and Unscripted Series produced in the UK, and loved by the world, such as Black Mirror, Top Boy, F1: Drive to Survive and Love is Blind: UK.

The Role

This role is unique. So is the right candidate. 

In this role, you will be a key contributor and leader in strategising, executing and managing integrated marketing campaigns for different series. You will be a member of a small and nimble group of professionals based in our London office. 
",
                "extras": [{"title":"We are looking for someone who:","content":["Has a proven track record of building world-class creative and launching global campaigns for premium entertainment properties, that connect consumers to entertainment brands and create a passionate following. We are not only building campaigns, we are transforming our properties into culturally relevant brands.","Has deep knowledge in running a 360-campaign, from strategy development and building briefs, to tactical execution (including AV/trailers, digital/social, print and out-of-home).","Has a deep understanding of the social media landscape, and experience in establishing strong and out of the box social media strategies. Campaigns that build, nurture and maintain fan communities and manifest themselves in a unique tone of voice and culturally relevant and conversation-driving creative.","Has experience with marketing shoots, from development of creative and campaign ideas, to planning and shoot execution (key art, A/V, and digital / social).","Has experience in evaluating and executing innovative campaign ideas within the media landscape (inclusive of but not limited to OOH, Digital OOH and experiential)","Is a cross-functional leader who is able to engage, listen and collaborate with internal departments/teams to align early on in terms of overall strategy and goals, and to see the cross-functional collaboration through launch.","Is able to effectively communicate different facets of their campaigns to executives, showrunners (or producers), talent and talent representatives (as needed).","Has exposure to working on global campaigns, with reach domestically and internationally. Ideally, this person would have a global IQ and/or be familiar with working with teams from different regional markets.","Has a good understanding of marketing, social and media analytics and how to apply data to test and optimise campaigns.","Has a native understanding of digital with an emphasis on mobile, social, video and display and an ability to tell stories through great ideas regardless of medium.","Appreciates technology and can collaborate with our world class product team to integrate our campaigns within the member product experience.","Is an effective collaborator in a fast paced, multifaceted environment. We will typically have multiple launch campaigns happening at once."]},{"title":"Core Responsibilities:","content":["Support, and sometimes lead, on launch campaigns for Series being produced from the UK -- from strategy development to creative execution, production to campaign roll out.","Act as the central cross-functional liaison amongst internal teams (across region-based Marketing teams, PR, Publicity, Product and Social), with a focus on managing workflow and being able to socialise, absorb, organise and address cross-functional feedback (where possible)","Act as the main point of contact with agencies - hire, manage and give feedback to create the best campaigns.","Have a holistic vision for leading campaigns, but also do the tactical day-to-day (brief writing, shoot planning, budgeting and managing overall campaign resources)"]},{"title":"The successful candidate possesses:","content":["A minimum of 5+ years of experience at an entertainment marketing or social department, network/studio marketing/social team, or creative agency working on creative campaigns (in strategy, Digital, Print and AV creative).","Experience managing a high volume of campaign types in parallel, while collaborating with diverse, geographically-dispersed teams.","Strong communication and analytical skills along with the ability to think strategically and creatively and a reasonable appreciation for the unknown.","Passion for television is a must."]},{"title":"Personality Attributes:","content":["See Who We Are and what our Culture is like.","You are a proactive self-starter, who does not need to be told what to do and will be resourceful in order to find solutions to any challenge. You are not afraid to get your hands dirty.","You are passionate and curious about all aspects of the business - especially when bridging the gap between our content and our brand - and have an entrepreneurial mindset.","You thrive in a fast-paced and demanding environment, possess a high level of intellectual curiosity, and demonstrate strong judgment in the face of ambiguity.","You are a natural team leader, with the ability to conceptualise and articulate creative strategy and production that all will rally around.","You are an agile, goal-oriented personality, driven to succeed and always up for a challenge!","You are able to make wise and informed decisions, even when faced with ambiguity and think strategically.","You are an avid user of both your left and right brain. If you live and breathe global entertainment and geek out at the thought of breaking the advertising mold, then we want to talk to you."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7bd76dd5-5f24-43da-950d-f0ceaf85e374"
            }