            {
                "id": 339,
                "companyId": 6,
                "title": "Manager, Marketing Partnerships - Korea",
                "location": ["Seoul, South Korea"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "The Marketing Partnership Manager will be responsible for developing and executing marketing campaigns whilst cultivating deep relationships with partners like consumer electronics, mobile & broadband operators, ISPs and other leading consumer brands in Korea.",
                "description": "Reporting to the Senior Director of Marketing Partnerships APAC, the Marketing Partnership Manager will be responsible for developing and executing marketing campaigns whilst cultivating deep relationships with partners like consumer electronics, mobile & broadband operators,ISPs and other leading consumer brands.

Our partners are an extension of Netflix’s own marketing efforts and therefore a strategic lever of growth for us. So it’s essential that our partner communication is clear, consistent and engaging. Additionally,  we’re always looking for cutting edge, creative ways to work with partners to make the Netflix service and our titles shine.

The successful candidate will be a seasoned professional with 10+ years of demonstrated experience in executing partner marketing initiatives. A passion for technology and content is a must in addition to a keen understanding of how partner products & technologies fit into member’s lives and how they are likely to evolve over time. Ultimately they must own the full life cycle of partner marketing projects from idea to execution to post-analysis.
",
                "extras": [{"title":"Essential duties and responsibilities:","content":["Own the marketing relationship with our partners in Korea.","Execute partner marketing programs that deliver on our broader business strategy.","Provide strategic support to internal product and business development teams to develop and execute Go-to-Market strategies across partner channels for maximizing Netflix exposure on new and existing partnerships.","Work closely with the cross functional teams; our content, marketing and communications teams to identify opportunities for partnerships and the right partners for executing those opportunities.","Develop and launch creative marketing partnership programs that advance exposure for Netflix content or the brand in a way that benefits Netflix and our partners.","Collaborate with partner marketing creative teams to elevate the campaign creatives and introduce our content to consumers in unique and unexpected ways.","Evaluate performance against marketing goals with partners through established review rhythm and define corrective actions to improve effectiveness and results."]},{"title":"Qualifications:","content":["Extensive knowledge and 10+ years of experience in Korea in connected industries like Consumer Electronics, Consumer Tech and Consumer Entertainment.","Strong experience in consumer marketing with natural partner management and influencing skills.","Proven record of strong negotiation skills with an ability to develop rapport and translate established partner relationships to programs that impact the business.","Ability to analyze and apply data to business strategy and goals.","Experience and passion for building great content partner marketing programs that are unique and scalable.","Experience working with Entertainment properties (movies, tv series, video games, music, etc) is essential.","Ability to manage multiple time-sensitive projects simultaneously without the support of a large team, working both independently and in close collaboration with a wide variety of stakeholders, mainly remotely.","Strong cross-team collaboration skills and ability to promote innovation through a creative collaboration process that transforms different input into one actionable output.","Knowledge or experience with telco/ISP industries or previous experience working with CE and/or retail partners is a plus.","A desire to thrive in our unique culture."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/f9ea6034-1dd9-49ed-b1f0-45169ea6d669"
            }