            {
                "id": 341,
                "companyId": 6,
                "title": "Manager, Marketing Production - India",
                "location": ["Mumbai, India"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 10,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Project Management","Budget Management","Agency Management","Timeline Management","Stakeholder Management","Asset Development","Media Fulfilment"],
                "skills": ["project management","production budgets","creative agency management","media agency management","asset development","asset localisation workflows","asset ingestion and management"],
                "overview": "The Manager, Marketing Production - India is responsible for end-to-end project management of campaigns, budgets, and cross-functional collaboration, ensuring timely delivery of assets within budget.",
                "description": "The Role

In this role, you will be a key cross-functional partner, responsible for managing the end-to-end project management of a campaign, production budgets for promotional assets, and partnering with creative, media, social, publicity, partnerships and other cross-functional teams. This means that you are a nimble, solutions-oriented, entrepreneurial, and a creative operations expert ensuring all assets are delivered on time, and on budget.

",
                "extras": [{"title":"Responsibilities","content":["Timeline management of the title campaign","Title-level budget tracking (allocation vs spends) + POs (creative, media, production)","Creative agency management (asset timelines, feedback, deliveries & costs)","Media agency management (plans timelines, feedback, deliveries & costs)","Deployment of a title campaign - ensuring all assets have gone live excluding talent deployment.","Task force management (scheduling, asset socialisation, important points for discussion, etc.)","Internal stakeholder management - ideas and asset socialisation, x-functional plans input, etc.","Talent/Partner management - availability, asset feedback, credit list, PSC attribution on assets, etc.","Approval of all assets adapted for media fulfilment - assets that have been adapted from approved masters.","Asset development, execution and media fulfilment (negotiations, scheduling, deliveries) as well as legal clearances"]},{"title":"Requirements","content":["Over 10 years marketing-led project management / operational experience, with an emphasis on integrated production including video / broadcast, print / OOH and digital/social asset production and delivery","Marketing- and/or Entertainment operations experience in an environment spanning myriad asset types and platforms, managing complex timelines, budgets and scope","Expert knowledge of marketing campaigns and asset localisation workflows.","Proficient technical knowledge in either Video or Digital formats while understanding the fundamentals of asset ingestion and management, servicing and trafficking","A passion for project management, budgeting & operations","A strong communicator with an excellent track record of managing teams across multiple levels regardless of hierarchy and seniority.","Strong Commercial and Operational acumen"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/04ae4499-81d0-4097-8e4c-368a833c2a1f"
            }