            {
                "id": 347,
                "companyId": 6,
                "title": "Manager, Social Marketing - CEE",
                "location": ["Warsaw, Poland"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Social Marketing","CEE","Content Creation","Strategic Planning","Audience Engagement","Community Building","Cross-functional Collaboration"],
                "skills": ["social media","content","entertainment","strategy","social platforms","social campaigns","audiences"],
                "overview": "",
                "description": "It’s an exciting time to join Netflix as we continue shaping the future of global entertainment. Netflix Social Marketing team brings the joy of watching Netflix into the social feed, entertaining fans anywhere they spend their time outside of the service, so they discover new titles to watch and talk about the Netflix brand, titles and talents. Day to day, that means we set the strategy and work with other teams to curate and create content for Netflix-branded social channels, and develop new audiences across Facebook, Twitter, Instagram, YouTube, podcasts and more.

The Role: 
We are looking to fill an integral role in the CEE Marketing team for a Social Marketing Manager. We’re looking for someone  who has strong knowledge and experience on social media and also possesses an authentic love for content and entertainment, creative and strategic contributor with a strong voice and impeccable taste. Social Manager  will be responsible for strategy, ideation, concept development and production across our social media channels and beyond across CEE markets, especially Czechia, Romania and Hungary. 

To be a successful Social Marketing Manager, you’ll need to be a storyteller at heart and have excellent judgment to balance audience interests with the needs of our business.  You’ll ensure we stay true to our brand values and our unique Tone of Voice.
You’ll have a deep passion, appreciation, and understanding of TV, Film and entertainment broadly, with a depth and breadth of knowledge about the entertainment and social media landscape in CEE as well as global trends and proven record of building engaged social communities.

You’ll be trusted to have your finger on the pulse of social content consumption and to find ways to innovate in this field. You understand what captures people’s attention and drives fandom and influence. 
",
                "extras": [{"title":"Key responsibilities:","content":["Manage our owned social platforms on a daily basis through keen communications with external partners (social agency and production companies). Oversee our content calendars, give creative notes and final approval, Act as the lead producer on external productions","Execute and contribute to the Social Marketing strategy for CEE markets (in particular Romania, Hungary, Czechia)","Ideate, plan and execute social campaigns and exclusive contents around our titles, talents and brand that can create social conversations and cultivate brand loyalty","Develop new content formats for owned channels that will create impact and buzz in social space, while connecting Netflix with audiences through the cultural zeitgeist.","Grow and scale our audiences, communities and fandom","Create content that gets written, shared, and talked about and builds credibility and relevance with local audiences","Experiment and innovate with content, take risks with what you’re creating; be ambitious and original.","Develop cross-functional relationships and partner with internal stakeholders: Film and Series Marketing Team, Content Team and Publicity Team."]},{"title":"We are looking for someone who:","content":["Has a minimum of 5+ years of experience in the social, digital marketing team in an agency, start-up and Consumer Goods Product brands preferably entertainment, sports and gaming industries.","Required to have deep understanding and experience of social channel management and community building. Need to have a deep and wide knowledge of each social media channel (eg; features, content formats, insights, data etc.)","Experience in working across the biggest social platforms such as TikTok, YouTube, Facebook, Twitter, Instagram, Snapchat and has keen interest in online trends and ability to detect and avoid risks in social media.","Has a proven track record of building high-quality social and A/V content and social formats/campaigns that connect consumers to entertainment brands and create a passionate following.","Navigates Pop Culture and has good intuition about what gets shared and talked about in our markets.","Is business-minded and a risk-taker entrepreneur with a high sense of responsibility.","Has the capacity to accomplish solid amounts in a fast-paced ever-changing environment.","Has experience using both data and intuition to create content that grabs attention and engages its audience. Solid understanding of marketing and social media analytics; you can apply a data-centric approach to the testing and optimization of content.","Is able to engage, listen and collaborate with internal departments/teams to align early on in terms of overall strategy and goals. A big idea isn’t a big idea if you’re doing it alone.","Has deep knowledge of the entertainment landscape, key opinion leaders and broader audiences.","Is a concise and clear communicator with written and oral communication skills in English and in at least one additional CEE Language (preferably Czech, Romanian)","Whether an introvert, extrovert or somewhere in between, you thrive in a fast-paced collaborative environment, possess an abundance of intellectual curiosity, focus on generating results, and exhibit the highest personal and professional standards of integrity and ethics."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/1bcbe471-0784-46a6-b90d-2a152a9a8435"
            }