            {
                "id": 357,
                "companyId": 6,
                "title": "Manager, Production Management, Live Action - Japan",
                "location": ["Tokyo, Japan"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 10,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Production Executive","Production Management","Co-production","Physical Production","Budget","Production Practices","Creative","Post Production","Japanese Live Action","Pre Production","Show Budgets","Scheduling","Production Staff","Vendors","Content Management","Japanese","HDR","4K Productions","High-quality Vendors","After-hours Support","Team Player","Confidentiality","Prioritization","Travel","Learning","Japanese Fluency","Communication Skills","Microsoft Word","Microsoft Excel","Google Docs","Google Sheets","Google Slides","Google Mail"],
                "skills": ["Production Management","Japanese live action production","Budgeting","Scheduling","Staffing/Vendors","Content Management","Microsoft Word"],
                "overview": "The Manager, Production Management, Live Action - Japan position involves managing internal and third party co-production Netflix Original titles from a physical production perspective in Japan, including establishing relationships, reviewing budgets, and supporting best production practices.",
                "description": "We are seeking an experienced Production Executive to join the Production Management team to manage both internal and third party co-production Netflix Original titles from a physical production perspective. 

Responsibilities include establishing and curating relations with producers and production companies, reviewing budgets, and supporting/suggesting best production practices. The position will work closely with our Creative, Post Production, and other internal teams along with producers to ensure efficient delivery.

The Role
A successful candidate will be self-motivated, proactive, quick-thinking, flexible, able to pivot when necessary, thorough, and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and unwavering attention to detail at all times. This is a demanding and fast-moving position that requires someone who is a proactive and positive thinker, able to exercise good judgment, initiative, and has an in-depth knowledge of Japanese live action and production process.

",
                "extras": [{"title":"Specific responsibilities include, but are not limited to:","content":["Pre Production/Setup of Show: Work with Finance, Legal, Creative, Post, VFX, Music and external production teams on establishing key production schedules and workflows and maximizing budget to spend as much on screen as possible","Budgeting: Work with Showrunners and Line Producers to prepare and vet show budgets and schedules, providing feedback internally and externally on viability and risks; Review creative/scripts and begin defining the budgets; Collaborate with internal teams and our production partners to lock the budget; Track and manage all costs, keeping stakeholders apprised of the status; Review cost reports and trackers on a bi-weekly basis; Help ensure that productions run smoothly, meet deadlines and stay within budget","Scheduling: Create/Help inform and draft production and post schedule; Collaborate with internal teams (including Post, VFX, Music) and external production team to lock schedule; Troubleshoot and communicate all changes to schedule to internal/external teams","Staffing/Vendors: Lead or assist with search and hire of key production staff; Determine key vendors to accommodate creative vision and relationships, tax incentives, budget needs, location issues; Help maintain/curate preferred vendor list","Content Management: Set up and attend key creative approval sessions; Set up and schedule legal clearance reviews with Legal Department"]},{"title":"Qualifications:","content":["10 Years + experience with Japanese live action production","Ability to handle a fast-paced environment simultaneously supervising several projects in various points of production (from development through delivery)","Familiar with the current trends and workflows for both HDR and 4K productions, within a Japanese live action production environment","Access to a long roster of high-quality vendors and talent throughout Japan","Ability to respond after-hours for important, timely or urgent matters","Team-player who operates in a fast-paced team-oriented setting","Ability to be discrete and maintain confidential information","Understanding of how to prioritize and respond accordingly","Willingness to travel, as external conditions permits","Willingness to continue learning to ensure understanding of current production process and gear","Must be fluent in Japanese. Fluency in English is a plus.","Strong written and verbal communication skills and the ability to multitask","Proficiency in Microsoft Word, Excel, Google Docs, Google Sheets, Google Slides and Google Mail"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/cc928829-b311-4ee5-a639-fc6bd042bf14"
            }