            {
                "id": 343,
                "companyId": 6,
                "title": "Manager, Media Strategy - Japan",
                "location": ["Tokyo, Japan"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 8,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Media Strategy","Paid social campaigns","Programmatic campaigns","Stakeholder consultation","Platform setup","Marketing goals","Paid social channels"],
                "skills": ["Paid social campaigns","Meta","TikTok","X (formerly Twitter)","YouTube","Ad management platforms","Paid social best practices"],
                "overview": "The Media Strategy Manager is responsible for developing best practices, connecting paid social channels to the overall marketing strategy in Japan, leveraging key media partners, and scaling campaigns for film, series, and brand initiatives, while also tailoring campaigns to the local market.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 

The Role
The Media Strategy Manager is responsible for working with our local marketing teams across Japan to develop best practices, connect paid social channels to our overall marketing strategy, explore and leverage key media partners, build learning agendas, and to scale campaigns and ideas. 

A successful Media Strategy Manager will be responsible for the strategy, planning and execution of paid social and programmatic campaigns for our film and series title launches, as well as brand initiatives. The role involves a high degree of stakeholder consultation and partnership, and requires an appetite to build scaled strategies while also balancing the need to tailor campaigns and learnings towards the local market priorities.

It is expected that a successful candidate will be developing detailed media plans and guiding our partner on operational specifics related to smooth campaign execution, so a knowledge of platform setup is required for the role. 

",
                "extras": [{"title":"Responsibilities:","content":["End to end strategy, planning, and managing activation partners for execution of paid social campaigns across multiple channels, including Meta, YouTube, TikTok and X (formerly Twitter).","Work hand in hand with the marketing team on title level paid social strategy and goals in order to make informed recommendations around targeting, platforms, creative formats and budget allocation","Partner with the marketing strategy team on campaign success evaluation as well as strategic principles and guidelines that are in line with our marketing goals","Serve as a platform expert across established and developing paid social channels with the ability to advise cross functional teams on audience demos, targeting capabilities and creative formats","Work with key stakeholders at digital platforms on ways to best leverage their products and opportunities for scalable digital innovation","Act as a resource to the country marketing teams to provide paid social creative best practices and recommendations with a focus on ways to execute breakthrough creative concepts","Provide feedback to partner teams on tooling needs for campaign planning & execution efficiency","Understand, advocate, and embody the company’s values and team goals"]},{"title":"Qualifications:","content":["8+ years managing and developing strategy for paid media campaigns in Japan","Experience with upper funnel campaign tactics and success evaluation","Proficiency in Meta, Tiktok, X (formerly Twitter) and YouTube’s ad management platforms","Well versed in paid social best practices, including channel specific creative formats and the latest strategies resonating with consumers.","Highly detail oriented with an ability to multitask and prioritize in a fast paced, high volume environment","Strong communication skills in both English and Japanese, and the ability to work cross functionally with multiple stakeholders","A startup/scale up mentality, experience building solutions from scratch and an excitement for the unknown/untested.","Familiarity with integrating organic and paid social elements into holistic strategies","Strong grasp of the overall marketing ecosystem and specifically the role that digital media and paid social plays within it","Up to date with new and emerging social platforms and innovative industry trends"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/4e89208a-9629-4cf5-baf9-0727ac6ada6b"
            }