            {
                "id": 327,
                "companyId": 6,
                "title": "Manager, Ads Product Marketing",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Ads Product Marketing","Product Development","Go-to-Market","Market Requirements","Product Narrative","Ad Product Solutions","Product Strategy"],
                "skills": ["product marketing","digital advertising","B2B advertising","product development","go-to-market","competitive landscape","market trends"],
                "overview": "The Manager, Ads Product Marketing at Netflix is responsible for defining and developing go-to-market strategies for new and existing ad product solutions, collaborating with cross-functional teams, and executing marketing needs to support ad products in the market. They should have 5-7+ years of experience in product marketing within the digital advertising and B2B Advertising space, excellent communication and storytelling skills, and the ability to collaborate effectively in a team-oriented environment.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.

At Netflix, the Ads Product Marketing Team specializes in bringing our Ad products to the B2B Advertising marketplace. Product Marketing has a key role  in both product development and go-to-market strategies. You will work collaboratively and cross-functionally with key stakeholders to articulate market requirements and frameworks for the Product team and define the product narrative. Our goal is to deliver products that meet (and exceed) the market’s needs and position them in a unique, compelling way that highlights the advantages that only Netflix can deliver. 

We are seeking a passionate, curious and collaborative Ads Product Marketing Manager to join our growing Ad Product Marketing team. You will have the opportunity to be a key player in building a “forever business” with Netflix Ads. 

Additionally, you will contribute to broader business tactics and pursue learning and development opportunities to consistently grow and evolve as a Netflix marketer and leader.
",
                "extras": [{"title":"Key Responsibilities:","content":["Lead the definition and development of go-to-market efforts across new ad product solutions & enhance existing offerings in close partnership with cross-functional stakeholders (ad product, research, sales, UX, measurement, policy, etc)","Be a trusted partner to both the product and sales teams, and assist in establishing a feedback loop that encompasses all necessary customer and market inputs to influence product development","Define the strategic requirements for Product to influence product development that are grounded in an understanding of the competitive landscape, market trends, agency/brand client needs, use cases, and research","Identify and execute marketing needs to support ad products in the market (e.g.materials, demos, assets, etc) that bring solutions to life in a succinct and exciting way","Work across teams to align on and roll out ad solutions in tentpole events (eg, CES,Upfront, Cannes)","Collaborate cross-functionally (Comms, Ad Product, Marketing) to ensure a consistent ads narrative","Collaborate with Research teams to include audience and industry insights that can inform the development of new ad solution offerings and their positioning in market"]},{"title":"What We’re Looking For:","content":["5-7+ years experience in product marketing within the digital advertising and / or B2B Advertising space","Strong experience in partnering cross-functionally on product strategy, product positioning/narrative and GTM launches","Excellent communication and storytelling skills, with comfort in understanding research data","Ability to collaborate in an environment that values team culture and inclusiveness","Excel at teamwork and have an ability to execute on near-term business priorities while simultaneously building a long-term strategy for ad product marketing","Have strategic vision that is coupled with strong project management, planning, and organizational skills, including the ability to handle multiple projects simultaneously and to deliver work under tight timelines","High-level understanding of product growth and developing strategic roadmaps","Demonstrated ability to create detailed and actionable Product Briefs","A strong attention to detail and eye towards using the 80/20 rule to address problems","Knowledge of the ad-supported streaming space and and ad tech ecosystem, nice to have, but not required"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/d36411a4-51ce-462b-a7b8-74369cc16983"
            }