            {
                "id": 328,
                "companyId": 6,
                "title": "Manager, Audience & Marketplace Insights (Measurement)",
                "location": ["New York, New York"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 7,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": ["proprietary and syndicated tools","research and analytics","dashboards and tools","measurement tools","methodology, data, and systems","advertising and media business","writing and presentation-building skills"],
                "overview": "The Manager of Ad Audience & Marketplace Insights at Netflix will be responsible for managing and growing the audience research team, conducting analyses for internal and external clients, supporting the Advertising Sales team with research and analytics, collaborating with Data Science teams to develop tools for audience and content insights, and overseeing third-party audience research companies. The ideal candidate should have at least 7 years of media research experience, a strong understanding of methodology and data from syndicated research providers, and excellent writing and presentation-building skills.",
                "description": "At Netflix, we want to entertain the world and are constantly innovating on how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 230 million paid subscribers. 

We recently launched a new ad-supported tier to offer our members with more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point, while also creating a compelling path for advertisers to reach audiences that are deeply immersed. 

Our Team

The core Advertising team is charged with building a new, best-in-class ads organization to establish Netflix as the premiere platform for advertiser partners and to drive advertising revenue. The ad measurement team is tasked with building best-in-class insights about our audience and marketplace measurement solutions for advertisers in support of our broader advertising sales efforts.

The Role

Netflix’s Ad Measurement team is seeking a Manager of Ad Audience & Marketplace Insights to manage, hire and grow the day-to-day work of the audience research team.  The successful candidate will work cross-functionally with sales, marketing, consumer insights, data science, and our vendor partners to identify and build solutions measuring Netflix’s audience consumption across the digital & TV ecosystem.  If you are someone who is a self-starter, obsesses over details, and thrives in a collaborative environment, Netflix may be the place for you. For an insider's look at Netflix’s culture, make sure to read Seeking Excellence, our company credo.
",
                "extras": [{"title":"Key Responsibilities:","content":["Leverage proprietary and syndicated tools to create and present analyses for internal and external clients that tell Netflix’s audience story to the marketplace and advertiser clients.","Support the Advertising Sales team with research and analytics, including but not limited to audience data, site metrics, normative data, and Netflix ad inventory.","Collaborate closely with Data Science teams to build the dashboards and tools that identify relevant audience and content insights for our partners. Craft these insights into compelling narratives.","Develop a comprehensive understanding of current and potential clients’ research and measurement goals. Work with product teams and 3rd party vendors to guide the development of measurement tools that will enable those analyses, including Audience Validation, Vertical Insights, and Reach/Frequency Analyses.","Research and analyze industries, companies, business models, and marketing strategies in key advertiser verticals such as CPG, Retail, Tech, and Telecom; Create market-facing insights that foretell emerging trends in these verticals.","Contribute to the development of the research components of presentations for our go-to-market marketplace positioning and any other ad hoc requests from the sales and marketing team.","Manage and develop a team who will execute timely requests for custom media targets and audiences based on media briefs and RFPs.","With the Sr. Manager, develop and oversee third-party audience research companies (such as NielsenOne, comScore VMX, etc.) to innovate new and more accurate ways to measure Netflix’s audience and digital measurement in general."]},{"title":"Experience & Skills:","content":["7+ years media research experience at Streaming, TV, or digital media company.","Strong understanding of methodology, data, and systems from syndicated research providers (e.g. comScore, Kantar, Nielsen), as well as direct digital technology and analytics.","Must have a comprehensive understanding of the advertising and media business.","A builder: able to thrive in a startup environment with ambiguity, and structure a global function and team for the future.","Ability to build a good rapport with both internal and external clients; Collaborates effectively and embraces differing perspectives and experiences to make better decisions.","Demonstrated ability to generate strategic insights from rigorous analysis.","Must have excellent writing and presentation-building skills.","Experience managing individual contributors."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/f25c9bcc-f872-42f9-9090-231f35bd5f60"
            }