            {
                "id": 333,
                "companyId": 6,
                "title": "Manager, Finance, Strategy and Analysis, EMEA Partnerships",
                "location": ["Paris, France"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Finance Analysis","EMEA Partnerships","Strategic Growth","Financial Projections","Risk Mitigation","Commercial Negotiations","Partnership Performance Analysis"],
                "skills": ["financial projections","scenario modeling","deal terms evaluation","risk identification","mitigation strategies","analyzing performance","actionable insights"],
                "overview": "The Manager, Finance, Strategy and Analysis, EMEA Partnerships role at Netflix involves analyzing partnership opportunities across the EMEA region and supporting strategic growth initiatives, including financial projections, deal evaluations, performance analysis, industry monitoring, and collaboration with cross-functional teams. Required qualifications include 5+ years of experience in management consulting or similar fields, quantitative background, strong interpersonal skills, fluency in French and English, and proficiency in Excel.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.

The opportunity 
Netflix has built a number of partnerships with companies, from mobile and fixed line network operators to CE device manufacturers and distributors, that help us deliver the Netflix experience around the world. These partnerships have been instrumental in accelerating Netflix’s global growth story and today they impact millions of members. In EMEA, we have partnered with leading Pay TV and telecommunication companies such as Sky in the UK, Telefonica in Spain, Orange in France, Deutsche Telekom in Germany and many others. 

As we continue to push for growth in Europe, the Middle East, and Africa (EMEA), we are looking for a Manager to join the Finance, Strategy and Analysis (FS&A), Partnerships team. This role is primarily focused on analyzing Partnership opportunities across EMEA,  as well as supporting regional strategic growth initiatives across all commercial aspects of the business. Netflix derives a significant competitive advantage from the highly analytical approach it takes to manage all aspects of the business, and our team plays a critical role in the assessment and ongoing strategy of partnerships in the region.

This role is based out of Paris and will report to the EMEA Lead of FS&A, Partnerships. The role will include occasional travel to partner locations in select regions as well as occasional travel to global HQ in California.

",
                "extras": [{"title":"Key responsibilities of the role include","content":["Evaluating the potential financial impact of future partnerships for Netflix: Financial projections and scenario modeling, Deal terms evaluation, Risk identification and mitigation strategies","Advise and guide the partnership teams on the commercial aspects of negotiations, based on the results of analyses","Analyzing the performance of existing partnerships to extract actionable insights (e.g. best practices, areas of improvement)","Develop industry and competitive expertise for focus markets in EMEA, monitor and evaluate trends.","Provide input to our revenue forecasting and budgeting teams on the expected impact of current and upcoming partnerships","Collaborate with multiple cross-functional teams working on partnership or growth initiatives (e.g. Crossfuncitonal S&A teams, Regional Product, Consumer Insights)","Collaborate with the broader Commerce teams in EMEA and globally","Create insightful strategic presentations that facilitate decision-making for internal senior stakeholders and external partners"]},{"title":"Qualifications","content":["5+ proven years of experience, ideally in management consulting or similar fields in which communication, stakeholder management, and strategic analysis is required","Bachelor’s or master’s degree with an emphasis on a quantitative subject. MBA considered a plus.","A proven track record of performing comprehensive quantitative and financial analyses independently and proactively that lead to actionable insights.","Team player with strong interpersonal skills, but also able to work independently with a minimum of supervision","Whether an introvert, extrovert or somewhere in between, you thrive in a fast-paced collaborative environment, possess an abundance of intellectual curiosity, focus on generating results, and exhibit the highest personal and professional standards of integrity and ethics.","Adept at managing multiple projects and stakeholders on a regular basis.","Skilled in preparing effective and well-structured presentations with clear narratives.","Fluent in both French and English","Strong quantitative skills, proficiency in Excel","Must thrive in a fast-paced environment, possess a high level of intellectual curiosity, focus on generating results and exhibit the highest standards of integrity and ethics.","Proficiency with SQL considered a plus"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/c614342d-47f6-46e1-9c8c-3dc07db82cfd"
            }