            {
                "id": 346,
                "companyId": 6,
                "title": "Manager, Series, France",
                "location": ["Paris, France"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": ["Executive Producer","Commissioner","French landscape","Directors","Heads of Department","Editors","on-screen talent"],
                "overview": "",
                "description": "Netflix is the world's leading streaming entertainment service with over 230 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films and mobile games across a wide variety of genres and languages. Members can watch, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.

Our ideal candidate loves storytelling and can shape, and deliver commercially successful shows with broad appeal, bring joy, and help grow our member base. They will have a strong sense of editorial judgment, a regional sensibility, and the ability to guide a production from pre-production, throughout the production process to post-production and launch. They will have a vast network of key players/stakeholders in the market/industry, including Directors, Head of Production, Editors and On-screen talent. 

They should be self-motivated, proactive individuals who think fast on their feet and are flexible and adaptable. This demanding and fast-moving role will require a proactive and positive thinker with sound judgment and initiative. They should be able to juggle multiple and diverse responsibilities across projects at varying stages of development. They should be judicious, keen on creative detail, and have excellent problem-solving skills. They should be solution-oriented, pragmatic, open-minded self-starters who can manage a high-volume production slate and diverse creative/production partners. Above all, the candidate should be self-aware, confident, trustworthy, conscientious, motivated and discerning. 

",
                "extras": [{"title":"Key Responsibilities:","content":["The Manager, Series, France, is a key team member who will play a critical role in developing creatively excellent series helping to build a steady programming pipeline in line with the needs of the series slate, and working with other cross-functional colleagues on greenlit projects. The role involves:","Actively searching for new ideas, including but not limited to building relationships with new writers, and exploring IP opportunities, both internal (existing Netflix shows from other regions ripe for adaptation) and external books, games or podcasts that we can adapt into a series.","From development to launch, act as the creative lead to deliver creatively excellent shows that bring joy to our members.","Working collaboratively with Netflix teams, including Production Management, Post Management, Product, Marketing and PR.","Be an effective collaborator to our producing partners, throughout the production and post-production process."]},{"title":"What success looks like:","content":["A healthy development pipeline - in line with the slate leaders' expectations.","Creative excellence in material - as evidenced by sticky shows.","Filmmaker joy - a well-executed onboarding and hand-off process for partners during the transition from Development through to Production and Post.","Improvement in knowledge sharing - Better information sharing regarding creative wins and learnings within the French series team, and also to/from other Content teams."]},{"title":"Experience:","content":["Demonstrable experience as a functional expert working in the media industry on scripted content as an Executive Producer or Commissioner.","A track record of leading and delivering multiple creatively excellent shows with outstanding production values.","In-depth knowledge of the French landscape, including a strong network with the creative community, Directors, Heads of Department, Editors, and on-screen talent.","Ability to handle a fast-paced environment, simultaneously assisting and/or supervising several projects in various phases of development and production (from evaluation to production through delivery)","High tolerance for change and the capacity to accomplish enormous amounts of work in a fast-paced, ever-changing environment.","Strong written and verbal communication in both English and French.","Willingness to be innovative, bold, take educated risks and think out of the box","Enthusiastic about Netflix culture: our culture is unique, and we live by our values: https://jobs.netflix.com/culture"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/b08b7b8b-7252-4482-87d4-3cb9878ce279"
            }