            {
                "id": 344,
                "companyId": 6,
                "title": "Manager, Post Production, Live Action - Japan",
                "location": ["Tokyo, Japan"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 10,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Post Production Manager","Japanese original and licensed contents","Vendors and editorial crew relations","Budget management","Technical and workflow issues","Japanese-Language Live Action content","Post technical workflows"],
                "skills": ["HDR color pipeline","editorial setup","sound design","collaboration with both Music & VFX teams","IMFmaster delivery","final archive"],
                "overview": "",
                "description": "We are seeking an experienced Post Production Manager based in Japan to help manage our Japanese original and licensed contents.  This person will actively reach out to both external partners and internal cross functional teams to manage the titles to get them launched as planned while maintaining vendors and editorial crew relations, creating budgets, managing schedules, and troubleshooting technical and workflow issues.  
 
The Role
The successful candidate will be self-motivated, proactive, quick-thinking, flexible and able to pivot when necessary.  S/He will be thorough and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and an unwavering attention to detail at all times.
 
This is a demanding and fast moving position that requires someone who is a positive thinker and able to exercise good judgment. The role will focus on supporting Japanese-Language Live Action content that is created and finished in Japan.  

The specific responsibilities are included, but not limited to what is listed below.
",
                "extras": [{"title":"Technical Setup of Show:","content":["Work with Studio Technologies, Post & external production team on defining post technical workflows such as HDR color pipeline, editorial setup, sound design, collaboration with both Music & VFX teams, IMFmaster delivery, and final archive."]},{"title":"Budgeting:","content":["Work to prepare and vet show budgets and schedules, providing feedback internally and externally on viability and risks","Review creative/scripts & begin defining post budget","Collaborate with internal/external teams to lock budget","Track & manage all post related costs, keeping stakeholders apprised of status"]},{"title":"Post Scheduling:","content":["Create/Help inform and draft post schedule","Collaborate with internal teams & external production teams to lock in the schedule and target launch date of the title.","Troubleshoot and communicate all changes to schedule to internal/external teams"]},{"title":"Staffing/Vendors:","content":["Lead or assist with search and hire of key show post staff","Determine key post vendors to accommodate creative vision, relationships, budget needs, location issues","Help maintain/curate preferred vendor list"]},{"title":"Strategy:","content":["Consistently think of the mid / long term strategy to improve the execution of the entire post production work for Netflix."]},{"title":"Qualifications:","content":["Native fluency in Japanese is required and business level of English is preferred","10 Years + as an experienced Post Production Producer, Supervisor or Manager","Ability to handle a fast paced environment supervising several projects in various points of production (from development through delivery)","Familiar with the current trends and post production workflows","Ability to respond after hours for important, timely or urgent matters","Team-player who operates in a fast paced team-oriented setting","Ability to be discrete and maintain confidential information","Willingness to continue learning and drive innovation","Strong written and verbal communication skills and the ability to multitask"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/5279e552-2aeb-4ca4-9c0c-46af84ba76f3"
            }