            {
                "id": 342,
                "companyId": 6,
                "title": "Manager, Marketing Services - APAC",
                "location": ["Mumbai, India"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Marketing Services","Netflix","entertainment services","TV series","films","games","genres","languages","Marketing","Publicity","Social","execute visions","amplify conversations","main point of contact","external licensed partners","secure approvals","off-service marketing campaigns","pre-approved promotional assets","provide guidelines","building relationships","external agencies","content partners","shifting priorities","multitasking","follow-through","10 years of experience","digital assets","partner relationships","studio or entertainment related environment","manage and prioritize tasks","high volume environment","marketing teams","creative agencies","studio/network campaigns","entertainment branding","cross-functional workflow","operational efficiencies","Google Suite proficiency","film & television passion","country leads","Marketing, Social, Publicity, Product","cross-functional liaison","social & PR agencies","licensed partners","negotiate","escalate issues","reporting tools","analyze content","digital assets tracking","creative asset rights","company values","team goals"],
                "skills": [""],
                "overview": "The Marketing Services Manager will be responsible for managing relationships with cross-functional teams, external partners, and agencies to execute marketing campaigns and secure approvals for off-service marketing campaigns.",
                "description": "Netflix is one of the world's leading entertainment services with members enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 

The Opportunity
Marketing Services supports Netflix’s marketing mission by working closely with multiple teams, such as Marketing, Publicity and Social, to help execute their visions and amplify the conversations around the world. Our team serves as the main point of contact between Netflix teams and external licensed partners (i.e. Dharma Productions, Red Chillies Entertainment, etc) to secure approvals for off-service marketing campaigns, share pre-approved promotional assets, and provide guidelines when teams are creating assets.

The ideal Marketing Services Manager candidate is a self-motivated worker who thrives in an environment that relies on self-discipline and the ability to set and meet simultaneous daily and long-term deadlines. You are extremely detail-oriented and a strong communicator who responds well in a fast-paced environment. You have experience in building relationships with external agencies and content partners. With shifting priorities and multiple deadlines, this position requires a high level of multi-tasking and follow-through. 

",
                "extras": [{"title":"Candidate Profile","content":["Minimum 10 years of experience dealing with digital assets and partner relationships in a studio or entertainment related environment","Ability to build relationships with external partners and able to come up with solutions when issue rises","Ability to manage and prioritize multiple time-sensitive tasks simultaneously and independently in a fast paced, high volume environment","Healthy interactions with marketing teams, creative agencies as well as familiarity with studio/network campaigns or entertainment branding","Assess cross-functional workflow and problem solve for operational efficiencies","Advanced proficiency with Google Suite","Passion for film & television is a must"]},{"title":"Responsibilities","content":["Manage relationships with all the different cross-functional country leads (region-based Marketing, Social, Publicity, and Product), and act as a central cross-functional liaison with a focus on managing workflow and being able to socialize, absorb, organize and address cross-functional feedback (where possible)","Act as the point of contact with external social & PR agencies","Independently build trust and manage relationships with external licensed partners and studios, and depending on the case, negotiate with them for the best interests of Netflix","Independently execute and use discretion to escalate issues in a timely and appropriate manner","Consistently seeking to simplify complex issues, identify future opportunities and challenges, and proactively brainstorm solutions with other cross-functional leaders","Access reporting tools to analyze / confirm top performing & upcoming content","Source/review/prioritize/track digital assets, and handle creative asset rights and approvals for both India and APAC countries outside of India","Understand, advocate, and embody the company’s values and team goals"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/29bf9cf8-8b47-472f-82b3-2638a799bcaf"
            }