            {
                "id": 336,
                "companyId": 6,
                "title": "Manager, FS&A, Games",
                "location": ["Los Angeles, California"],
                "type": [],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 165000,
                "salaryMax": 470000,
                "salaryFormat": "bi-week-salary",
                "salaryCurrency": "USD",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "The Manager, FS&A, Games position at Netflix is responsible for developing strategic insights to advance the company's gaming initiative, conducting market research and competitive analysis, preparing valuation analyses, and collaborating with cross-functional teams to track metrics and make informed decisions in the gaming vertical.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.

Netflix connects people all over the globe with movies, television, and now video games by pairing outstanding content with technological innovation. This is your chance to be at the forefront of our new Gaming offering. 
 
Members have always been able to watch as much as they want, anytime, anywhere, and now they can also download and play mobile games anytime, anywhere with a collection of Netflix curated and produced games. At Netflix, we have a perpetual need to improve our product experience and the creative elements that support it; this role sits at the center of these efforts.

The Gaming Finance, Strategy & Analysis (FS&A) team develops strategic insights to advance the company’s gaming initiative and is primarily responsible for programming strategy, performance/audience insights, competitive analyses, and metric development. Executives and senior management depend heavily on our team to accurately assess, contextualize, and forecast the business and lead the strategic analysis that is used to inform critical business decisions.

In this role, you will need to be a self-starter, an analytical thought partner with a keen eye for detail, and have proven skills and experiences as a cross-functional partner. You must thrive in a fast-paced environment, possess a high level of intellectual curiosity, and embrace ambiguity. You must be an expert communicator who is able to convey complex ideas using both qualitative and quantitative means to effectively work with a broad spectrum of stakeholders.


",
                "extras": [{"title":"Responsibilities","content":["Preparing valuation analyses (model building, scenario testing) to support deal-making decisions and negotiations.","Developing insightful presentations that summarize key data, identify underlying trends, and ultimately result in actionable strategic recommendations.","Conducting market research and competitive trends analyses and summarizing them for a senior executive-level audience.","Working cross-functionally with our Data Science, Consumer Insights, and other data-driven partner teams to develop new metrics and track them through dashboarding and reporting.","Collaborating directly with top leaders in the Gaming organization: expertly delivering on their requests, translating their high-level thoughts into actionable strategies with measurable goals, and assisting in socializing these strategies and coordinating execution across a diverse set of stakeholders.","Developing, evangelizing, and implementing strategic frameworks to help our executives and stakeholders make informed decisions and evaluate critical trade-offs for this nascent vertical.","Netflix Gaming is fast-growing with a flat organizational structure, which means that employees are often asked to perform tasks with a range of difficulties. You must be motivated, disciplined, and able to work effectively autonomously."]},{"title":"Qualifications","content":["10+ years of work experience in a highly analytical role, ideally in investment banking, management consulting, or in a strategy & operations-focused role at a top-tier gaming or technology company.","Relevant experience in gaming, particularly in mobile, is strongly preferred","Strong passion for Netflix IP and the entertainment industry at large.","Experience conducting quantitative analyses (including modeling) and qualitative analyses that can drive insights and results.","Excellent communication/presentation skills with a track record of presenting complex analyses to senior management clearly and concisely.","Excellent writing skills, and the ability to communicate complex data & analysis concisely.","Strong initiative and ability to work independently; must thrive in a fast-paced, always-changing environment.","Highly intellectually curious, has the courage to challenge the status quo, and exhibits the highest personal and professional standards of integrity and ethics.","Bachelor's degree with an emphasis on coursework of a quantitative nature, preferably Business, Economics, or Statistics","MBA is a strong plus","Passion for gaming is critical","Excellent proficiency with MS Excel / PowerPoint (and ideally their Google Suite counterparts)","Nice to have: Experience with Tableau, SQL, Data.ai, Sensor Tower"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/b1e31903-5b5f-418e-b016-ec7fc6e539d6"
            }