            {
                "id": 329,
                "companyId": 6,
                "title": "Manager, Audience & Marketplace Insights (Thought Leadership)",
                "location": ["New York, New York"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Manager","Audience & Marketplace Insights","Thought Leadership","Ad Measurement","Audience Research","Data Science","Consumer Insights"],
                "skills": ["media research","streaming","TV","digital media","methodology","data","systems"],
                "overview": "The Manager of Ad Audience & Marketplace Insights at Netflix is responsible for managing the audience research team, collaborating with various departments to measure audience consumption, and creating insights for internal and external clients.",
                "description": "At Netflix, we want to entertain the world and are constantly innovating on how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 230 million paid subscribers. 

We recently launched a new ad-supported tier to offer our members with more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point, while also creating a compelling path for advertisers to reach audiences that are deeply immersed. 

Our Team

The core Advertising team is charged with building a new, best-in-class ads organization to establish Netflix as the premiere platform for advertiser partners and to drive advertising revenue. The ad measurement team is tasked with building best-in-class insights about our audience and marketplace measurement solutions for advertisers in support of our broader advertising sales efforts.

The Role

Netflix’s Ad Measurement team is seeking a Manager of Ad Audience & Marketplace Insights to manage, hire and grow the day-to-day work of the audience research team.  The successful candidate will work cross-functionally with sales, marketing, consumer insights, data science, and our vendor partners to identify and build solutions measuring Netflix’s audience consumption across the digital & TV ecosystem.  If you are someone who is a self-starter, obsesses over details, and thrives in a collaborative environment, Netflix may be the place for you. For an insider's look at Netflix’s culture, make sure to read Seeking Excellence, our company credo.
",
                "extras": [{"title":"Key Responsibilities:","content":["Leverage proprietary and syndicated tools to create and present analyses for internal and external clients that tell Netflix’s audience story to the marketplace and advertiser clients.","Support the Advertising Sales team with research and analytics, including but not limited to audience data, site metrics, normative data, and Netflix ad inventory.","Collaborate closely with Consumer Insights teams and vendors to research evolving trends in consumer behavior. Translate this research into narratives that demonstrate Netflix’s ability to help brands reach consumers.","Mine available information about trends in the advertising and media industries, including high-profile industry reports; collect and retain information that is meaningful to Netflix’s business and summarize relevant data into briefs and externally facing presentations.","Research and analyze industries, companies, business models, and marketing strategies in key advertiser verticals such as CPG, Retail, Tech, and Telecom; Create market-facing insights that foretell emerging trends in these verticals.","Contribute to the development of the research components of presentations for our go-to-market marketplace positioning, positioning vs. competitors, and any other ad hoc requests from the sales and marketing team.","Manage and develop a team who will execute timely requests for custom media targets and audiences based on media briefs and RFPs.","With the Sr. Manager, work closely with Ads Marketing and sales leaders to develop a roadmap for narratives that demonstrate the value of the Netflix audience."]},{"title":"Skills & Experience:","content":["7+ years media research experience at Streaming, TV, or digital media company.","Strong understanding of methodology, data, and systems from syndicated research providers (e.g. comScore, Kantar, Nielsen), as well as direct digital technology and analytics.","Must have a comprehensive understanding of the advertising and media business.","A builder: able to thrive in a startup environment with ambiguity, and structure a global function and team for the future.","Ability to build a good rapport with both internal and external clients; Collaborates effectively and embraces differing perspectives and experiences to make better decisions.","Demonstrated ability to generate strategic insights from rigorous analysis.","Must have excellent writing and presentation-building skills.","Experience managing individual contributors."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/0ade5053-3b6e-4a89-a02a-1251a3b86a2d"
            }