            {
                "id": 352,
                "companyId": 6,
                "title": "Marketing Production Manager - CEE",
                "location": ["Warsaw, Poland"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 7,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Marketing Production","Project Manager","Campaign production","Creative production","Market-specific campaigns","End-to-end production management","Global creative materials"],
                "skills": ["Production management","Creative production","Campaign production","End-to-end production","Technical quality standards","Creative integrity","Creative direction"],
                "overview": "The Marketing Production Manager - CEE role is responsible for leading creative production, managing agency relationships, and ensuring timely delivery of marketing assets for CEE markets, with a focus on the Czech Republic and Romania.",
                "description": "It's an amazing time to join Netflix as we continue shaping the future of global entertainment. We are bringing new stories to millions of people worldwide by promoting our original, exclusive content. The Marketing Production Manager role is a strategic thought partner and a key project manager, providing creative production solutions and operational excellence in campaign production. As we are aiming for Creative Excellence and innovation, the Marketing Production function is critical in achieving Production Excellence for our campaigns. 

The Role
We are looking for a Marketing Producer to lead creative innovation, production, and execution of best-in-class entertainment campaigns for CEE markets. In this role, you will be responsible for managing the end-to-end production process of our market-specific campaign initiatives across paid, earned, and owned channels. This means that you thrive in an environment that requires you to bridge creative and technical needs. We are looking for someone with hands-on knowledge & extensive experience from Romania or the Czech Republic Market.  The role is based in Warsaw.  
",
                "extras": [{"title":"Responsibilities include:","content":["Effectively managing multiple title launches across CEE markets (with a special focus on the Czech Republic & Romania) to ensure timely and accurate development, production, and delivery of creative assets and consumer experiences in the region.","End-to-end production management for key regional shoots (esp. AV), chosen activations, and asset creation for bespoke title campaigns.","Driving local implementation of global creative materials to deploy marketing experiences and extensions when high regional relevance is key.","Managing agency and vendor relationships in the region by leading day-to-day communications, defining and tracking scope of work, creative & production budgets, and timelines.","Define, negotiate, communicate, implement, and monitor technical quality standards and creative integrity on all project deliverables according to Netflix creative guidelines.","Driving and enabling innovation and creative excellence across channels like Social, Digital, OOH, and Experiential."]},{"title":"Personality Attributes & Requirements:","content":["Strong familiarity with the Romania or Czech Republic market, media, vendor, and preferably entertainment landscape.","Fluency in English and Romanian/Czech is required. Familiarity with any other CEE country (Poland, Hungary, Ukraine) is a plus.","Passion for storytelling, and solid project management skills. 7+ years crafting world-class creative direction and execution.","Profound knowledge and experience with on-set creative production, organizing events, brand activations, OOH, RTV production (360-degree campaigns).","Solid experience in working with creative agencies and production houses, and the ability to provide concise, clear, and actionable creative feedback/ direction.","Proactive, fast, and flexible problem-solver with superb time, resource, and stakeholder management.","Ability to manage a high volume of creatives and campaign types in parallel, with diverse geographically dispersed teams to lead the exchange of information and asset delivery effectively.","Ability to thrive in a fast-paced and demanding environment, possessing a high level of intellectual curiosity, and demonstrate strong and effective judgment in the face of ambiguity.","Comfortably keeping up to date with the zeitgeist in entertainment, culture, tech, and business innovations around the world."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/27a6b3f1-96e0-4e16-a7f2-0c7977db9a99"
            }