            {
                "id": 356,
                "companyId": 6,
                "title": "Partner Engagement Manager - Korea",
                "location": ["Seoul, South Korea"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 12,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Partner Engagement","Korea","Integration","Consumer Electronics","Operator Partners","Product Roadmaps","Strategic Relationships"],
                "skills": ["Integration","Netflix application","Consumer electronics devices","Smart TV","Operator set-top boxes","Operator bundle offers","Product roadmaps"],
                "overview": "The Partner Engagement Manager - Korea position at Netflix involves leading the integration of Netflix into Korean operator partners' consumer devices, set-top boxes, and payment systems, in order to create a compelling bundle of services that meet the needs of partners, Netflix, and the industry.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. Visit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team.

The Opportunity

The APAC Partner Engagement  team builds strategic, holistic, long-term partnerships with consumer electronics manufacturers, mobile, broadband, and TV operators to make it easy for Netflix members to access, enjoy and pay for Netflix across Asia.

The Partner Engagement Manager will be responsible for leading the integration of Netflix into our Korean operator partners' consumer devices, set-top boxes and payment systems, creating a compelling bundle of complimentary services. The Partner Engagement Manager must understand the needs of our  partners, Netflix, and the industry to build products that will spark joy with current and future Netflix members.

",
                "extras": [{"title":"Responsibilities","content":["Managing the integration of the Netflix application into consumer electronics devices (e.g. Smart TV) and operator set-top boxes.","Negotiating Netflix product experience within the consumer electronics and operator entertainment experience.","Enabling operator bundle offers that include the Netflix subscription and facilitate members to pay for Netflix through the operators' bill.","Defining joint product roadmaps.","Contributing to the regional partnership strategy and testing, learning, and evolving our future product offerings."]},{"title":"Qualifications","content":["12+ years of experience building strategic relationships at leading operators or global platforms.","Fluent in Korean and English.","Strong written and verbal communicator.","Led complex technical projects involving multiple parties.","Navigated complicated, high-stakes negotiations resulting in value creation.","Collaborated with cross-functional teams including product, engineering, business development, legal, marketing, customer service, and finance distributed worldwide.","Able to effectively influence at all levels (internally and externally).","Designed and optimized acquisition user journeys through consumer insights and AB testing.","Developed payment, acquisition, mobile, wallet, or direct carrier billing products.","Data-driven analysis and decision-making, informed by a passion for metrics.","Willingness to travel for partner and internal team meetings."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/8e78f6f9-4676-4975-b306-d2ca3be0fe69"
            }