            {
                "id": 358,
                "companyId": 6,
                "title": "Photo & AV Studio Manager - CEE",
                "location": ["Warsaw, Poland"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Photo & AV Studio Manager","Content Production","PR Campaigns","A/V Materials","Project Management","Visual Assets","Budget Management"],
                "skills": ["visual asset creation","publicity","publishing","communications","photography","video industry","digital file specs"],
                "overview": "The Photo & AV Studio Manager for the CEE region at Netflix is responsible for developing and executing strategies to capture and produce creative materials that enhance and support the publicity campaign for Netflix Original content, collaborating with regional teams and overseeing photography and video production for premieres, events, and photo shoots.",
                "description": "Netflix is one of the world’s leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans any time. 

The Team You’ll be Joining: Photo & AV Studio 

The Photo & AV Studio team has the enviable position of straddling two worlds in the entertainment industry: photo & AV asset creation & global communication strategy. We specialise in capturing and creating photo & video assets that shape, enhance and support our publicity campaigns for our Netflix Original content including series, films, and documentaries. 

Simply put, we produce the content that compels people to watch our shows through earned media!

The Role

What photos will ensure a magazine spread? What video will get audiences and publishers excited about a new show? How do we make a talking head interview visually pop? How can we be smart and tell different stories across different countries through visual assets. These are just some of the opportunities you’ll be delivering in this role.

We are seeking a strategic individual to support on PR campaigns, driven by A/V materials, for Netflix titles - photography, videos, the next big thing. Our content stands out and makes an impact on the industry and consumers alike, compelling them to watch Netflix content. 

The role requires a high level of creativity, an inquisitive, innovative and self motivated personality, and a succinct communicator with a strong project management background. Being a team player with a positive attitude and willingness to be flexible and get the job done is essential, as is the ability to strategically plan and execute multiple projects simultaneously.  

You’ll be working with TV/film productions, talent, filmmakers and publicity events as part of the Netflix PR team in the CEE region. Building relationships as well as working autonomously in a fast paced environment will be key to success.
 
We don’t focus on job titles at Netflix but hire outstanding high performers who act responsibly on the resources and freedom they are given to do their work. The ideal candidate will use sound judgement to make wise decisions, think strategically and drive their colleagues to do the same. Read our culture memo to learn more. 

This job is based in Warsaw and reports to the Head of Photo & AV Studio, EMEA.

",
                "extras": [{"title":"Responsibilities of the role include:","content":["Develop and execute strategy for the CEE region, per project/title, to capture, produce and utilise creative material to enhance and support the publicity campaign throughout its lifecycle","Support on a slate of projects that include several original series, films, documentaries, docu-series and comedy specials","Drive communication with your regional campaign publicist counterpart, marketing/social teams, showrunners/filmmakers and talent reps","Hire and oversee unit photographers and video crews, including script and schedule review and communication with production","Produce strong creative materials that shape and enhance the overall publicity campaign","Assist with the asset management and servicing of material","Oversee photography/video needs for premieres, events and photo shoots","Assist with budget management"]},{"title":"Skills and Requirements:","content":["5+ years experience working across visual asset creation, collaborating closely with publicity, publishing or communications within the CEE region","Understand the photography/video industry. Strong knowledge in digital file specs & size formats","Fluency in Polish and English","Strong eye for producing visual assets","Understand and interest in copyright laws, usage licenses and embargoes","Experience handling high volume of complex projects and tasks for multiple people and departments simultaneously and manage competing priorities","Possess solid organizational, effective time management and excellent verbal and written communication skills to communicate effectively with internal and external teams","Must be able to work independently, make sound decisions, think strategically, and maintain accuracy and attention to detail","Experience working in a global team is preferred, but not essential"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/9850f11c-fce2-408a-a4e2-12a6b7a3ba23"
            }