            {
                "id": 360,
                "companyId": 6,
                "title": "Post Production Coordinator - Indonesia",
                "location": ["Jakarta, Indonesia"],
                "type": [],
                "attendance": ["Onsite"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Post Production Coordinator","Indonesia","Netflix","Originals","Post Production team","Internal Tools","Challenge Anticipation"],
                "skills": ["Post Production Coordinator","Indonesia","Netflix","Originals Post Production","pre-production","archive","wrap","internal tools","Netflix teams","organization","attention to detail","post managers","schedules","budgets","quotes","workflows","Netflix tools","specifications","technologies","post schedules","stakeholders","post production calls","meetings","internal databases","trackers","vendor lists","dailies","sound","finishing","freelance post crew","audit completion","post production materials","prep","production","archive and wrap","3 years’ experience","freelance Post Production Supervisor","Coordinator","Post Producer","VFX Producer","post facility","Experience in VFX production","local or regional vendors","editorial","sound","color","VFX","independent or studio feature films","TV series","knowledge","operational proficiency","current trends","post-production workflows","finishing formats","UHD/4K","HDR","Adobe Premiere Pro","Davinci Resolve","organizational skills","efficient","detail-oriented","supervise several projects","fast-paced collaborative environment","constant changes","curiosity","willingness to continue learning","current post process","written communication skills","verbal communication skills","Native Bahasa Indonesia Speaker","proficient in English"],
                "overview": "The Post Production Coordinator in Indonesia will support the Originals Post Production team, ensuring the smooth organization of post information and workflows, collaborating with internal teams, and maintaining high standards and schedules.",
                "description": "Netflix is the world's leading internet entertainment service with over 230 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. With this international expansion and a move into Thai originals, it's a great time to join Netflix.

The Opportunity

We are seeking a Post Production Coordinator to support the series/film Originals Post Production team in Indonesia. This position would organize vital post information and workflows with an increasing, growing slate of Original Shows from pre-production through archive & wrap using internal tools, as well as working closely with internal Netflix teams to anticipate challenges, problem solve and communicate expectations and needs. Collaborative working with internal teams is a must to ensure our content is maintained at the highest standards and on schedule.
 
A successful candidate will be passionate, self-motivated, quick-thinking, flexible, able to pivot when necessary, thorough and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and an unwavering attention to detail at all times. This is a versatile and fast moving position that requires someone who is proactive and able to exercise good judgment and communication.   

",
                "extras": [{"title":"Specific responsibilities include, but are not limited to:","content":["Support the post managers reviewing schedules, budgets, quotes, and workflows","Keep up to date with Netflix tools, specifications, and technologies","Track and manage post schedules, keeping stakeholders apprised of status","Set up and attend post production calls and meetings as needed","Update and manage internal databases and trackers","Maintain and curate preferred vendor lists for dailies, sound and finishing","Research and maintain preferred freelance post crew","Set up and manage dailies and cut viewing access for shows","Audit completion/delivery of post production materials during prep, production, archive and wrap"]},{"title":"Qualification:","content":["More than 3 years’ experience as a freelance Post Production Supervisor or Coordinator, Post Producer or VFX Producer within a post facility (Experience in VFX production is a plus)","Has experience working with local or regional vendors (editorial, sound, color, VFX) on independent or studio feature films and TV series","Possess strong knowledge and operational proficiency of current trends and post-production workflows, tools and finishing formats for both UHD/4K and HDR, such as Adobe Premiere Pro and Davinci Resolve","Has strong organizational skills; is efficient and detail-oriented and can supervise several projects at various points of production (from development through delivery)","Must be comfortable working in a fast-paced collaborative environment and has the ability to navigate constant changes","Possess a high level of curiosity and willingness to continue learning to ensure understanding of current post process","Strong written and verbal communication skills","Native Bahasa Indonesia Speaker who is also highly proficient in English"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/07f3ee10-9cd3-4866-aec4-2d0fe9b9d365"
            }