            {
                "id": 361,
                "companyId": 6,
                "title": "Post Services Specialist",
                "location": ["Mumbai, India"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Post Services Specialist","operational management","post production","self starter","workflow","efficiency","APAC team","Mumbai","client service","Filmmakers","post-production","technology","remote support","content delivery","standard operating procedures","Audio and Video calibration","preventive maintenance","escalate issues","real-time troubleshooting","asset integrity","color science","color management","display calibration","content creation","post-production workflows","IP networking","Network storage","Workstation architectures","Windows","Mac","Linux","innovation","change management","creative software applications","Crestron","Q-Sys control systems","audio/video/data communications protocols","communication skills","timely response","project prioritization","team player","organizational skills","attention to detail","diversity and inclusion","English proficiency","culture and values"],
                "skills": [""],
                "overview": "The Post Services Specialist position at Netflix in Mumbai involves supporting post production services and spaces, facilitating creative and technical reviews, collaborating with filmmakers, and optimizing support, workflow, and efficiency across different models and regions.",
                "description": "Netflix is committed to producing exceptional content across the globe for our subscribers and with that commitment comes the need to support our productions, filmmakers and creative teams with unparalleled operational excellence.  The Post Services branch of the Studio Management and Services team is charged with the operational management of our post production services and spaces and looking for a Specialist to join our APAC team in Mumbai.

The ideal candidate is well versed in post production standards and best practices.  We are searching for a self starter, thinking strategically and tactically about our services and how we can optimize support, workflow and efficiency across our different models and regions.

The Role

You will be part of the APAC team based out of Mumbai, India that supports and facilitates Creative and Technical Reviews for our productions and creative teams, also supporting our media pipeline and solutions operational initiative specific to media ingest and dailies.  You will be comfortable working under pressure and have exceptional client service skills and a proven track record of working closely and collaboratively with Filmmakers.  You will collaborate with post-production, technology, and industry experts and are self-motivated and require little to no supervision.  You are committed to the team dynamic and value working in a diverse environment across many regions and time zones.  

You will work closely with the Media Pipeline operation team(s), Post Services Dailies team(s) and Production Creatives and partner with the overall APAC team to provide remote support for additional facilities in the region.  You will also liaise with the internal post-production groups and outside vendors to assist with content delivery, management as an operational lead.

",
                "extras": [{"title":"Responsibilities","content":["Facilitate and operate creative and technical (critical) reviews, including color grade and sound mix reviews.","Help promote and develop (via training) tools to automate workflow tasks within the studio.","Provide escalation support for the regional MPS team(s) and regional Dailies team(s)","Mentor and train Netflix cross-functional partners and potential contractors in best practices for our spaces/services.","Establish and maintain standard operating procedures within our Netflix-owned, operated and partner spaces for our services.","Maintain Audio and Video calibration standards in our edit and dailies rooms at our partner vendor, as well as internally within NF screening spaces.","Maintain preventive maintenance schedules.","Escalate issues to Management, Engineering Services, and Infrastructure teams when necessary.","Perform routine color and audio calibration and maintenance procedures, achieving the highest level of confidence in the space to ensure an accurate playback experience.","Triage on technology issues that arise in real-time and collaborate with cross-functional teams toward resolution.","Perform wiring, patching, and software configuration to tailor set up to accommodate the requirements of and the purposes of production review.","Validate asset integrity on incoming media and screening material.","Consultation and/or assistance with external reviews for our various teams."]},{"title":"Qualifications","content":["Color science/color management workflow expert","Display calibration (CalMan workflow, probe experience)","Knowledge and experience of content creation and post-production workflows encompassing Dailies, NLE, Dialogue Recording, Picture Finishing, and Audio Mastering.","Critical eyes and ears with the ability to assess the quality of a screening asset and environment, diagnose issues, and troubleshoot in real time","Understanding of IP networking, Network storage, and Workstation architectures.","Knowledge and experience on Windows, Mac, and Linux operating systems is a plus","Proven track record of innovation, initiative, creativity, and implementation","Proven abilities to embrace, drive and enable change management","Technical and working knowledge with the following creative software applications:","Experience with Crestron and Q-Sys control systems is a plus.","Familiarity with audio, video, and data communications protocols.","Strong communication skills with proven ability to socialize, explain and promote new and complex technology, tools, and workflows.","Ability to respond after hours for important, timely, and urgent matters.","Ability to prioritize and juggle multiple projects at once.","Team player who thrives in a fast-paced environment.","Should possess strong organizational skills and great attention to detail.","Values working in a diverse, inclusive and international environment and are excited by the opportunity to partner with people whose backgrounds, experiences and perspectives may differ from yours.","Fluent and/or business proficiency in English","Passionate about our culture and values in the workplace."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/bd14d15d-103b-4bf3-9079-7736d59d08ea"
            }