            {
                "id": 480,
                "companyId": 6,
                "title": "Product Manager, Algorithms: Content and Business Products",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": ["Machine Learning","Algorithms","AI","Natural Language Processing","Computer Vision","Product Management","Developer Products"],
                "overview": "The Product Manager, Algorithms: Content and Business Products at Netflix will upscale tools and products with algorithms and AI capabilities to support creators' vision and ensure the right investment in their content.",
                "description": "Netflix is one of the world's leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want anytime, anywhere and can change their plans at any time.

The Content and Business Products team builds a suite of tools and products to scale the operations behind taking a Netflix show from concept to streaming. This role will upscale these tools and products with algorithms and AI capabilities to support creators' vision and ensure the right investment in our content.

As a Product Manager on the Content and Business Algorithms team at Netflix, you get to apply Machine Learning at a high scale and high quality, in the service of creative excellence and user impact. 

This role can be remote-based in the US or has the option to be based in our Los Angeles or Los Gatos offices.
",
                "extras": [{"title":"In this role, you will:","content":["Incubate Machine Learning capabilities with a talented and motivated team of applied researchers and analysts","Integrate these capabilities into enterprise-grade tools in partnership with tooling and workflow Product Managers","Discover new needs that artists, creators, and linguists have that can be met with Machine Learning capabilities.","This role requires the use of Natural Language Processing and Computer Vision to deeply understand our content, from script to final asset."]},{"title":"Skills Needed:","content":["5+ years of Product Management experience required","Demonstrated experience in setting joint goals and roadmaps with UX or tooling/product teams.","Previous experience in Machine Learning, Algo and AI-focused product management roles is required","Ideal candidate has experience with and understanding of developer products","Ideal candidate has experience working with SaaS or AI enterprise services","Good understanding of the ML Lifecycle (Platform and/or Infrastructure needs, data labeling, etc.)","Excellent written communication skills and ability to present technical content to non-technical audiences.","Ability to partner with different functions to ensure that your solutions drive real business impact.","Strategic thinking and ability to incorporate larger business context into algorithm and product development.","Postgraduate education (MS or PhD) in an applied quantitative field is nice to have, such as: Machine Learning, Statistics, Operations research, Information theory, Control theory, Econometrics etc."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/db7e8229-3970-4094-b74e-64771f2868f4"
            }