            {
                "id": 375,
                "companyId": 6,
                "title": "Production Pipeline Technical Director",
                "location": ["Los Angeles, California"],
                "type": ["Contractor"],
                "attendance": ["Onsite"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Pipeline Tools","CG Animation","Troubleshooting","Front-line Support","Python Programming","Third Party Tools","Pre-production Workflows"],
                "skills": [""],
                "overview": "The Production Pipeline Technical Director at Netflix's Feature Animation is responsible for developing and implementing pipeline tools and workflows, troubleshooting CG animation pipeline issues, and providing front-line support to artists and production crew across multiple departments.",
                "description": "Feature Animation at Netflix is committed to creating content that makes a lasting impression on audiences and expands expectations of what is possible in storytelling. We are paving the way for the bold future of animation by building a community of amazing artists and talent. As a part of Netflix, Feature Animation values integrity, excellence, respect, inclusion, and collaboration. This is the new wave of animation — and you can help shape it! 

Job Summary:
The Production Pipeline TD is responsible for developing, designing, and implementing pipeline tools and workflows used throughout the creative process by artists and production management. This person will provide front-line pipeline support and must be able to quickly and effectively troubleshoot general CG animation pipeline issues while operating in a fast-paced production environment. This person will be supporting artists and production crew in the Editorial, Story, Art, and Previs departments within and across multiple productions.

A successful candidate is self-motivated, proactive, quick-thinking, flexible, thorough, and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and attention to detail. This is a position that requires someone who is a proactive and positive thinker and able to exercise good judgment and initiative. Equally important, their day-to-day approach should be guided by and in alignment with Netflix's culture. 

About Feature Animation at Netflix Technology:
The Feature Animation at Netflix Technology team is focused on developing cutting-edge tools and providing support to the growing slate of animated features.  We are active contributors to our strong culture of collaboration, opportunity, and partnership. We work directly with the artists and management staff to determine how best to apply technology solutions to all aspects of our Studio.  We provide critical support in working with our creative partners (vendors) and establishing standardized workflows for departments.  We work closely with the other Technology teams across Netflix and its subsidiaries to offer the best solutions to the Animation community.

",
                "extras": [{"title":"What You’ll Do:","content":["Work with the FAN Technology Leadership, Engineers, and fellow Pipeline TDs to design and implement pipeline tools and workflows that service multiple productions","Write solutions that adhere to studio development standards and best practices","Create integrations for third-party and proprietary tools and applications","Collaborate closely with engineering teams to stay aligned on global pipeline initiatives","Provide front line support for pipeline-related issues across all pre-production departments","Maintain and extend the suite of global pipeline tooling","Craft bespoke and tailored solutions to address unique show challenges","Write and maintain tool and workflow documentation and training","Assist in training and mentoring of new Pipeline Technical Directors","Collaborate with grace, humility, inclusion, and open-mindedness"]},{"title":"What You’ll Need:","content":["Minimum 3 years of CG animation or visual effects pipeline experience","Thorough understanding of current industry techniques and technologies","Strong Python programming abilities both in and out of DCCs and familiarity with software design patterns and principles","Familiarity with Third Party tools such as ShotGrid, Nuke, Houdini, Unreal, Mari, Blender, Storyboard Pro, Flix, Syncsketch","Experience supporting pre-production workflows, such as Editorial, Story, Art, Previz, and Virtual Production preferred","Proven ability to organize and present technical concepts to non-technical stakeholders","Highly organized, efficient, and detail-oriented","Self-motivated, proactive team member with the capacity to work and prioritize independently","Excellent communications skills and comfortable speaking to different groups","Passionate about our culture and values in the workplace","Excellent verbal, written, and e-social communication skills","A degree in Computer Science or a similar field is a plus"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/f0615765-1451-42ae-bf76-7d3dfc1de481"
            }