            {
                "id": 367,
                "companyId": 6,
                "title": "Product Designer, Partnerships",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Product Designer","Partnerships","UX Design","User Experience","User Research","Prototyping","User Acquisition"],
                "skills": ["UX skills","Interaction design","Content strategy","Research","Prototyping","Strategy","Design systems"],
                "overview": "The Product Designer, Partnerships position at Netflix involves working closely with a team of designers, product managers, engineers, and partnerships teams to create user experiences that drive customer acquisition and engagement through partner channels. This role pushes the boundaries of the Netflix partnerships product space and requires collaboration with cross-functional teams to drive innovation. It is a remote-friendly role with occasional travel required.",
                "description": "About Our Team
Netflix is one of the largest global subscription services and we’re expanding to new markets around the world. The Partnerships team’s mission is to grow our member base and make Netflix accessible by innovating user experiences and building strong relationships with our business partners. 

We’re a team of product designers with a broad set of UX skills ranging from interaction design, content strategy, research, prototyping, and strategy. We work in close collaboration with product, business, and engineering partners to build new experiences for people around the globe. We pride ourselves on a strong culture of creativity, accountability, and experimentation, and you’ll work on rich and complex problems like how we bundle Netflix with our partners, how to bring an innovative approach to technical partner challenges, and much more.

The Role
We are looking for a curious, driven and collaborative Product Designer to help explore and push the boundaries of the Netflix partnerships product space. This role will work closely with a stunning team of designers, product managers, engineers and partnerships teams to create user experiences that drive Netflix customer acquisition, engagement, and retention via partner channels where people purchase and engage with Netflix. We work on a variety of projects like sign up experiences across complex TV operator environments and exploring new partner business opportunities in markets with prepaid payments. This role will push the current product boundaries, and work closely with product and business teams to drive innovation momentum into the future.

This will be a remote-friendly role, with expectations of travel several times a year to a global Netflix offer for team onsites and meaningful moments of collaboration and bonding. We want you to be happy and have a work-life-balance that enables you to thrive!

",
                "extras": [{"title":"Why You’ll Love It Here","content":["We're big on individual responsibility and lean on process, so there's room for you to drive product design decisions.","You’ll work with stunning, supportive designers on problems that matter.","Leadership that guides with joy, mentorship, passion and optimism.","Top-of-market compensation and benefits, flexible time off, and work-life balance.","Remote flexibility to balance work-from-home and in-office work, so long as you’re able to be onsite for meaningful collaboration.","Freedom and flexibility to craft your own design workflow, while harnessing Netflix’s world-class design systems.","An inclusive and supportive environment to inspire your best work."]},{"title":"How You’ll Have Impact","content":["Collaborate with other designers, product managers, engineers and payment partners to design and build payment experiences.","Advocate for the user and craft UX solutions that meet critical business objectives and inspire the team to push the status quo.","Create simple, intuitive experiences in a space that has complex rules and workflows.","Work on a range of projects on different platforms (TV, mobile, web, and more).","Design with scalability in mind and actively contribute to our design system and UX guidelines.","Work closely with our partnerships and research teams to understand expectations, needs, and attitudes of our members around the world.","Influence future innovation spaces to drive product and business growth."]},{"title":"What We’re Looking For","content":["A passionate energy for great design, collaboration and amplifying our team culture.","5+ years as a Product Designer (or equivalent experience) and a versatile portfolio that showcases deep interaction and problem solving skills.","Ability to use systems thinking in technical spaces to break down complexity into solvable problems.","Able to go deep and think about the ins-and-outs and edge cases, and to go wide to connect the dots between Netflix and our partners.","Experience in business innovation contexts and leading design strategy and execution from 0 to 1 with minimal oversight and well-organized operational rigor.","The communication skills to articulate your concepts and drive alignment with your cross-functional stakeholders.","Experience using and contributing to design systems.","Ability to flex between different types of projects simultaneously.","An appreciation and understanding of A/B testing and comfort using data to inform design decisions.","An earnest, mature, and ego-free attitude that welcomes candid feedback.","A willingness to fail and learn."]},{"title":"Even Better:","content":["Design experience working on growth strategies and with global partners.","A global or multi-regional perspective.","A passion for entertainment, filmmaking, and storytelling.","","At Netflix, we carefully consider a wide range of compensation factors to determine your personal top of market. We rely on market indicators to determine compensation and consider your specific job, skills, and experience to get it right. These considerations can cause your compensation to vary and will also be dependent on your location. The overall market range for roles in this area of Netflix is typically $80,000-$550,000. This market range is based on total compensation (vs. only base salary), which is in line with our compensation philosophy. Netflix is a unique culture and environment. Learn more here."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/670c5178-59ce-41db-b6db-a8f23cd9db62"
            }