            {
                "id": 368,
                "companyId": 6,
                "title": "Product Manager - Netflix Technology Services",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "",
                "description": "At Netflix, we are shaping the future of global entertainment, bringing moments of joy to 200+ million customers.  As we grow around the world, we have an increasing need to develop internal applications that cater to the needs of our customers - Netflix employees and the corporate teams.  Our Workforce technology team is focused on building enterprise solutions to drive productivity, efficiency, and effectiveness for our customers.  We are obsessed with user experience and like to build simple and intuitive products that reduce complexity in people's lives.  We focus on building business automation and deep interactive workflows that replace complex manual processes but also look broadly across the employee experience and search for lasting solutions that create a large impact for our teams.

We are looking for a Product Manager to join the team and help build our next generation of enterprise applications. In this role, you will own and manage a portfolio of enterprise products, lead product strategy, and drive outcomes. You will need to be creative and solve business problems with technical and sociotechnical skills, have a keen eye for product design, and cross-functionally collaborate with designers, engineers, and stakeholders to build scalable and secure products.  

About You:
You are curious and creative and have experience creating enterprise or consumer products.  You have a keen eye for design, are highly adaptable, and when faced with challenges, you become more creative, not less.  You like solving problems and can drive clarity to build the optimal products.  You are biased to execution and can lead the team to bring projects from concept to completion, doing everything possible to ensure a successful launch.  You are data-driven with a knack for using data to identify business opportunities, have a can-do attitude, are confident, and are a skilled communicator who welcomes honest and candid feedback. 

",
                "extras": [{"title":"Responsibilities:","content":["Quickly develop a deep understanding of Enterprise products you will own and lead.","Create a product roadmap and work closely with stakeholders and engineering teams to deliver new products and feature enhancements.","Manage products from concept to launch, delivering features iteratively to solve the business challenges before you.","Have a deep understanding and empathy for customer needs, using user research and creative feedback mechanisms to validate product hypotheses and optimal product solutions.","Work closely with designers to create simple and intuitive product experiences.","Be data-driven and use data to decide the best opportunities that deliver the most business impact.","Collaborate with engineering throughout the development cycle to iterate on and deliver the highest quality product requirements."]},{"title":"Requirements:","content":["Bachelor's Degree.","4+ years of product management experience.","Experience leading consumer or enterprise products.","Experience developing product strategy, business cases, and project execution plans.","Lead product ideation, requirements, technical development, product testing, launch, end-user training and rollout.","Analytical approach to problem-solving.","Outstanding written and verbal communication skills.","Ability to balance short-term goals and long-term vision.","Ability to drive and influence business decisions based on data and metrics.","Tenacity and ample leadership experience enable you to lead, influence and organize complex, multi-quarter projects."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/b91af2e4-93a2-48f9-b8aa-cf59426bf245"
            }