            {
                "id": 366,
                "companyId": 6,
                "title": "Producer - Games Studio",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Game Production","Delivery Leadership","Production Systems","Prototype","Production","Live Operations","Project Management","Risk Mitigation","Workflow Management","Team Support","Video Game Development","Cross-functional Teams","Strategic Thinking","Jira","Communication","Complex Project Tracking","Problem-solving","Positive Attitude","Budget Management","Team Leadership","Google Suite","Confluence","Trello","Miro","Outsourcing Management","Game Industry Knowledge","Art Outsourcing","Remote Team Management","Gaming","Netflix Content","Curiosity","Self-learning","Critique and Feedback","Flexible Work Location"],
                "skills": [""],
                "overview": "",
                "description": "Netflix is building a new internal game studio to incubate and build a new class of amazing games for players.

This Producer will work directly with the game team &  leadership to guide the development of games.  They will be accountable to the team to provide clarity on their next goals and visibility on their progress via a combination of work systems and team facilitation while working with partners and studio leadership to provide visibility on progress and risks.

Our new stunning colleague should have substantial experience in game production (specifically delivery leadership and helping to build production systems across at least one shipped product), be flexible in approach, and have experience working with teams in all stages of development, from Prototype to Production to Live Operations.

You’ll be joining a small, scrappy team with big ambitions, and an obsession to create memorable game moments that leave players telling their own stories for years to come. We’re looking for new teammates who care deeply about the experiences they create and the people they make them with. Those who bias towards action and are energized by the learning that comes with bold experimentation at an agile pace. As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. 

Now is an amazing time to join Netflix Game Studio as we seek to entertain our 200 million paid members in a really new way. 

About the Job

The production team works closely with the team leadership to help translate the creative goals into achievable steps while seeking to anticipate and avoid pitfalls in the path toward our creative vision and technical processes.  Acting as the ‘nervous system’ for the team, we build plans and seek alignment on strategy across all disciplines while keeping a healthy balance of scope and creative ambition. As a Producer in Netflix Game Studio, you’ll help the team stay on task, surface risk, and work on support tasks to enable the team to focus on making games while leaning in where necessary to help the team focus on their primary objective of delivering player value while seeing around corners and removing obstacles before they become impediments.
",
                "extras": [{"title":"Responsibilities","content":["Production: Keep teams on task and give clarity to objectives, highlight risks, and help make sure everyone knows ‘what’s next’ to help keep people’s eyes on the prize. Create/maintain well-defined schedules, goals, and milestones. Build and execute project management systems, including reporting and managing meetings where needed.","Anticipate and mitigate blockers, before they become real issues for the team. Lean in and remove obstacles in workflow, resourcing or capacity. Communicate project status and risk providing transparency to stakeholders.","Support teams to help them do their best work. Things like facilitating onboarding, gathering requirements to help inform key initiatives, and supporting key decisions with research or tapping external resources where necessary"]},{"title":"Requirements","content":["4+ years of experience in video game production or project management roles.","Deep understanding of game development processes and pipelines, having successfully run a game project of significant scope from beginning to end with cross-functional teams","Able to prioritize competing interests to best serve the comprehensive needs and constraints of a project.","Ability to think strategically and anticipate problems before they occur","Deep toolkit of work systems (especially JIRA) that can be introduced to teams as needed, but a strong desire to keep a light touch","Effective verbal and written communication skills. Should be able to adapt communication style to suit different audiences.","Experience tracking a complex project and providing support to clear blocking issues.","Highly detail-oriented and displays strong adaptability and problem-solving skills.","Positive attitude and strong people skills with a passion for making games and continuous growth.","Passionate about making games.","Positive attitude - not endless optimism, but able to clearly weigh pros and cons and constructively express dissenting opinions","Highly aligned with Netflix culture"]},{"title":"Bonus Skills","content":["Proficient with project management suites Google Suite, Confluence, Trello, Miro, etc.","Experience sourcing and managing outsourcers","Knowledgeable about the game industry from a player's perspective.","Experience working successfully with art outsourcing, and/or other remote teams."]},{"title":"Bonus Attributes","content":["Active gamer, especially for mobile games","Netflix content fan","Unending curiosity, and self-learning","Receptive to and skilled at giving and receiving critique and feedback."]},{"title":"Location:","content":["Local to LA preferred but open to remote"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/07316a12-561f-49da-85d8-693e06fe195e"
            }