            {
                "id": 370,
                "companyId": 6,
                "title": "Product Manager, Content Promotion and Distribution, Creative Innovation",
                "location": ["Los Gatos, California"],
                "type": [],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Product Manager","Content Promotion","Distribution","Creative Innovation","Product Concepts","Strategic Roadmap","Validation","Shipping","Measurement","Iteration","Strategy Memos","Presentations","Senior Executives","Team Leadership","Business Cases","Customer Needs","Design Partners","Promotional Media","Product Creative Studio","Roadmap","Cross-Functional Teams","Communication Strategy","Creative Team","Product Launching","Direct-to-Consumer Business","Relationship Building","Data Analysis","Consumer Testing","Verbal Communication","Written Communication","Internal Products","B2B Enterprise Products","Outstanding Customer Experience","Diversity and Inclusion"],
                "skills": ["Product Manager","Content Promotion","Distribution","Creative Innovation","roadmap","product concepts","validation","shipping","measurement","iteration","strategy memos","presentations","senior executives","team management","business cases","impact measurement","customer needs","design partners","creative teams","promotional media","prioritization","successful product launches","direct-to-consumer business","consumer testing methodologies","consumer tests","verbal communication","written communication","internal products","B2B enterprise products","outstanding customer experience","diversity","new perspective"],
                "overview": "The Product Manager, Content Promotion and Distribution, Creative Innovation at Netflix is responsible for developing innovative approaches to how content is promoted, localized, and distributed, with a focus on balancing the needs of members and content creators.",
                "description": "Los Gatos, CA, Los Angeles, CA or North America Remote

Netflix is one of the world's leading streaming entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films and mobile games across a wide variety of genres and languages. Members can play, pause and resume watching as they want, anytime, anywhere, and can change their plans at any time. 

Content Promotion and Distribution sits at the intersection of the consumer experience and the Netflix Studio. Our team is integral to making the Netflix experience feel personal and relevant by developing innovative approaches to how we promote, localize, and distribute content. Because our products touch both members and content creators, we seek someone who can fluidly move among both worlds, applying strong product principles and strategic frameworks to the member experience, while deeply empathizing with the art and craft required to create great content. 

",
                "extras": [{"title":"As a Product Manager at Netflix you will:","content":["Build a strategic roadmap and take product concepts from ideas through validation, shipping, measurement, and iteration.","Author strategy memos and presentations and represent your team’s work to senior executives.","Lead a team of stunning colleagues across design, engineering, and data science to deliver outstanding products to our customers.","Build business cases and measure the impact of your product innovation.","Deeply understand and socialize the evolving needs of our customers, with your design partners."]},{"title":"As the Product Manager, Creative Innovation you will be responsible for:","content":["Being the product manager that owns creative innovation products makes better promotional media assets for our members","Being the lead product manager partnering with our Product Creative Studio partners who are responsible for the promotional assets for product promotions","Developing and delivering a roadmap that balances the needs of our partner teams and prioritizes what is most impactful for our members and the business","Leading cross-functional teams including design, engineering, and data science to discover and execute opportunities","Communicating your strategy broadly throughout the organization"]},{"title":"Our wish list for the person in this role (remember, no one ever gets everything on their wish list!):","content":["Experience working with creative teams and/or building products for creative teams","Experience working with the creation of promotional media (image and video)","Experience working on a product team with a proven record of prioritizing and successfully launching products or platforms","Worked in a direct-to-consumer business, where the consumer is paying for the service","Ability to inspire, motivate, and lead a cross-functional team - your ability to build strong relationships is critical to success","Deep experience using data to inform priorities and evaluate impact of initiatives","Experience with consumer product testing methodologies and running consumer tests","Excellent verbal and written communication skills - you will write a lot!","Experience working on internal products or B2B enterprise products","Has strong instincts for outstanding customer experience","Embodies the Netflix real values while also bringing a new perspective to improve our culture. We strongly believe that diversity of experiences, perspectives, and backgrounds will lead to a better environment for our employees and better products for our customerss"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/cca69043-139b-4f9c-8658-a348a5babbb1"
            }