            {
                "id": 376,
                "companyId": 6,
                "title": "Program Manager - Scaled Launch Operations",
                "location": ["Mumbai, India"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 4,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Program Manager","Scaled Launch Operations","Project Management","Workflow Optimization","Pan Regional Stakeholders","Operational Workflows","Data Driven","Portfolio Management","Operational Mindset","Business Acumen","Stakeholder Engagement","Intake and Optimization","SLO Vision","Collaboration","Priority","Planning","Execution","Project Management Framework","Opportunity Identification","Intellectual Curiosity","Strategic Thinking","Data Insights","Team Activation","Resource Management","Feedback","Company Values"],
                "skills": ["Program Manager","Scaled Launch Operations","projects","Pan regional","global stakeholders","project schedules","cross-functional partners"],
                "overview": "The Program Manager - Scaled Launch Operations at Netflix is responsible for leading complex, multi-disciplinary projects, coordinating stakeholders, and optimizing operational workflows to meet goals and scale the business.",
                "description": "Netflix is the world's leading internet entertainment service with over 230 million members in over 190 countries enjoying TV series, documentaries, feature films, live programming and games across a wide variety of genres and languages.  At Netflix, we are reinventing the way people are entertained by both enabling and innovating how visual storytelling is produced, discovered and enjoyed. Netflix provides a platform for stories from different places and different perspectives to reach, connect, and inspire millions of people all over the world.  One of the core growth strategies in Netflix is the expansion of our global member base.  As the business landscape changes rapidly in each region, we need nuanced and locally-led business strategies to meet our goals.  

Our Scaled Operations team(SLO) is searching for an expert Program Manager to join our Mumbai hub. The mission of The Scaled Launch Operation’s team is to identify and embed new and existing workstreams from local partners into two operational hubs - advancing the work through scale and workflow optimization.

In this role you will lead complex, multi-disciplinary projects from start to finish — working with Pan regional and global stakeholders to plan requirements, manage project schedules, identify risks, and communicate clearly with cross-functional partners across the company. Your projects will often span offices, time zones, and hemispheres. It's your responsibility to coordinate the players and keep them up to date on progress and deadlines.

This position requires a self motivated, experienced program manager who can learn complex operational workflows quickly and thoroughly enough to begin optimizing them with the teams on the ground. We’re looking for a data driven Program manager who embodies a blend of portfolio and project management, has strong operational mindset, business acumen, excellent ability to navigate through ambiguity and chart new paths and is resilient through sometimes challenging stakeholder engagements.

This is an individual contributor position with no people management responsibilities. You will report directly to the Director of Scaled Launch Operations. 

",
                "extras": [{"title":"In this role you will","content":["Drive high priority and complex programs that will enable our Hub to intake new work rapidly, and smoothly from partners who are seeking to scale their workflows","Build and maintain intake and optimization and roadmaps. Help accelerate the SLO vision & business strategy by translating that into tangible execution plans, and helping our team to efficiently meet milestones and execute effectively.","Drive effective collaboration between both our Mexico City and Mumbai Hubs as well as between our Hub and global stakeholders","Participate in the planning and prioritization of the SLO growth and evolution, track the overall progress of strategy execution, identify & mitigate risks and issues, resolve conflicts and dependencies across key initiatives.","Share project management framework and best practices with SLO Workflow and Innovation team members so they can drive work streams effectively and with more consistency","Work closely with other Ops program managers and cross-functional partners to identify common themes/trends on challenges and opportunities to support solving bigger challenges, together","Inspire a multidisciplinary team toward shared goals, objectives, and opportunities"]},{"title":"The ideal candidate","content":["Brings years of practical and relevant experience in managing complex global portfolio, programs and projects at scale, in the entertainment and/or creative industries or where technology intersects with creativity","Possesses deep domain expertise and working knowledge in establishing and implementing portfolio and program management frameworks and best practices","Thrives in a fast-paced and demanding environment, possesses a high level of intellectual curiosity, and demonstrates strong judgment in the face of ambiguity.","Is a strategic thinker who can proactively look around the corner to identify areas of opportunities within the team and across the organization based on data and observations","Is equally comfortable in “left brain” or “right brain” problem solving, but be most excited when both are deployed at the same time and understand how to leverage data and insights to drive business impact in programs.","Exhibits humility and is astonishingly objective and nonpolitical when it comes to working with people","Has a track record for influencing a broad spectrum of creative and technical cross-functional teams (across countries, regions and functions) and activating them towards a common goal.","Communicates effectively and concisely and is able to read the room","Is well versed in managing resources (personnel and financial) to optimize the outcome of the programs and projects for which they are responsible.","Is effective at giving honest and direct feedback.","Understand, advocate, and embody the company's values and team goals.","Familiar and fiercely curious about Product, via data insights"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/7643c389-d7ca-4031-8784-8b5905fdc768"
            }