            {
                "id": 378,
                "companyId": 6,
                "title": "Program Manager, Renewable Energy & Carbon Credit Procurement",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 60000,
                "salaryMax": 290000,
                "salaryFormat": "bi-week-salary",
                "salaryCurrency": "USD",
                "salaryBonus": "Unspecified",
                "tags": ["Renewable Energy","Carbon Credit Procurement","Portfolio Management","Carbon Credits","Renewable Energy Procurement","Sourcing","Structuring"],
                "skills": ["carbon credit procurement","renewable energy procurement","sourcing","structuring","executing deals","carbon credits","renewable energy"],
                "overview": "The Program Manager, Renewable Energy & Carbon Credit Procurement role at Netflix involves managing the company's investments in carbon credits and renewable energy, including maintaining a diverse portfolio of high-quality carbon credits and supporting renewable energy purchases. Qualifications include experience with carbon credit and renewable energy procurement, collaborating with relevant communities, and portfolio management.",
                "description": "**We are open to this role being remote anywhere across the globe, not just in the US!**

Netflix is the world's leading streaming entertainment service with over 230 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films and mobile games across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any Internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. Visit our culture memo and long-term view to learn more about Netflix and how we work.

Netflix Sustainability serves to tackle our carbon footprint at the speed prescribed by climate science, raising awareness through our film and television content, and engaging our millions of members on climate & environmental change. See more at sustainability.netflix.com.

The Opportunity

Leveraging Netflix’s innovative and fast paced culture, help Netflix attain its public climate targets to cut our emissions in half by 2030 and (as of 2022), to annually bring our remaining net carbon footprint to zero by investing in the power of nature to capture carbon. 
",
                "extras": [{"title":"Responsibilities","content":["Reporting to Director of Sustainability & Operations, this role will work closely with senior team members to manage the company’s investments in carbon credits and renewable energy, including but not limited to:","Maintaining a balanced, diverse portfolio of high-quality carbon credits essential to our second public climate target","Structuring buy-forward deals that help project developers bring new high-quality credits to market in areas called for by climate science (e.g. blue carbon)","Vetting the quality of carbon credits against our 5 screening criteria (p19 of our ESG report)","Negotiating for reasonable pricing directly with project developers","Matching the volume of tons retired in a given year to the annual carbon footprint","Contributing to scientific- and NGO-led efforts to scale high-quality credit sources and procurement practices thereof (e.g. BASCS)","Supporting renewable energy purchases, ranging from annual EAC purchases to project specific investment opportunities:","Structuring and leading competitive procurements (RFIs/RFPs)","Liaison with vendor and project developers","Conduct emissions analysis and synthesize procurement recommendations for decision-maker consideration","Partner with finance teams to conduct project-level financial analysis","Data tracking and systems maintaining for required annual footprint and emissions reductions accounting"]},{"title":"Qualifications","content":["5 years of experience with carbon credit procurement","2+ years with renewable energy procurement (familiarity with voluntary RE markets a plus)","2+ years of experience with sourcing, structuring, and executing deals in carbon credits and/or renewable energy","Experience collaborating with the carbon credit and renewable energy communities (coalitions, research groups, policymakers, vendors, 3rd party certifiers, etc)","Proven experience with the best 3rd party standards responsible for ensuring additionality, permanence, non-leakage, realistic baselines, and no double counting.","Experience in portfolio management of:","Carbon credits in both reductions and removals with emphasis on nature-based solutions of high integrity and optimal ‘co-benefits’ (i.e. community livelihoods, water, biodiversity)","Renewable energy investments, including direct sourcing, utility-based supply programs to bundled and unbundled credits"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/27855d12-0984-436d-a3e9-a3bde01f6c51"
            }