            {
                "id": 381,
                "companyId": 6,
                "title": "Receptionist - ABQ",
                "location": ["Albuquerque, New Mexico"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Receptionist","Managing Calls","Organization","Attention to Detail","Office Equipment","Inventory Management","Event Coordination"],
                "skills": ["Receptionist","Albuquerque","New Mexico","calls","requests","visitors","incoming calls","reception area","lobby areas","office equipment","copy machine","computer","office supplies","pantry supplies","breakfast","lunch meals","caterers","Food and Beverage","inventory","Client Services","special events","credentials","studio drive-ons","employee team-building activities","Netflix Studio Albuquerque Operations Team"],
                "overview": "A Receptionist is needed to manage a high volume of calls and requests from tenants and productions, while also maintaining a warm and friendly atmosphere, organizing supplies, coordinating meals and events, and executing team-building activities for the Netflix Studio Albuquerque Operations Team.",
                "description": "We are seeking a Receptionist to join our growing Studio Management and Services team. This position will be housed in Albuquerque, New Mexico. The position will be responsible for managing a high volume of calls and requests from tenants and productions.

The Opportunity
Netflix is one of the world’s leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anywhere, and can change their plans at any time.

The Role
A successful candidate will be passionate, self-motivated, proactive, quick-thinking, flexible, able to pivot when necessary, thorough and able to manage multiple and diverse responsibilities with a strong emphasis on organization and unwavering attention to detail at all times. This is a demanding and fast-moving position that requires someone who is a proactive and positive thinker, and able to exercise good judgment and communication. 
",
                "extras": [{"title":"Responsibilities","content":["Welcome visitors in a warm and friendly manner","Manage, track and direct incoming calls","Maintain a safe and tidy reception area and all common lobby areas at all times","Operate standard office equipment on a regular basis, including a copy machine, and a computer","Order, Inventory and Manage office and pantry supplies","Coordinates daily breakfast and lunch meals with caterers for the Netflix Studio Albuquerque Operations Team","Manage lobby Food and Beverage offerings and inventory","Work with Client Services in the coordination of on lot special events","Create credentials for studio drive-ons","Responsible for creating and executing employee team-building activities","Other tasks as assigned to support the Netflix Studio Albuquerque Operations Team"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/3aac0d55-f35e-4269-ac26-31ce0fc6c371"
            }