            {
                "id": 495,
                "companyId": 6,
                "title": "Senior Manager, Partnerships and Growth Strategy & Analysis - APAC",
                "location": ["Singapore, Singapore"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": ["Partnerships","Growth Strategy & Analysis","APAC","analyzing Partnership opportunities","strategic growth initiatives","optimization of local plans","optimization of pricing"],
                "overview": "",
                "description": "Netflix is one of the world's leading entertainment services with 233 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 

The Opportunity 

Netflix derives a significant competitive advantage from the highly analytical approach it takes to managing all aspects of the business. As we continue to push for growth in the Asia Pacific (APAC) region, we are looking for a Senior Manager to join the Partnerships and Growth Strategy & Analysis (S&A) team. This role is primarily focused on analyzing Partnership opportunities across APAC, as well as supporting strategic growth initiatives through the optimization of our local plans and pricing. 

Local partnerships are a critical driver of growth for Netflix. The most common types of partnerships with local operators are bundles and/or set-top box integrations. These impact millions of members, and our analyses play a critical role in the assessment and ongoing strategy for those partnerships in the region. Our team evaluates opportunities with leading local telcos and analyzes their performance over time. During negotiations, we provide guidance to the Business Development team using data and analysis. When partnerships are launched, we monitor their performance and search for best practices and areas of improvement. Finally, we work closely with our Product and Partner Engagement teams to determine which changes in the Netflix experience could improve the partnerships’ impact. 

The Partnerships and Growth SP&A team also plays a critical role in determining the growth strategy for the region. We contribute to the broader growth strategy in the region, providing local guidance on price and plan strategy across markets and driving analysis in conjunction with our regional Product and Consumer Insights teams. 

The Partnerships and Growth Strategy & Analysis team is responsible for evaluating potential opportunities and analyzing the performance of existing partnerships. During negotiations, we provide strategic guidance to the Business Development team using data and analysis. When partnerships are launched, we monitor their performance and search for areas of improvement. Partnerships impact millions of members, and the outcome of our analyses plays a critical role in the growth of Netflix.
",
                "extras": [{"title":"Key responsibilities in the role include:","content":["Supporting senior stakeholders in the approach to Partnership launches in the region","Evaluating the financial impact of partnership opportunities (e.g. bundles) via financial projections and commercial scenario modeling","Advising cross-functional teams based on the results of our analyses","Analyzing the performance of existing partnerships to extract actionable insights (e.g. best practices, areas of improvement)","Creating insightful strategic presentations that facilitate decision-making for internal stakeholders and external partners","Partnering with the Product team to help identify, prioritize and assess the impact of new initiatives (e.g. reducing prices in a market, improving plan upgrades for bundles)","Providing inputs to other teams working on partnership or Growth initiatives (e.g. Product, Consumer Insights, Marketing)","Developing industry and competitive expertise for focus markets in APAC"]},{"title":"Qualifications:","content":["10+ years of experience, ideally with prior experience in Partnerships in the APAC region and in management consulting and/or tech companies","Highly analytical and effective communicators, with significant experience in team and stakeholder management.","Backgrounds in management consulting, tech companies and high growth environments with equivalent strategic and analytical roles are strongly preferred.","Ideal candidates will have a proven track record of performing comprehensive analyses independently and proactively, and a strong passion for the local entertainment industry.","Must thrive in a fast-paced environment, possess a high level of intellectual curiosity, focus selflessly on driving team results and exhibit the highest standards of integrity and ethics.","Relevant experience in the Telco Industry in APAC region","Extensive experience conducting quantitative and qualitative financial analysis","Prior team management experience","Team player with strong interpersonal skills, able to work independently","Skilled in preparing effective presentations with clear narrative and impactful graphics","Adept at managing multiple projects and stakeholders on a regular basis","Strong quantitative skills, proficiency in Excel; proficiency with SQL and Tableau a plus","Bachelor’s or master’s degree with emphasis on quantitative coursework; MBA a plus"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/68df9236-f911-4476-945b-abcd08c01057"
            }