            {
                "id": 404,
                "companyId": 6,
                "title": "Senior Program Manager - Creative Production Innovation Management",
                "location": ["Amsterdam, Netherlands"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "",
                "description": "Company & Role Overview:
Netflix is the world's leading internet entertainment service with over 230 million members in over 190 countries enjoying TV series, documentaries, feature films, live programming and games across a wide variety of genres and languages.  At Netflix, we are reinventing the way people are entertained by both enabling and innovating how visual storytelling is produced, discovered and enjoyed. Netflix provides a platform for stories from different places and different perspectives to reach, connect, and inspire millions of people all over the world.  One of the core growth strategies in Netflix is the expansion of our global member base.  As the business landscape changes rapidly in each region, we need nuanced and locally-led business strategies to meet our goals.  

CP Innovation Management (CPIM) is a team of Program Managers within the broader Creative Production (CP) organization driving a portfolio of complex product innovation and key business initiatives that intersects between Creative and Technology, and spans across Netflix and the globe.

The Senior CPIM program manager is part of the CP EMEA leadership team and plays an integral role in connecting the CP EMEA business strategy to the global product innovation initiatives and CP driven business initiatives.  Together with the CPIM and CP EMEA leadership teams, this individual contributor will blaze the trail in defining and setting up how portfolio and program management should look like in EMEA that will deliver the most impact for the global business and the region.  

This program leader ensures CP EMEA regional needs and perspectives are represented, and brings relevant updates to the CP regional teams in a timely manner.  In addition to driving high priority and complex global or regional cross-CP programs, this program manager also brings valuable insights to the CP EMEA leadership team through connecting with program managers in the other regions and business verticals and identifying trends and themes across the regions.

This position requires a highly motivated experienced program leader who embodies a blend of portfolio and program management, high business acumen and executive presence, knowledge of the creative ecosystem, excellent ability to navigate through ambiguity and chart new paths, great stakeholder relationship management skills, and a passion for continuous improvement. 

This is an individual contributor position with no people management responsibilities.
",
                "extras": [{"title":"In this role you will:","content":["Drive high priority and complex global cross-CP programs (Product management driven global product innovations and/or CP driven complex global business initiative) from ideation/strategy through delivery. Ensure both regional and global business contexts are considered in order to maximize the overall outcomes for our members and the business.","Build and maintain the overall regional program/project portfolio and roadmap. Help accelerate the CP Regional vision & business strategy by translating that into tangible execution plans, and helping the team to efficiently meet milestones and execute the region's key strategic bets.","Connect the CP Regional business strategy to global CP initiatives or global & regional product innovation initiatives in order to find the optimal paths to advance the CP Regional ambitions.","Drive effective collaboration between these global initiatives and the CP Region, advocate for the CP Region’s requirements and perspectives.","Participate in the planning and prioritization of the CP regional strategy bets, track the overall progress of strategy execution, identify & mitigate risks and issues, resolve conflicts and dependencies across key initiatives.","Drive high priority, complex region-specific cross-CP initiatives that tie to specific regional strategic bets.","Share project management framework and best practices with CP regional team members so they can drive work streams within specific CP initiatives effectively.","Work closely with other CPIM program managers and cross-functional partners to identify common themes/trends on challenges and opportunities (e.g. innovation ideas) across the regions and propose ways to capitalize on the commonalities to create bigger opportunities across CP overall.","Inspire a multidisciplinary team toward shared goals, objectives, and opportunities"]},{"title":"We seek a stellar program leader who:","content":["Brings 10+ years of practical experience in managing complex global portfolio, programs and projects at scale, in the entertainment and/or creative industries or where technology intersects with creativity","Possesses deep domain expertise and working knowledge in establishing and implementing portfolio and program management frameworks and best practices","Thrives in a fast-paced and demanding environment, possesses a high level of intellectual curiosity, and demonstrates strong judgment in the face of ambiguity.","Is a strategic thinker who can proactively look around the corner to identify areas of opportunities within the team and across the organization based on data and observations","Is equally comfortable in “left brain” or “right brain” problem solving, but be most excited when both are deployed at the same time and understand how to leverage data and insights to drive business impact in programs.","Exhibits humility and is astonishingly objective and nonpolitical when it comes to working with people","Has a track record for influencing a broad spectrum of creative and technical cross-functional teams (across countries, regions and functions) and activating them towards a common goal.","Communicates effectively and inclusively across cultures, creative, and technical teams.","Is well versed in managing resources (personnel and financial) to optimize the outcome of the programs and projects for which they are responsible.","Is effective at giving honest and direct feedback.","Understand, advocate, and embody the company's values and team goals.","Familiar and fiercely curious about Product, via data insights, A/B testing and user experience POV."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/c09326a8-eabe-49bc-844c-28fa3a3d6361"
            }