            {
                "id": 397,
                "companyId": 6,
                "title": "Senior Manager, Launch Management - APAC",
                "location": ["Singapore, Singapore"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 8,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Launch Management","Team Leadership","Project Management","Operations Strategy","Risk Mitigation","Workflow Optimization","Stakeholder Partnership"],
                "skills": ["Title Launch Managers","Product","workflows","operational solutions","partnerships","Content","Product","Engineering","Creative Production","Launch Management team","portfolio of titles","launch deliverables","strategic objectives","mitigate risks","Netflix","strategies","workflows","impact","operational excellence","strategic planning","prioritization","data-informed decision-making","innovation","Operations practice","Creative Production","people management experience","fast-paced and agile environment","change","ambiguity","innovation","process improvement","workflow creation","written communication skills","verbal communication skills","relationship management","expectation-setting skills","accountability","collaboration","thought partner","internal stakeholders","Netflix culture","Korean language","Japanese language"],
                "overview": "The Senior Manager, Launch Management - APAC is responsible for overseeing a team of Title Launch Managers, ensuring seamless launches of content on the Product, optimizing workflows, providing operational solutions, and building strong partnerships across various teams.",
                "description": "We are seeking a Senior Manager to oversee our team of Title Launch Managers in the APAC region.  Success for this team means seamless launches of all content on our Product, continuous optimization for new workflows, operational solutions for bespoke treatment of our titles, and strong partnerships across our partners in Content, Product, Engineering, and other Creative Production teams.  

The core focus of the Launch Management team is to drive value for the business by managing the operational strategy of their local portfolio of titles and product initiatives, and ensure a seamless experience for both our members and internal stakeholders. Launching a title on Netflix is a choreography of thousands of assets, and while various teams (internal and external) are involved in the preparation and project management of launch deliverables, the Launch Managers on your team are ultimately accountable for the quality of the launch and its alignment to larger strategic objectives. 

You and your team will work with stakeholders to mitigate risks when challenges arise at both a title and slate level, partner with stakeholders across Netflix to optimize these processes, and analyze the health of the content slate using relevant metrics.

",
                "extras": [{"title":"In this role you will:","content":["Manage, hire and build a diverse, strong, and passionate team. Inspire and grow your team with the vision and necessary goals for success","Lead the distributed team through change and pivot quickly to support business objectives.","Build strong bridges and tight partnerships with cross-functional partners both locally in APAC and globally, setting up strong foundations for productive thought partnership.","Effectively communicate context, priorities, and trade-offs to your team and partner teams.","Create, develop, and influence new strategies and workflows to increase impact and operational excellence.","Drive strategic planning, prioritization, and implementation of goals and milestones.","Encourage and model risk-taking, data-informed decision-making, and constant innovation.","Support your team as a resource for escalation and remove roadblocks.","Shape the narrative for the Launch Management team and the broader Operations practice within Creative Production in APAC and globally."]},{"title":"Requirements:","content":["8+ years of people management experience in a fast-paced and agile environment. Proven ability to lead through change, ambiguity, and innovation.","History of driving process improvement and workflow creation.","Strong written and verbal communication skills.","Strong relationship management and expectation-setting skills.","Track record of modeling accountability and ability to collaborate effectively with , influence, and be a valued thought partner to senior internal stakeholders.","An earnest and inclusive leader who will be a great steward of the Netflix culture while also helping it to shape and evolve it over time."]},{"title":"Nice to haves:","content":["Korean or Japanese language proficiency."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/ce0f6bfe-eb36-435f-a9c7-bc1098f5c8b9"
            }