            {
                "id": 398,
                "companyId": 6,
                "title": "Senior Mobile Game Engineer, Games Studio",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "A talented Senior Mobile Game Engineer is needed to design, develop, and optimize engaging and high-quality gaming experiences for iOS and Android platforms using clean and modular code architecture, while staying up-to-date with the latest developments in mobile game development.",
                "description": "ABOUT OUR TEAM
We’re a group of developers, artists, and storytellers that make games full of wonder, danger, and humor. Everyone at our studio, whether an industry vet or new voice impacts each game through collaborative feedback, mutual respect, and creative empowerment. If you want to make games that leave a meaningful impact on players: we want to hear from you.

We’re looking for new teammates who deeply care about the work they do, the stories they tell, and the people they create with. As part of the Netflix team, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration.

Learn how our story-loving game people came to join Netflix’s team of game-loving story people.

ENGINEERING AT NIGHT SCHOOL
Software development is just as creative as other roles at Night School. Our engineering team highly values cross-disciplinary thinking. Creating great gameplay experiences requires engineers to not only imagine elegant, extensible, and optimized systems, but also to appreciate, communicate, and integrate with art, design, and narrative. Here, you’ll flex your ingenuity and skill in multiple areas as needs arise, whether directly in our games, as part of a development support system, or as part of our in-house storytelling toolset, NightTools.

ABOUT THE ROLE
We are looking for a talented, driven, and passionate mobile game engineer to help us build the best mobile experiences possible for our existing and upcoming games. As a Senior Mobile Game Engineer, you will play a crucial role in designing, developing, and optimizing our games for iOS and Android platforms. You will work closely with cross-functional teams to create engaging and high-quality gaming experiences that captivate players. Your expertise in mobile game development will be pivotal in pushing the boundaries of what is possible in mobile gaming.

",
                "extras": [{"title":"Responsibilities:","content":["Implement game systems for all of Night School’s live and upcoming projects.","Own the development of any and all updates and maintenance to our mobile tools and ports.","Bring a deep understanding of mobile development best practices, ensuring optimal performance and compatibility across a wide range of devices.","Integrate game code with iOS, Android, and proprietary APIs on native devices.","Develop and maintain clean, efficient, and modular code architecture to facilitate scalability, maintainability, and collaboration within the development team.","Implement effective testing and debugging procedures to identify and fix bugs and issues, ensuring a polished final product.","Work closely with artists, designers, and other engineers to bring game concepts to life and maintain a cohesive vision for the project.","Create and maintain comprehensive documentation for code, processes, and best practices to facilitate knowledge sharing and onboarding of new team members.","Stay up-to-date with the latest developments in mobile game development, iOS, and Android platforms, and integrate new technologies and features into our games."]},{"title":"About you:","content":["Driven to maintain the highest-quality experiences for players.","Excellent problem-solving skills and the ability to work independently as well as in a team.","Skilled at writing code that is elegant, extensible, and optimized.","Proficient at giving and receiving quality feedback.","Self-starter willing to seek out solutions and ask questions when necessary.","Mindful of the needs of a team as individuals and as a whole."]},{"title":"Skills & Requirements:","content":["Bachelor's degree in Computer Science, Software Engineering, or related field (or equivalent work experience).","5+ years of professional experience in mobile game development.","Extensive experience with iOS and Android development using Swift, Objective-C, Java, or Kotlin.","Proficiency in game development engines and frameworks (e.g., Unity, Unreal Engine).","Published games on the App Store and Google Play Store."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/4604e8f7-044e-4811-934c-63a9b28ca830"
            }