            {
                "id": 409,
                "companyId": 6,
                "title": "Senior Software Engineer",
                "location": ["Helsinki, Finland"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Senior Software Engineer","Java","Project Management","Agile Methodology","Jira","Conflict Resolution","Budget Management","Team Leadership","Server Engineer","Cloud Technologies","Kubernetes","C# Programming",".NET Runtime","Troubleshooting","Communication Skills","Software Development Practices","English Fluency","Team Players","Attention to Detail","Feedback","Designs","Server Platform Development","Back-end Development","Public Clouds","Azure","AWS","GCP","Live Cloud Backend(s)","Game Server Platform"],
                "skills": ["Server Engineer","back-end development","Azure","AWS","GCP","Kubernetes",".NET","troubleshooting"],
                "overview": "A Senior Software Engineer position is available at Next Games, a Netflix Game Studio, where the focus is on creating fans-first interactive experiences by combining well-known movies and shows with engaging game mechanics. This role involves working on challenging technical tasks with modern cloud technologies and contributing to the development of a game server platform hosting millions of players. The ideal candidate should have experience in back-end development, knowledge of cloud technologies such as Kubernetes, and excellent C# programming and troubleshooting skills.",
                "description": "Next Games is a Netflix Game Studio, focusing on creating compelling fans-first interactive experiences by combining the stories of well-known movies and shows with engaging game mechanics. An unwavering focus on fans and fun gameplay is at the core of the studio’s game development, free from the constraints of free-to-play.

If working on globally recognised entertainment IPs, or helping develop the next blockbuster game IP; that’ll be available on the world's biggest streaming platform Netflix, sounds like your cup of tea, Next Games can provide that opportunity.
 
We are looking for a Senior Server Engineer to join our studio in Helsinki. This role offers an opportunity to work with a very senior team set to create the next success story in mobile gaming.

Together with other skilled members in the team, you will get to work on the platform which enables millions of players around the world to enjoy the games we here at Next Games are creating. You will have one of the world's most solid tech stacks at Netflix in your toolbelt. 

You are curious about what’s new and how things could work, and you have a drive for exceeding your own limits and improving yourself and the team. You are proactive and take pride in building robust and maintainable services.

At Next Games, you get to work on challenging technical tasks and modern cloud technologies. Our team is relatively small, which means that we have very little bureaucracy and that you have the opportunity to take on a wide variety of tasks.
",
                "extras": [{"title":"Responsibilities","content":["Learn and work with latest cloud technologies","Be part of developing game server platform hosting millions of players","Do requirement analysis and designing new features","Collaborate with other teams and be part of creating great games","... And more!"]},{"title":"Experience","content":["Experienced in back-end development","Experience in one or more of the public clouds (Azure, AWS, GCP)","Experience and interest in cloud technologies such as Kubernetes","Experience in developing and operating live cloud backend(s)","Great C# programming skills and knowledge of .NET runtime","Great troubleshooting and communication skills","Understanding of modern software development practices","Fluency in English"]},{"title":"What we value:","content":["Team players","Solid communication skills","Attention to detail","Ability to give and take feedback","Enthusiasm to take part in designs","Passion about creating robust server platform for great games"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/6febad06-0b24-40a7-a969-889e9241c5a6"
            }