            {
                "id": 395,
                "companyId": 6,
                "title": "Senior Manager, Ads Measurement UK",
                "location": ["London, United Kingdom"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 10,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Ads Measurement","Data Science","Consumer Insights","Product","Sales","Measurement Roadmap","Ads Marketing","Sales","Marketplace Positioning","Measurement Solutions","Thought Leadership","Content","Competitive Landscape","Media Measurement","TV/Video","Large-scale Projects","Advertising Landscape","Quantitative Methodologies","Qualitative Methodologies","Cross Functional Teams","International Environments"],
                "skills": ["data engineering","measurement","product","sales","measurement tools","measurement solutions","advertising campaigns"],
                "overview": "The Senior Manager, Ads Measurement UK at Netflix is responsible for working with the ads measurement team to implement the measurement roadmap, deliver data and insights to advertising clients, and develop full-funnel measurement solutions.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 

The core Advertising team is charged with building a new, best-in-class ads organization to establish Netflix as the premiere platform for advertiser partners, and to drive advertising revenue. The measurement team is responsible for building audience insights and measurement solutions from the ground up, partnering closely with data science, consumer insights, product and sales to understand core customer needs and develop both foundational and innovative solutions.
",
                "extras": [{"title":"In this role, you will:","content":["Work closely with the broader ads measurement team, both within EMEA (Europe, Middle East and Africa) and globally, product and data engineering to prioritise and implement the measurement roadmap across the UK market in collaboration with the Director of Ads Measurement Strategy, EMEA.","Partner with Ads Marketing and Sales to deliver data and insights to our advertising clients and agencies with key narratives around the Netflix audience and service","Engage with measurement partners in ensuring that Netflix is accurately represented in industry measurement tools","Provide marketplace positioning and storytelling customized for verticals and clients","Assist in developing full-funnel measurement solutions that enable advertisers to understand the value and efficacy of their Netflix campaigns","Inform on opportunities for alternative currencies, targeting and/or measurement products","Deliver thought leadership by deeply understanding consumer perception, attitudes and behaviors related to both content and ads on Netflix and the competitive landscape"]},{"title":"About you:","content":["10+ years in media measurement at a TV, streaming or digital company","Dual TV/Video and digital experience is a plus","Self starter with expertise in managing large-scale, complex projects","Strong knowledge of the advertising landscape, across all kinds of media channels and methods of buying","Loves to get into the weeds and can see the big picture","Open to innovating, challenging assumptions and implementing better approaches","Knowledge of quantitative and qualitative methodologies","Understanding of the consumer’s voice and how to turn that into actionable insights","A strong business partner to other cross functional teams and a leader who can prioritize multiple projects","Collaborates effectively and embraces differing perspectives and experiences to make better decisions","Experienced and at ease with diverse cultures and working in international environments"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/6ff505d2-1b06-40be-85f6-318d2689c384"
            }