            {
                "id": 405,
                "companyId": 6,
                "title": "Senior QA Analyst",
                "location": ["Helsinki, Finland"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 4,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Mobile Games","QA Responsibility","Test Cases","Error Identification","Test Schedules","Software Usability","Mobile Platforms"],
                "skills": ["QA analyst","gaming industry","quality assurance methodologies","crafting test cases","problem-solving skills","attention to detail","mobile platforms"],
                "overview": "The Senior QA Analyst position at Next Games involves taking overall QA responsibility for a large mobile game project, creating and executing test cases, identifying and resolving issues, providing feedback to developers, and managing a team of external vendor testers.",
                "description": "Next Games is a Netflix Game Studio, focusing on creating compelling fans-first interactive experiences by combining the stories of well-known movies and shows with engaging game mechanics. An unwavering focus on fans and fun gameplay is at the core of the studio’s game development, free from the constraints of free-to-play.

If working on globally recognised entertainment IPs, or helping develop the next blockbuster game IP; that’ll be available on the world's biggest streaming platform Netflix, sounds like your cup of tea, Next Games can provide that opportunity.
 
As a Senior QA Analyst you have passion for mobile games and eagerness to take on the next big challenge. You will get to help our teams deliver high quality gaming service experiences to the players. In this role, you will be responsible for creating, executing, and maintaining comprehensive testing strategies, ensuring that our mobile games meet and exceed the high-quality standards our partners have come to expect. You will work closely with our design, development, and production teams, focusing on crafting and executing test cases to identify and address issues. You will also set testing priorities for a team of external vendor testers to ensure an excellent gaming experience for our users.
",
                "extras": [{"title":"Key responsibilities:","content":["Take the overall QA responsibility of a large mobile game project","Create, execute, and maintain test cases to ensure that all objectives are met and that our mobile games function as expected.","Track the process of error identification and resolution, and confirm that issues have been effectively addressed.","Execute test schedules or strategies in accordance with project scope or delivery dates.","Participate in product design reviews to provide input on functional requirements, product designs, schedules, or potential problems.","Provide feedback and recommendations to developers on software usability, accessibility and functionality.","Work closely with production and support teams to swiftly identify and resolve issues.","Set priorities and provide direction for a team of external vendor tester"]},{"title":"Skills and experience:","content":["Proven experience as a QA analyst or similar role in the gaming industry or relevant role (4+ years preferred).","Excellent knowledge of quality assurance methodologies and tools.","Proven experience in crafting and executing detailed test cases.","Strong problem-solving skills and attention to detail.","Strong analytical and communication skills.","Familiarity with mobile platforms (iOS, Android, etc.) and related technologies.","Mobile games industry working experience is a plus.","Experience with automated testing tools is a plus."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/81bd0795-65fa-434d-989c-fd56e76128b4"
            }