            {
                "id": 386,
                "companyId": 6,
                "title": "Senior Analyst, Production Tax EMEA",
                "location": ["Amsterdam, Netherlands"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "",
                "description": "Netflix is the world's leading streaming entertainment service with 238 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause, and resume watching, all without commercials or commitments.

It’s an amazing time to join Netflix as we continue shaping the future of global entertainment. As Netflix expands globally, we look for the best and brightest talent to scale with and contribute to our growth. That’s where you come in.

The Opportunity

Netflix is seeking an experienced Senior Analyst to join our production tax team in EMEA to support day-to-day tax and incentives operations and provide tax planning and structuring support for Netflix’s growing studio production business. Tax experience in the entertainment industry is a plus. The ideal candidate will have strong tax technical and analytical skills, communication and organizational skills, excellent attention to detail, and the ability to meet deadlines and prioritize tasks in a fast-paced environment.
",
                "extras": [{"title":"Responsibilities include, but are not limited to:","content":["Research and develop a thorough understanding of film & television production incentives;","Assist with evaluating and obtaining production incentives, including providing support throughout the application, audit, and monetization phases;","Provide tax support and advice to production teams, especially regarding withholding, indirect taxes, and personal income taxes;","Coordinate with external advisors and the broader tax teams to ensure tax and incentive compliance;","Work closely with physical production, production finance, treasury, corporate legal, public policy, tax, and business and legal affairs teams across all production verticals on various business, tax, and incentive matters;","Liaise with the content accounting team on financial reporting of incentives;","Research complex tax issues and prepare technical documentation / memorandums; and","Monitor and analyze existing and proposed tax and incentive legislation, and assist in defining and implementing appropriate tax and incentive strategies."]},{"title":"Qualifications:","content":["You embrace and advocate the Netflix culture and our long-term view;","4-7 years of experience working with a broad range of tax issues facing large multinational corporations, including public accounting, law firm, and/or industry experience;","CPA, law degree, and/or Masters degree in taxation preferred;","Tax experience in the entertainment industry is a plus;","A generalist profile (i.e., experience with indirect taxes and international tax matters, corporate and personal taxes) would be preferable but not required ;","Tax experience in multiple EMEA jurisdictions;","Self-starter with good judgment and strong organizational skills;","Ability to manage multiple projects and produce high quality work in a fast-paced environment;","Ability to work proactively and independently across multiple time zones required;","Strong verbal and written communication skills with an ability to build relationships with cross-functional business partners;","Critical thinker with a focus on finding pragmatic solutions to tax issues that may impact the business;","Fluent English is a requirement, additional languages a big plus"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/3ab32743-f7a8-455e-9eb0-9dc889b868b8"
            }