            {
                "id": 408,
                "companyId": 6,
                "title": "Senior Server/Backend Engineer - Spry Fox",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 150000,
                "salaryMax": 300000,
                "salaryFormat": "per-year-salary",
                "salaryCurrency": "USD",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "",
                "description": "ABOUT OUR TEAM
Our motto is, “make the world a better place”; and we try to do this through the games we make. Invention is part of our DNA at Spry Fox. Whether it’s by designing MMOs that encourage the development of friendships and discourage toxicity, or by designing unique puzzle games that promote English language learning; we’re always asking ourselves “how does this game improve your life?”

Spry Fox strives to be a studio that is a pleasure to work for, an important but not dominating part of your life, and recognizes crunch is a negative, counter-productive industry practice — something to be learned from and avoided in the future. We want you to have friends, family, hobbies, and a life outside of work. We want you to love your colleagues and know that they support you 100%. We want you to be proud of what you do and how you do it.

For 10+ years, we’ve been fully remote with Foxes scattered all over the world. To make that work well, we all try to be online and communicative from 10am to 2pm PST to ensure that we have enough overlapping work hours with our team; otherwise, our schedules are flexible and fully under our individual control!

Now that we’re a part of Netflix, we can do what we love with more support and without having to worry about how to monetize! We’ve always been focused on making thoughtful, original games… now more than ever. 

ABOUT THE JOB
Spry Fox is looking for a Senior Server/Backend Engineer to join our team and help us build an original, non-violent MMO! You’ll work alongside a small team of extraordinarily talented and thoughtful people who are building our game server and backend, bringing players together and ensuring that things run smoothly.

",
                "extras": [{"title":"Responsibilities","content":["You will direct the architecture of both backend services and game servers for a large-scale, non-violent, cozy MMO.","You will work closely with artists, designers, and other engineers to implement new game features across the server and backend service layers.","You will coordinate web service and game server deployments (and scaling) across dozens of machines and hundreds of processes ensuring maximum stability and a smooth player experience.","You will be responsible for the security of the studio’s publicly accessible services and game servers.","You will be responsible for designing and maintaining the systems that persist data from thousands of requests per second across hundreds of servers."]},{"title":"Requirements","content":["You are familiar with Python, containerization, container orchestration and SQL databases.","You have worked on one or more shipped MMO projects and have a deep understanding of the entire tech stack.","You have the ability to communicate with all team members, including artists, programmers, and designers on the many tradeoffs required to build an MMO."]},{"title":"Nice To Have","content":["You are comfortable with C++ and comfortable implementing and improving gameserver features (like networking and data storage).","Our game client uses Unreal Engine, some experience would be a bonus."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/431d8e63-5659-4bb8-ac2a-d2d6ba9f5dcd"
            }