            {
                "id": 392,
                "companyId": 6,
                "title": "Senior HRIS Business Analyst, Workday Recruiting L5",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Workday Recruiting","HRIS Business Analyst","Business Analysis","QA","Requirements Definition","Project Management","Data Exchange"],
                "skills": [""],
                "overview": "The Senior HRIS Business Analyst is responsible for working cross-functionally with internal teams, configuring and maintaining business process definitions and domain security in Workday, developing and supporting integrations, and building reports and dashboards using Report Writer and Discovery boards. The ideal candidate should have at least 5 years of hands-on Business Analyst experience with Workday Recruiting, subject matter expertise in Workday modules such as Recruiting, Onboarding, and Core HCM, and possess excellent communication, analytical, and problem-solving skills.",
                "description": "The Netflix Talent Engineering team manages and delivers applications for the constantly evolving needs of our HR organization. As Netflix grows globally, we continue to look for the best and brightest talent to scale with our growth opportunity. Our team is seeking an outgoing, curious Senior HRIS Business Analyst to work in a rapid development environment with multiple internal customers throughout the business. 

This position will reside in the company’s Los Gatos office and will report to the Manager, Talent Engineering. To succeed in this role you should have at least 5 years of working experience in implementing and supporting ATS, and HCM/HRIS applications and be passionate about the internal customer's business as well as the field of business analysis and QA. An ability to think critically and outside the box is a must. The opportunity to participate in requirements definition, development, training and implementation offers tremendous job satisfaction for a highly motivated problem solver.

Visit our culture deck and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team

",
                "extras": [{"title":"Responsibilities, but not limited to","content":["Work cross-functionally with multiple internal teams including Talent Acquisition, Talent Operations, and Planning.","Configure, and maintain business process definitions in Workday.","Configure and maintain domain security in Workday.","Develop and support integrations (EIB), for inbound and outbound data exchange between Workday and other internal/external systems.","Build reports and dashboards using Report Writer, and Discovery boards."]},{"title":"Experience & Competencies Required","content":["At least 5 years of hands-on Business Analyst experience working with Workday Recruiting.","Subject matter expertise on the following Workday modules: Recruiting, Onboarding, and Core HCM.","In-depth understanding of HR domain and processes.","Project management experience.","Excellent verbal and written communication skills.","Ability to think outside the box.","Strong analytical and problem-solving skills."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/63517e87-e040-4b71-a39d-6cf49b6e6e36"
            }