            {
                "id": 394,
                "companyId": 6,
                "title": "Senior Manager, Ads B2B Marketing - APAC",
                "location": ["Singapore, Singapore"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "The Senior Manager, Ads B2B Marketing - APAC is responsible for crafting and activating the Netflix advertising story and value proposition to advertisers in key markets in APAC, collaborating with cross-functional teams and leading the team strategy for industry events and client engagements.",
                "description": "Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. 

The Team
Ads Marketing function leads the development of our core ads positioning, and the go-to-market plan to bring this positioning to life through differentiated messaging and narratives in the market.  The team activates this messaging through Sales Enablement (presentations, materials, talking points) and non-sales channels to garner broad awareness and excitement amongst our key advertising partners.  

The Opportunity 
In this newly created position of Senior Manager, Ads B2B Marketing, the person  will be a leader and key architect in the Ads Marketing team’s success by crafting and activating the Netflix advertising story and value proposition to advertisers across key markets in APAC. You’ll work with multidisciplinary teams to develop strategic approaches to fueling brand and business growth on platform in the region.

Additionally, you will contribute to broader business tactics beyond and pursue learning and development opportunities to consistently grow and evolve as a Netflix marketer and executive.
",
                "extras": [{"title":"Core Responsibilities:","content":["Design and craft go-to-market strategies and narratives in an exciting way for the Sales team and their advertising clients in collaboration with Global Ads Marketing team","Collaborate cross-functionally (Global Ads Marketing, Comms, Ad Product Marketing, Research) to ensure a consistent ads narrative that is culturally nuanced in the region","Partner regularly with international teams for launches and ongoing growth ( like Sales, Ad Product, Comms, Partner Marketing, Events, PR, and others).","Lead the team strategy and approach for how Netflix Ads shows up at local industry events and bespoke client engagements","Pull together business goals, to align on audiences to target, channels to employ, countries to activate, etc.","Work with product and comms partners to clearly define marketing needs and coordinate various parts of the Ad Sales organization to execute against those needs (e.g. brand design, organic social, paid social, partner marketing, etc).","Assess the right data and insights and upcoming ad solutions to identify key B2B stories that will resonate with the region and local markets","Understand our partners (advertisers), and seek actionable insights to inform product and marketing strategy, and represent partners to cross-functional teams.","Deliver regular updates to leadership complete with wins, challenges, and asks."]},{"title":"Qualifications:","content":["15+ years of experience in B2B marketing, product marketing, digital advertising or marketing communications.","Strong people management and leadership experience and skills","An understanding of the CTV/OTT/Streaming landscape is preferred.","Experience in positioning, narrative, and collateral development.","Ability to develop and implement creative ideas, partner with agencies, and carefully manage competing projects with tight deadlines.","Develop content including blog posts, case studies, presentations, creative assets, and thought leadership that support our marketing objectives.","Strong communication skills and the ability to speak and write in English","Ability to work in a highly cross-functional environment to drive stakeholder alignment and scaled communications.","Experience in managing Korea or Japan will be a huge plus","You have an entrepreneurial mindset and are eager to flourish in our unique company culture (see Who We Are)."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/f3275e7e-38af-4bb6-84b6-a99094738986"
            }