            {
                "id": 437,
                "companyId": 6,
                "title": "Software Engineer, L5, Open Connect Edge Accelerator",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": ["TCP","TLS","HTTP","DNS","distributed systems","scalability","fault tolerance"],
                "overview": "A senior software engineer is needed to improve and build new features for the Open Connect Edge Accelerator, focusing on latency measurement, steering solutions, reverse proxy, failover mechanisms, protocol optimizations, and DDoS protection, among others.",
                "description": "Open Connect is a critical group within Netflix that builds and manages a content delivery network (CDN) handling more than one third of North American internet traffic at peak times!  We strive to deliver a great Netflix viewing experience in over 190 countries so our customers can watch whatever, whenever, interruption free. Over 230 million members around the globe are currently enjoying more than 16 billion hours per month of original series, documentaries and feature films. Come work alongside some of the best and most experienced engineers of the CDN industry.

Open Connect Appliances (OCAs) are ideally situated to improve the latency between clients and the Netflix services running on AWS. The Open Connect Edge Accelerator is taking advantage of the highly geo-distributed nature of Open Connect to improve the quality of experience. It is the entry point for device and website traffic, putting it on the critical path to delivering and monitoring our product experiences. You can learn more about us by watching this QCon talk presented by Sergey from our team. We are looking for a senior software engineer to improve the solution and build new features. You will be working on latency measurement, steering solutions, low-latency reverse proxy, failover mechanisms, protocol optimizations and DDoS protection to name a few. 

",
                "extras": [{"title":"You are","content":["Someone who likes to work hands-on and be self-directed in a fast-paced environment that gives you freedom and responsibility.","Able to see beyond immediate specs, summarize requirements, and architect forward-looking solutions.","Capable of working in a cross-functional collaborative environment alongside your teammates.","An advocate for the customer who is passionate about addressing customer pain points."]},{"title":"Required Skills","content":["Deep understanding of the Internet protocols like TCP, TLS, HTTP and DNS.","Experience building and maintaining highly distributed, scalable, low-latency, fault-tolerant production systems.","Great communication and documentation skills targeted at cross-team collaboration.","Motivated by “the art of possible” and able to balance idealism and pragmatism.","Cool-headed during production issues, able to focus on problem resolution."]},{"title":"Bonus Skills","content":["Go, C or Python","Data crunching using Hive, Pig, Kibana, Tableau, or similar","FreeBSD or any POSIX environment","Application, system and network profiling techniques"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/b36ea0bf-211c-4ebe-9109-055b18098b8b"
            }