            {
                "id": 420,
                "companyId": 6,
                "title": "Software Engineer (L5) - Ads Revenue Infrastructure",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "",
                "description": "At Netflix, we want to entertain the world and are constantly innovating how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 238 million paid subscribers, and are expanding into new forms of entertainment such as gaming. Engineering teams within Netflix work hard every day to scale and innovate this content production and member experience in an ever-growing complex software landscape.  
 
The Revenue Infrastructure team’s mission is to streamline revenue financial workflows so that our financial teams can close the books with a high degree of accuracy and confidence. The systems we build need to be scalable and accurate as we handle revenue operations for all Netflix customers. Some of the projects we are focused on are building infrastructure for revenue ads integration, settlement, and cash reconciliation of all Netflix subscription payments, generating invoices for our bundle partners, and revenue partner workflows. 


As an engineer on the team, you will work with Product Managers, cross-functional engineering teams, and Revenue Finance to design and evolve architectures that can handle massive data and build highly configurable pipelines to support global workflows for complex financial functions.
",
                "extras": [{"title":"Technical Expectations","content":["MUST: Direct experience in building ads revenue systems and integrations with required third-party systems is a required skill set for this position.","BS/MS in Computer Science or equivalent.","Strong data structures and algorithms knowledge with server-side expertise.","Have a strong background in distributed data processing, software engineering design, and data modeling concepts.","Proficient in Java, Scala, or any other JVM language.","Experience with Pub-Sub (Kafka), Stream Processing (Spark/Flink, etc.)","Expertise in solving large data challenges.","Experience with Cloud Computing platforms (AWS/Azure/GCP).","Expertise in building distributed applications that are secure can scale, and are highly available.","Build a deep understanding of upstream/downstream systems and processes and how they should shape data model design and impact adjacent systems."]},{"title":"About you","content":["Professional experience and interest in revenue advertising solutions, preferably on the sell-side or platform side.","Understand the modern ad technology ecosystem with a focus on fintech.","Experience with privacy, compliance, and governance in the advertising space.","5+ years of hands-on, software engineering experience in building business-critical, reliable, and distributed systems.","Background in building financial or payment solutions. Experience in leveraging ML is a plus.","You are driven by the desire to solve hard technical problems with the goal to automate and scale everything!","You are self-motivated and love making an impact.","You can work independently, delivering innovative solutions with minimal guidance.","You have a successful track record of delivering results in complex cross-functional projects.","You strongly believe in test-driven development.","You have a strong bias towards action."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/0e733d7e-3a0a-4dd5-ab5e-51c970b484e3"
            }