            {
                "id": 431,
                "companyId": 6,
                "title": "Software Engineer L4/L5 - Content Middleware Infrastructure (MWI)",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Content Middleware Infrastructure","Studio and Content Engineering","Data and Workflow","Connected Studio","Backend Engineer","Content and Studio Data Movement","Graph Search Platform"],
                "skills": ["Java","OO design principles","concurrency","parallelism","event-driven architecture","large-scale resilient distributed systems","microservices"],
                "overview": "The Software Engineer L4/L5 - Content Middleware Infrastructure (MWI) position focuses on providing infrastructure and solutions for content and studio applications, including data, workflow, and messaging platforms, to support the goal of the Connected Studio.",
                "description": "Content Infrastructure & Solutions (CIS) empowers engineers working on content and studio applications to be innovative and agile in supporting our massive global content production needs. We do that by providing scalable and resilient infrastructure to address integrated large-scale media, assets, data, workflow, and communication use cases. Examples of this organization’s work include massive-scale media processing platforms (1, 2) workflows (conductor), and data processing (1, 2). 

The Content Middleware Infrastructure team, a part of the Content Infrastructure & Solutions group, provides Studio and Content Engineering specific, highly leveraged, and fully managed data, workflow, and messaging & communication platforms facilitating the goal of the Connected Studio. The team consists of three subteams that work independently: MWI Workflow, MWI Data, and MWI Messaging. We are hiring for a backend engineer role for the MWI Data team. 

The MWI Data team provides coherent platform solutions to enable Content and Studio engineering to produce and move discoverable and connected data sets, and also transform or combine them into novel ones that can be used to empower business use cases. 

We partner very closely with the Netflix Data Platform team on  Data Mesh offer a paved path solution for content and studio data movement built on top of Data Mesh called SDSP; we also provide a Graph Search platform that enables cross-entity and multi-entity search with a consistent UX within the various applications/workflows across Studio/Content engineering. Lastly, we are currently working on an Ontology service that aims to enable the definition of a logical data model (ontology) for the entirety of the entities within content and studio engineering backed by a single combined schema.

",
                "extras": [{"title":"You will be successful in this role if you:","content":["Are excited about learning new technologies","Passionate about automated testing, code quality, and engineering best practices","Advocate software craftsmanship and take pride in your work","Enjoy building tools and infrastructure to empower other engineers, with a focus on developer experience and operational excellence","Enjoy collaborating with engineers across functional teams and have excellent communication skills"]},{"title":"Qualifications:","content":["Have 3+ years of experience with Java, and have proficiency in OO design principles","Have a good understanding of concepts like concurrency, parallelism, and event-driven architecture and experience in working on large-scale resilient distributed systems","Experience in designing and developing microservices","Are keen on developer experience and observability"]},{"title":"Nice to have:","content":["Experience in designing large-scale resilient distributed systems","Experience with technologies like Spring Boot, GraphQL, RDF, Neptune, Kafka, Cassandra, CockroachDB, and Elasticsearch","Experience building event/messaging systems using technologies like Kafka.","Experience in data modeling and API design"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/030cfae0-98df-488c-b52e-a23b93c1fa8f"
            }