            {
                "id": 424,
                "companyId": 6,
                "title": "Software Engineer (L5) - iOS Player",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "The Software Engineer (L5) - iOS Player job at Netflix involves building robust and scalable solutions for new features and optimizing existing player experiences on the Netflix iOS App, working on various aspects of playback ranging from playback mechanism to integration with UI, and collaborating with cross-functional teams to define app features and user experiences.",
                "description": "Netflix's mission is to bring joy and delight to our customers by providing the best content and streaming experience possible. There is no better way to do this than through the Netflix iOS application on Apple's iPhones and iPads. iOS devices are used by millions of users across the world to stream high-quality content and are loved by creatives, producers, and filmmakers for their capabilities. Marrying Netflix's exceptional engineering capabilities with Apple's world-class technology brings unparalleled viewing quality to the millions of Netflix users who stream on iOS devices. 

The Netflix iOS Player Team is responsible for building the best streaming experience for our iOS customers. We are an intrepid group of highly skilled engineers who self-navigate through various problems to deliver complex solutions quickly and with extremely high quality. Our team works on various aspects of playback for the Netflix application, ranging from playback mechanism to integration with UI.

We are looking for a talented Software Engineer to join our small team and help us build the next wave of innovation on the Netflix iOS App. As a team member, you will be responsible for building robust and scalable solutions for new features and optimizing existing player experiences. You must self-organize project delivery, work with engineers cross-functionally to gather and define requirements and execute complex projects. 
",
                "extras": [{"title":"What Sets You Apart","content":["Curious about a broad range of new or unfamiliar technologies, our consumer base, and product vision","Seek different perspectives, feedback, and relevant information to continuously grow and improve","Maintain strong relationships with cross-functional teams through clear communication","Take a thoughtful and practical approach to problem-solving that considers tradeoffs and avoids over-engineering","Comfortable asking questions and seeking knowledge in unfamiliar or ambiguous situations","Endeavor to elevate the knowledge, skills, and abilities of yourself and others that fosters an inclusive and collaborative environment"]},{"title":"Must have skills and experiences","content":["A proven track record of delivering quality player capabilities within the iOS or tvOS ecosystem","Proficiency in Swift and Objective-C","Experience with Apple's software development tools (Xcode, Instruments, etc.)","Experience with UIKit, AVFoundation, and other relevant frameworks","Experience with video and audio streaming technologies (HLS, DASH)","Strong understanding of software architecture and design patterns","Excellent problem-solving and debugging skills","Strong written and verbal communication skills","Strong ability to communicate cross-functionally","Knowledge of media formats and codecs (AAC, H.264, HEVC, etc.)"]},{"title":"While on the team, you can expect to:","content":["Design, develop, and maintain high-quality features for Netflix’s iOS player","Work to collaborate with cross-functional teams to define app features and user experiences","Write clean, efficient, and maintainable code","Continuously improve app performance and user experience"]},{"title":"Nice to have","content":["Experience with unit tests and automated testing frameworks","Experience writing automation tests"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/75003e94-1f34-4c57-8d4e-fc0611bcc691"
            }