            {
                "id": 429,
                "companyId": 6,
                "title": "Software Engineer 5 - Business and Legal Affairs",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Java","System Design","Server-side Development","Data Insights","Service-oriented Architecture","Communication Skills","Collaboration Skills"],
                "skills": ["Java","server-side development","object-oriented languages","data insights","system design","software development lifecycle","scalable applications"],
                "overview": "A highly creative and detail-oriented senior developer is sought to build enterprise-level web applications with a world-class user experience, understand user needs, and surface data insights.",
                "description": "Are you passionate about deeply understanding user needs, surfacing data insights, and building enterprise-level web applications and sites with a world-class user experience? Are you just as passionate about organizational health, investing in the growth of others and influencing product direction? Are you an expert in building super-performant and scalable Web applications and sites? Are you self-motivated with a passion for our business and for technology innovation? 

We are looking for a highly creative, detail-oriented senior developer. Our team is a diverse mix of talented engineers who work together building applications, core services, and systems on the Netflix Paved Path The ideal candidate will have a strong eye for system design, foster strong partnerships, and help drive product requirements. We are looking for someone who can address complex architectural problems with simple, intuitive design, and work at all phases of the software development lifecycle (planning, design, implementation, deployment, testing, and support). The candidate must be fluent in server-side development with Java or other object-oriented languages and have a proven track record of surfacing business-critical data insights. The ability to adapt to changing technology is an important strength.

Netflix is reinventing the way the world watches movies and television. Over 230 million members in over 190 countries already enjoy our award-winning content, but most of our growth still lies ahead. To support this, we continue to expand our content budget and are experiencing hyper-growth within our Studio User Interface team. Our team includes people of all genders, sexual orientation, mothers, fathers, the self-taught, the university-educated, and people of a wide variety of nationalities, ages, and socio-economic backgrounds. Diverse teams are strong teams, and we encourage those with varied identities, backgrounds, and experiences to apply.

",
                "extras": [{"title":"Opportunities  to make an impact","content":["Build systems that are intuitive, engaging, and surface business insights for our partners.","Empower our legal and business partners with innovative, workflow-based front ends that allow our partners to create and manage their campaign plans for all of Netflix’s titles.","Build scalable applications that enable our partners at Netflix to efficiently manage, measure, experiment, and learn about tactics that help unlock the effectiveness of our paid, owned, and earned media efforts.","Join a dream team of Engineers to drive innovation within the Content Lifecycle organization to champion product excellence."]},{"title":"What sets you apart","content":["Passion for building high-impact, flexible, elastic systems","Passion for surfacing data insights","Experienced ownership of ambiguous problems and finding elegant solutions","Solid understanding of service–oriented architecture and familiarity with microservices architecture","Independent, proactive, and able to deliver production-ready code with minimal guidance","Great communication and collaboration skills working cross-functionally with other engineers, product managers, and designers across the acquisition, finance, and business & legal space.","Influential thought partner, leveraging strategy memos, technical documentation, email, and virtual and in-person collaboration."]},{"title":"Why Netflix","content":["We’re bringing unique stories from around the world to a global audience at a scale never done before","You’ll work with other senior, high-performing engineers so you will be constantly learning and sharpening your skills","You’ll collaborate with product managers and designers, data scientists and algorithm experts, even content executives and content creators, to build exciting new features","We pay top of market with excellent benefits","Our culture is something we strive to constantly improve and practice daily","We have a lot of fun bringing wild ideas to life at Hack Day"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/dc99f671-04af-41fa-bca2-adba37a1b1b8"
            }