            {
                "id": 427,
                "companyId": 6,
                "title": "Software Engineer (L5) - TV Platform, Automation & Tooling Development",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 4,
                "salaryMin": 100000,
                "salaryMax": 700000,
                "salaryFormat": "per-year-salary",
                "salaryCurrency": "USD",
                "salaryBonus": "Unspecified",
                "tags": ["JavaScript/Typescript","React/Angular","Networking","Web Browser Technologies","TDD","Embedded Devices","Communication Skills"],
                "skills": ["JavaScript/Typescript","React/Angular","networking","web browser technologies","REST","WebSockets","SSE"],
                "overview": "",
                "description": "We’re part of the organization that develops and qualifies the tech for our flagship Netflix TV application; AKA the app that reinvented how people watch television! We work hand-in-glove with developers that implement bleeding-edge features on top of a hybrid C++/JavaScript (v8) stack which drives our Netflix UI and UX on TVs, streaming devices, and Gaming Consoles.

We’re looking for an enthusiastic engineer who takes pride in the work they do, has a test-to-break mentality, relishes in solving ambiguous problems, and has a strong desire to automate just about everything.

About Us
We’re a team of diverse engineers who’ve co-designed the automation infrastructure for TVs and help solve gnarly engineering challenges. We’ve recently redesigned our app architecture to unlock faster software updates on consumer electronic devices; something we’ve not ever attempted before in this space! This exciting change introduces new challenges and also plenty of opportunities for members on the team to learn and grow new skills.

Problems you will solve
You will architect scalable solutions for a wide range of problems such as designing services to support our new TV upgrade model, developing automated tests for features on consumer electronic devices, and improving dev tool ergonomics for a consistent engineering experience.
",
                "extras": [{"title":"This role is right for you if","content":["You have 4+ years of experience coding in JavaScript/Typescript. It’s beneficial if you have experience developing user interfaces using React/Angular, but not required.","You have a solid understanding of networking and web browser technologies (REST, WebSockets, SSE, pubsub, etc…), and apply TDD using testing frameworks (Chai, Mocha/Jest, etc…)","You are test-focused and embrace the idea of developing solutions to improve the lives of people around you.","You thrive by collaborating with multiple teams and use your communication skills to influence product direction.","You are eager to learn how web technologies are used and deployed on embedded devices like Smart TVs."]},{"title":"What makes us different","content":["Our freedom and responsibility culture is unique and we live by those values.","You will have a direct and lasting impact on our user experience which is used by tens of millions of people every day. When your friends and family ask you what you do for a living, you can point to Netflix running on their TV and say with pride “I make that possible.”","We pay top of market compensation. We want the best and brightest people and we will pay them accordingly.","At Netflix, we carefully consider a wide range of compensation factors to determine your personal top of market. We rely on market indicators to determine compensation and consider your specific job family, background, skills, and experience to get it right. These considerations can cause your compensation to vary and will also be dependent on your location."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/09e13dfc-1d54-4c0e-9b2a-20482e5d5871"
            }