            {
                "id": 498,
                "companyId": 6,
                "title": "Software Engineer Intern (Summer 2024)",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "The Software Engineer Intern (Summer 2024) position at Netflix involves working on scalable systems, solving challenging problems, and having a significant impact on software used by millions of people.",
                "description": "Who are we?

Netflix is the world's leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films, and mobile games across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen.

It’s no secret that we want to entertain the world. In order to do that we first must hire and develop the best people, starting with university students. 

If you have a passion for solving challenging problems; learning how to build scalable, robust systems; love working with the latest technologies in a fast-paced, flexible environment; and are excited at the prospect of having a significant impact on software that over 238 million people use and love, then we want to talk to you.

",
                "extras": [{"title":"Who are you?","content":["Current student pursuing a BS/BA or MS/MA in a technical field such as Computer Science, Engineering, Math, or Statistics — with an expected graduation date around December 2024 or Spring/Summer 2025","Candidates with significant relevant work experience may not be considered. While prior internships are okay, we may not consider candidates with multiple years of relevant work experience.","Excited about exploring new solutions and are willing to break things to learn","Make confident decisions that are well thought out and a willingness to share your ideas","Can work independently and are unafraid to seek out suggestions from other team members","Excited to work effectively in a collaborative environment","Clear communicator - you are concise and articulate in speech and writing","Passionate about Netflix’s mission to Entertain the World and believe you can thrive in our culture","Coursework or relative experience with data structures, algorithms, and debugging (bonus if you’ve completed at least one of these courses: Distributed Systems, Web Development, Mobile Development, Network or Application Security, Machine Learning or AI)","Fluent in any one of the following programming languages: C, Java, Kotlin, C++, C#, JavaScript, TypeScript, Python, Ruby, Go, or Rust","If you’re fluent in another modern programming language that you don't see here, please still consider applying. If your programming skills and CS fundamentals are strong, we’re happy to support you learning a language more widely used within Netflix"]},{"title":"What could you learn?","content":["Building applications that solve complex business problems elegantly","Scalable system design and architecture process","Writing high-quality, performant, and industry-standard code","Working closely with business stakeholders in a fast-paced environment","Building UIs that are intuitive, engaging, and surface business insights for our partners"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/c92c92a6-90a5-4a5f-a2b8-0cceccf1b174"
            }