            {
                "id": 438,
                "companyId": 6,
                "title": "Solutions Software Engineer 4",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 2,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Solutions Software Engineer","data ingest","workflow automations","third party integrations","full-stack development","Node.js","Java"],
                "skills": ["Node.js","Python","Java","React","API integrations","GraphQL","REST","gRPC","database models","SQL"],
                "overview": "This Solutions Software Engineer 4 position at Netflix Studio Tech Solutions (STS) in Los Angeles focuses on developing short-term solutions to increase operational efficiency within the content promotion and distribution area of Netflix Studio business, including data ingest and export, workflow automations, and third-party integrations.",
                "description": "About Netflix

It’s an amazing time to be joining Netflix as we continue to transform entertainment on our mission to entertain the world! To achieve this, we are building a technology-powered studio for global production, distribution and delivery of compelling content to over 220 million members in 190 countries in more than 30 languages. We are also expanding into new forms of entertainment such as gaming. 

About Studio Tech Solutions (STS)

For Netflix Studio to continue to scale and produce quality content, the Studio business teams work closely with product partners to innovate and develop technical solutions that support the entire content life cycle - planning, programming, producing, distributing and promoting content on a global scale. These solutions include internal enterprise applications that support critical functions, as well as short-term technical solutions that increase operational efficiency at the business user level on a smaller, rapidly iterative scale. STS works directly with business stakeholders, product partners and engineering colleagues to deliver these short-term solutions. The team's goal is to translate business challenges and opportunities for operational improvement into focused, nimble and highly impactful solutions as an integral part of the Netflix Studio product ecosystem.

About the Role

As a Solutions Software Engineer (L4) on the STS team, you'll be a part of a co-located team working out of the Los Angeles office. You'll use a broad set of internal and third-party technology and tools to contribute to impactful short-term solutions that increase operational efficiency within the content promotion and distribution area of the Netflix Studio business. Your key areas of focus will be data ingest and export, development of workflow automations and prototypes, and third party integrations.  

",
                "extras": [{"title":"Your effectiveness in this role will be related to:","content":["Your ability to learn quickly and switch contexts productively in a highly collaborative development environment.","Your ability to communicate effectively and work directly with business end users, product partners and engineering colleagues.","Your willingness to ask questions and seek information to gain business and technical context to drive results."]},{"title":"You belong in this team if:","content":["You are passionate about solving problems and love every aspect of the full-stack software development life cycle.","You understand the importance of seeking in-depth and broad context to build an effective solution.","You enjoy building prototypes and short-term solutions to help improve and empower users to innovate on business workflows.","You are comfortable contributing to solutions at all technical levels, from scripting to building a custom application.","You are able to pivot and iterate quickly on solutions and share learnings with partnering teams in a cross-functional environment.","You are highly collaborative and enjoy building strong internal and cross-functional partnerships.","You have a passion for learning and professional growth."]},{"title":"Qualifications:","content":["2+ years of experience in full-stack development.","Comfortable working with: Node.js, Python or Java.","React or similar front-end frameworks.","Experience with API integrations (GraphQL, REST and/or gRPC).","Keen understanding of database models and SQL."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/19870fc1-4739-494e-b95d-f7c7f193ec83"
            }