            {
                "id": 440,
                "companyId": 6,
                "title": "Sound Technologist - Korea",
                "location": ["Seoul, South Korea"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 8,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Sound Editing","Sound Mixing","Dubbing/Localization","Motion Picture Sound Practices","Filmmakers","Directors","Show-runners","Editors","Producers","Recordists","Mixers","Sound Supervisors","Archivists","Network Executives","Studio Executives","Technical Atmos Evangelist","5.1 Surround Mixing","Theatrical Mixing","Near Field Mixing","Audio Workflows","Audio Deliverable Creations","Loudness Specifications","Industry Standards","Audio Distribution Formats","Consumer Technology","Bilingual Language Skills","English Fluency","Korean Fluency","Pro Tools","Dolby Atmos","Communication Skills","Education","Passion for Movies","Passion for TV Shows","Technical Guidance","Netflix Technical Specifications","Production Best Practices","Industry Outreach","Advocacy for Innovation","Local Production Practices","Documentation","Educating Creative Partners","Vendor Preparation","Production and Post Production Tools","Audio, Video, and Streaming Technology","Representation at Industry Functions"],
                "skills": ["sound editing","mixing","dubbing/localization","motion picture sound practices","filmmakers","directors","show-runners","editors","producers","recordists","mixers","sound supervisors","archivists","network or studio executives","standards","new technologies","on-set sound","post-production sound","5.1 surround mixing","theatrical mixing","near field mixing","Atmos","audio workflows","M&E tracks","loudness specifications","audio distribution formats","Pro Tools","Dolby Atmos","technical concepts","internal and external education","movies","TV shows","technical guidance","technical specifications","production best practices","industry outreach","documentation","creative partners","vendors","production and post production tools","audio, video, and streaming technology","industry functions","conferences","committee meetings"],
                "overview": "The Sound Technologist - Korea position at Netflix involves providing technical guidance to productions, educating teams on technical specifications and best practices, advocating for innovation in production technologies, reporting on local production practices, contributing to documentation and resources, advising local vendors, staying up-to-date on production and post-production tools and technology, and representing the Netflix Production Technology team at industry events.",
                "description": "Netflix is the leading provider of streaming video, a lot of its original content: features, shorts, series, documentaries, comedy specials and unscripted content. Optimizing content quality and longevity without compromising efficiency across all types of projects presents significant challenges, but that’s what the Production Technology team does by setting technical requirements and best practices, driving new industry standards, consulting on the studio’s technical infrastructure, providing direct support to Netflix productions and staying up-to-date with the most advanced developments in professional and consumer technology. 

As Netflix produces more and more programming around the world, leveraging new video and audio technology, we are scaling to support the needs of diverse creative teams. As part of the Production Technology team, you will help guide audio specifications, technology and best practices for Netflix productions, from capture through post-production and distribution.

The Production Technology Team

Our technologists aim to provide technical guidance based on Netflix specifications and best practices, in order to support the creative filmmaking process and achieve the highest quality content for our consumers.  From on-set through final delivery, our team advises and consults with productions, including crews as well as internal production, post production, distribution, marketing, and development teams. We not only offer expertise but we research and explore opportunities for innovation in key areas of motion picture production and post-production for both sound and imaging!
 
About You

You are an expert in the fields of sound editing, mixing and maybe even dubbing/localization. You understand current motion picture sound practices and tools, and how we've arrived at them as technology and creative demands have evolved. You have worked with filmmakers, directors, show-runners, editors, producers, recordists, mixers, sound supervisors, archivists, network or studio executives, and you understand their goals and challenges. You've kept abreast of developing standards and new technologies that are shaping the way soundscapes are created and reproduced for consumers, and have ideas about how to ensure their longevity. You’re comfortable interacting with the sound community and are able to easily explain technical concepts to non-technical audiences.

This region brings unique challenges. The ideal candidate should comprehensively understand the workflow for both on-set and post-production sound in film and TV productions, be an expert in 5.1 surround mixing, understand the difference between theatrical and near field mixing, and be a technical Atmos evangelist, to support the region as it gears up for the new format.
",
                "extras": [{"title":"Qualifications:","content":["Strong customer orientation and helpful & collaborative demeanor","8+ years of film and/or television sound experience in a technical capacity, interacting with creatives and operators","Understanding of a variety of audio workflows and practices across different types of content","Understanding of the audio deliverable creations including M&E tracks","Detailed understanding of loudness specifications for audio distribution","Knowledge of industry standards and the bodies that ratify them","Knowledge of audio distribution formats and consumer technology","Bilingual language skills is a must - English and Korean fluency","Mastery of Pro Tools (additional knowledge of Dolby Atmos is plus)","The communication skills to clearly articulate and document technical concepts and explain how they impact the creative process","Willingness and aptitude to educate both internal and external entities with varying degrees of knowledge in your area of expertise","A passion for movies and TV shows"]},{"title":"As part of the Production Technology team, you will:","content":["Provide technical guidance to Netflix productions","Educate various internal and external teams on Netflix technical specifications and production best practices","Plan and/or participate in industry outreach and education and be an advocate for innovation in production technologies","Report local production practices, challenges and opportunities","Contribute towards documentation and other resources to educate creative partners and vendors about our requirements and initiatives","Advise local vendors in preparing to service Netflix productions","Maintain currency on production and post production tools, technology and software.","Maintain currency on Audio, Video and Streaming technology","Represent the Netflix Production Technology team at industry functions, conferences, committee meetings, etc"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/de59092b-315d-41c6-8ee6-81651e6721d7"
            }