            {
                "id": 442,
                "companyId": 6,
                "title": "Specialist, Music Services",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": ["music clearance","licensing","custom music creation","music licensing","library music","sound design","cue sheets"],
                "overview": "",
                "description": "Netflix is the world's leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.

The Netflix Music Services team is hiring a Specialist to facilitate music clearance, creative resourcing, licensing, and custom music creation for Netflix’s Music Services Team which supports the Marcomms group.

Our Marketing and PR campaigns are a key part of Netflix’s ongoing success, and music is core to those campaigns. Supporting the music services team and helping with the nitty-gritty of finding and licensing music for use in trailers, promos, and a variety of other projects, the candidate will also work to support the marcomms group, and cross-functionally with other music teams at Netflix. 

The successful candidate easily embeds into new teams and has a foundation in music licensing for entertainment or advertising. They can build internal relationships and keep forward momentum in the fast-moving world of marketing and PR are paramount.  

The successful candidate loves everything about music. They spend their free time exploring the ecosystems of music for the next great artists and studying musicology.  They think having several different licenses (synch, master, mechanical, etc.) for the same work makes complete sense and don’t think twice about a 7-way split ownership for “a side” of a song. They think about how best to source, track, and organize everything that goes into the workflow of fixing music to picture.

The successful candidate will be someone who loves working in a self-starting environment where freedom and responsibility are tenets, and passion, innovation and curiosity are mandates. They will have incredible soft skills to complement their diligent work ethic. They seek an environment that places thoughtful efficiency over process yet they know how to work with organizations or institutions that may not hold the same beliefs.  

This role is based in Los Angeles, and reports to the Senior Manager of Films on the Music Services team, and will be part of the larger music group at Netflix.

",
                "extras": [{"title":"Responsibilities:","content":["Coordinating with Netflix’s internal cross-functional stakeholders as well as outside parties including labels, publishers, copyright owners, composers, their managers and/or attorneys, regarding ownership, invoicing and license tracking.","Researching music ownership and seeking/obtaining quotes from music libraries.","Building and maintaining strong relationships with internal partners and third-party companies, labels, artists, studios, and publishers.","Managing Netflix marcomms music clearance and rights information including tracking territory, media and terms and maintaining/tracking all cue sheets.","Helping source music and contribute music ideas for given creative briefs, as required.","Assisting with soundtrack releases by routing materials for approval and tracking deadlines.","Participating in other music projects specific to Netflix’s marketing needs."]},{"title":"Requirements:","content":["The successful candidate will have at least 3+ years of music licensing experience at a major production, film/television studio, television network, agency, publisher, label, clearance house, or law firm in the music department.","Understands the fundamentals of music licensing.","Experience clearing library music and sound design, preferred if there’s experience working with major labels and publishers.","Ability to conduct rights ownership research.","Experience reading and filling out cue sheets.","Tracking licenses from receipt to final execution.","Administering music deals and the appropriate contracts, licenses, and invoices.","Curiosity and innovation as a style of approaching problems.","Attention to detail and understanding of the critical nature of clean data as it pertains to music rights.","Clear, concise communication skills.","Ability to distill salient points and frame and present issues succinctly.","Ability to work proactively, independently and reliably on multiple projects under tight time frames in a fast-paced production environment.","Ability to pivot quickly, think practically, and be solutions-oriented."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/ebb35d6a-1c09-4685-8959-62c7891862ae"
            }