            {
                "id": 444,
                "companyId": 6,
                "title": "Specialist, Security & Intelligence - Production",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Security & Intelligence","Production","Risk Assessments","Security Plans","Law Enforcement","Emergency Response","Security Events"],
                "skills": ["security","intelligence","production","risk assessments","security plans","law enforcement","emergency response"],
                "overview": "The Specialist, Security & Intelligence - Production role at Netflix is responsible for delivering tactical-level results on the design and implementation of security and response programs for productions, assessing risks to an evolving production strategy, and developing effective business relationships with law enforcement and security networks. They should have 3-5 years of relevant experience, advanced degree preferred, and the ability to interpret regional security signals, communicate analysis to stakeholders, and travel internationally as required.",
                "description": "Netflix is the world's leading internet entertainment service with more than 222 million paid memberships in over 190 countries enjoying series, documentaries, and feature films across a wide variety of genres and languages. Visit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team.

The Security & Intelligence Team supports our studio functions globally. This Los Angeles-based role will report to the Senior Manager, Security & Intelligence - Production. Partnering with Physical Production, Content Security, Post Production, Business and Legal Affairs, and Content, the role will be instrumental in assessing risks to an evolving production strategy in a dynamic and exciting UCAN region.

",
                "extras": [{"title":"Responsibilities:","content":["Deliver tactical-level results on the design and implementation of security and response programs for productions","Develop/review risk assessments, design security plans, and coordinate local support for our productions in alignment with relevant internal and external stakeholders","Develop/share specialized guidance for higher-risk production activities and in higher-risk locations","Develop and maintain effective business relationships with Local/State/Federal law enforcement, emergency response, and trusted security networks","Utilize analysis of dynamic global and local security events to keep productions secure and resilient","Support wider team on specialized projects as needed"]},{"title":"Qualifications:","content":["3 - 5 years of relevant experience, which can include security, intelligence, military, media production, or NGO","Advanced degree in relevant subject matter preferred","Experience with production, talent, and vendor relations","Must be business fluent in English; additional language proficiency a plus"]},{"title":"Ability to:","content":["Interpret regional security signals and data, and conduct risk assessments","Maintain an awareness of risk trends affecting the regional entertainment sector","Communicate relevant analysis and forecasting to key stakeholders","Interact with a wide range of internal and external stakeholders","Travel regionally (approximately 25%-50%) internationally as required"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/ff9e8858-948c-4fb0-921b-284b9439b018"
            }