            {
                "id": 449,
                "companyId": 6,
                "title": "Sr. Treasury Analyst",
                "location": ["Los Gatos, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Treasury Analyst","Financial Risk Management","Foreign Exchange","Hedging","Financial Markets","Analytics","Trade Execution"],
                "skills": ["Treasury Management","Foreign Exchange Risk Management","Analytics","Models","Financial Markets","Accounting","Compliance"],
                "overview": "The Sr. Treasury Analyst position at Netflix is responsible for managing the company's capital structure, financial risk, and cash and banking activities, and supporting the development and execution of the foreign exchange risk management program.",
                "description": "Netflix is the world’s leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films, and mobile games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.

Netflix’s Corporate Treasury team is responsible for managing the company’s capital structure, financial risk, and cash and banking activities, including our 15-billion dollar debt portfolio, a multi-billion dollar foreign currency hedging program, and over 5 billion dollars in cash and short-term investments.  

We are seeking an experienced candidate to become an integral part of our treasury team. The selected individual will play a pivotal role in supporting the development and execution of our foreign exchange risk management program, and contribute to other initiatives across the Treasury organization on an ad-hoc basis. The ideal candidate for this role is someone who is savvy or has a keen interest in financial markets, can drive both operational and strategic solutions in collaboration with cross-functional partners, is diligent in managing and analyzing high-value information, is adept at communicating complex financial concepts effectively, and can foster strong relationships across internal partners.   
  
This position can be based in either of our California office locations (Los Gatos or Los Angeles) and reports to the Treasury Manager.

It's an amazing time to join Netflix as we continue shaping the future of global entertainment, bringing new stories to millions of people worldwide.  Visit our culture memo and long-term view to learn more.

",
                "extras": [{"title":"Responsibilities","content":["Collaborate closely with the extended Treasury Team, Financial Planning & Analysis, Production Finance, Technical Accounting, IT Operations, Data Science & Engineering, Tax, and Legal teams to generate accurate forecasting data & associated analytics.","Develop and prepare FX management reports and hedging performance metrics, providing key stakeholders across Netflix with valuable insights.","Prepare trades in accordance with our hedge strategies and ensure completion of trade workflow. Ability to grow into trade execution.","Develop and maintain internal models to assess the cost of execution, VaR (Value at Risk), and the impact of different hedging strategies and instruments.","Gain an in-depth understanding of Netflix's various foreign currency revenue and expense streams and their implications on free cash flow, the income statement, and the balance sheet.","Conduct rigorous quantitative and qualitative analysis of global financial markets and trends concerning our FX and interest rate exposure.","Support additional Treasury projects and provide thought leadership backed by analysis. Cross-train on your areas of expertise.","Liaise with the Accounting team to perform month and quarter-end close activities related to foreign exchange.","Ensure compliance activities are performed according to Netflix’s policies and internal control environment; support internal and external audits."]},{"title":"Key Qualifications Required:","content":["5+ years experience in corporate treasury, or related experience in banking or fintech","Bachelor’s/Master's in business, finance, mathematics, or related discipline","Familiarity with statistical language & BI software","Keen interest in global markets and different asset classes","Ability to apply accounting concepts around day-to-day tasks","Experience maintaining and developing models and large datasets","Meticulous approach to problem-solving while possessing strong analytical, decision-making, and communication skills"]},{"title":"Key Qualifications Preferred:","content":["CFA or similar certification","Experience/theoretical understanding of derivatives and corporate finance principles","Prior experience using Bloomberg and some familiarity of trade execution platforms","Basic familiarity with Hedge accounting (ASC-815)"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/c37d754b-d041-4ea4-9ff7-a7a49f9524b4"
            }