            {
                "id": 446,
                "companyId": 6,
                "title": "Sr. Environment Artist (Blue)",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 6,
                "salaryMin": 100000,
                "salaryMax": 3000000,
                "salaryFormat": "per-year-salary",
                "salaryCurrency": "USD",
                "salaryBonus": "Unspecified",
                "tags": ["3D Environments","AAA Game","Asset Creation","Mentoring","Workflow Documentation","Unreal Engine","Portfolio"],
                "skills": [""],
                "overview": "A creative and highly-skilled Senior Environment Artist is sought to help define overall quality and construct 3D environments for a brand-new AAA multi-platform game, in collaboration with the Art Director and Environment Lead, establishing workflows and best practices while mentoring and supporting other artists on the team.",
                "description": "We’re looking for a creative and highly-skilled Senior Environment Artist to help us forge the creative vision on a brand-new AAA multi-platform (PC, mobile, etc.) game. This is a unique opportunity to be at the heart of crafting and bringing to life worlds for one of Netflix’s first generation of internally developed original games.

As Senior Environment Artist, you will help us define overall quality and construct 3D environments to deliver consistent, high-quality environmental assets and locations. The ideal candidate is a well organized artist with a strong, hands-on background with a devotion for sharing and mentoring. This role will involve producing striking, high quality and optimized AAA environments. 

We're building the foundation for a small, but ambitious, team of creators who’s primary goal is to create a game experience that our players want to repeatedly come back to; and as our Senior Environment Artist, you will be able to create, ship, and run a game without any competing design constraints due to monetization.

Quality is something that we are immensely proud to be aiming for, and we are looking at putting the right team together to help take us forward. We’re looking for that group of artists who are aligned with our core values, and care deeply about the experiences they create as well as the people they make them with.  Those who bias towards action and are energized by the learning that comes with bold experimentation at an agile pace. As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. 

Now is an amazing time to join Netflix as we seek to entertain the world. We have over 200 million paid members in over 190 countries, and we won’t stop there

",
                "extras": [{"title":"Responsibilities:","content":["Work closely with the Art Director and Environment Lead to help define the look of our game as well as establish and document workflows and best practices.","Create 3D assets, materials and textures of the highest quality and maintain content throughout the entire development process.","Collaborate with other Environment Artists and Level Designers to craft compelling spaces and support them through all phases of development.","Breakdown environment tasks, create asset briefs and help support both internal and external artists.","Help mentor and support other artists on the team and instill best practices."]},{"title":"Required Qualifications:","content":["Minimum 6 or more years of professional experience in computer-generated art for games or entertainment with a minimum of 3 years as a Senior Environment Artist or Senior World Builder.","Shipped at least one AAA game."]},{"title":"Preferred Qualifications:","content":["A portfolio with examples of environment asset creation and/or world building.","Experience building environments from initial blackout to final polish/ship.","Ability to efficiently model, sculpt and texture both organic and hard surface assets to a high degree of quality.","Ability to create assets for a range of art direction styles, from photo-realistic to stylized.","Expert knowledge of Maya (or similar 3D modeling software), Photoshop, Zbrush, and Substance Painter.","A strong understanding of world building workflows, technical constraints and asset creation using Unreal Engine (or similar game engine).","Experience with material creation and PBR workflows.","A strong understanding of scene composition, scale/proportion and lighting.","Excellent communication skills and enjoy collaborating with other team members and departments.","A strong work ethic, are self-motivated, organized and work well with deadlines."]},{"title":"Additional and Bonus Skills:","content":["Experience procedural world building methods & techniques (PCG, Houdini or other).","Experience with creating real time vegetation/foliage assets using SpeedTree (or similar software).","Technical Art background, knowledge of advanced Unreal Engine material creation, blueprints, Python/MEL scripting and creating efficient environment/world building workflows & tools.","Experience lighting environments in Unreal Engine.","Environment concepting skills.","Passion for gaming."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/f20f3b1c-402e-4aac-a165-d981a7536db1"
            }