            {
                "id": 445,
                "companyId": 6,
                "title": "Sr. Concept Artist (Blue)",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 100000,
                "salaryMax": 300000,
                "salaryFormat": "per-year-salary",
                "salaryCurrency": "USD",
                "salaryBonus": "Unspecified",
                "tags": ["Concept Artist","AAA PC game","Creative Vision","Character Concepts","Environment Concepts","Game Design","Visual Style"],
                "skills": [""],
                "overview": "",
                "description": "We’re looking for a creative and highly-skilled Senior Concept Artist to help us forge the creative vision on a brand-new AAA PC game. This is a unique opportunity to be at the heart of crafting and bringing to life worlds for one of Netflix’s first generation of internally developed original games.

As Senior Concept Artist, you will have a meaningful role to play in shaping and directing the world that we are creating. The ideal candidate is a well organized leader with a strong, hands-on background with a devotion for sharing and mentoring. You’ll be responsible for generating a variety of industry leading AAA character and environment concepts, as well as help with game design elements for the project. You’ll work with the development teams to create environments along with unique and compelling characters that exude personality and help push the visual style.

We're building the foundation for a small, but ambitious, team of creators who’s primary goal is to create a game experience that our players want to repeatedly come back to; and as our Senior Concept Artist, you will be able to create, ship, and help run a game without any competing design constraints due to monetization

Quality is something that we are immensely proud to be aiming for, and we are looking at putting the right team together to help take us forward. We’re looking for that group of leaders who are aligned with our core values, and care deeply about the experiences they create as well as the people they make them with.  Those who bias towards action and are energized by the learning that comes with bold experimentation at an agile pace. As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. 

Now is an amazing time to join Netflix as we seek to entertain the world. We have over 200 million paid members in over 190 countries, and we won’t stop there

",
                "extras": [{"title":"Responsibilities Include","content":["Be the artistic leader and take ownership for delivering high quality, distinction, and style for our environments.","Works closely with the Art Director and Lead Concept Artist to help drive the art style and evolve the vision of the project","Collaborate with the art team to implement and maintain the creative vision for the game","Develop the world that is worthy of a Netflix film/TV series","Design characters, props, production callouts, system interacts, high vision concept art, color scripts, marketing material and other visual guides and tasks as needed to assist the development team","Develop and maintain strong creative and collaborative partnerships across subject areas to help further develop the game","Proactively contribute to drive the department and studio to the forefront of pioneering Games development"]},{"title":"The Ideal Candidate","content":["Minimum 10+ years of relevant experience with 3+ years of it being in a senior artist role.","Experienced in working with external outsource vendors (OS)","Has an excellent understanding of art pipelines, dependencies, and overall scope of the project","Strong communication skills and understanding of various art disciplines (animation, character, environment, VFX)","Experience designing detailed, modern and forward looking characters.","The ability to storyboard and help conceptualize character movement and VFX","You can arbitrate sensitively between creative desires and production requirements.","Excellent foundations skills, including composition, design, and color theory and advanced knowledge of human and animal anatomy.","Ability to design for a range of art directions, from photo realistic to stylized.","Strong ideation, brainstorming and documentation skills","Ability to find creative solutions for technically challenging tasks."]},{"title":"Additional and Bonus Skills:","content":["Good communication, organizational, and interpersonal skills","Experience with Zbrush and Maya","Experience with Epic's Unreal Engine","VFX concept experience","Passion for gaming","A passion and understanding of world building","Strong portfolio that demonstrates a range of 2D and 3D concepts"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/e970276a-dd2e-421e-85af-3f9edb02cbcf"
            }