            {
                "id": 447,
                "companyId": 6,
                "title": "Sr. Manager, Ads SP&A, Pricing & Yield",
                "location": ["New York, New York"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 9,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Ads","SP&A","Pricing & Yield","Sales","Account Management","Pricing & Packaging","GTM Pricing & Packaging","Negotiated Ratecards","Terms and Conditions","Ads FS&A","MSFT Deal Desk","Data-driven Insights","Revenue Accounting","Pricing Integrity","Pricing & Planning","Yield Management","Advertising Strategy","Modeling Skills","Large Datasets","Excel","Google Sheets","Tableau","Attention to Detail","Problem-solving","Project Management","Organizational Skills","Communication Skills","Interpersonal Skills","Financial Calculations","Programmatic Advertising","Auction Dynamics","Ad Tech","Streaming Ecosystem"],
                "skills": ["Pricing & Yield Management","Excel","Google Sheets","Tableau","Data visualization tools","Project management","Communication skills"],
                "overview": "The Sr. Manager, Ads SP&A, Pricing & Yield position at Netflix requires a leader with expertise in pricing, planning, yield management, and advertising strategy, who will be responsible for supporting sales, implementing ratecards, defining pricing requirements for new ad products, partnering with internal teams, optimizing targeting strategies, resolving pricing gaps, and ensuring pricing integrity. The position requires 9+ years of experience, strong modeling and data manipulation skills, attention to detail, project management capabilities, excellent communication, and familiarity with programmatic advertising and the streaming ecosystem is a plus.",
                "description": "It's an exciting time to join Netflix as we continue to transform entertainment globally. We bring entertainment to over 230 million subscribers in over 190 countries. This requires great content, a frictionless choosing experience and engaging conversation.  As we continue to grow, we’re increasingly focusing on Commerce as well.  We have ambitious plans, an enormous scale of opportunity and the passion to be the best in customer experience - which now includes a new ad-supported plan at a more affordable price point for customers. 

As our Ads program scales, we’re building out a team that will help steward and support our go-to-market strategy, specializing in Pricing & Yield. 

We are seeking a selfless, curious, and passionate leader to join our Ad Sales Finance, Strategy & Analysis team and lead this function. You will have the opportunity to learn and grow quickly in this space, working closely with a highly cross-functional and global team, and contribute to one of the most impactful transitions we’ll have made in a decade.  

Visit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team. The position reports to the Director of Ads FS&A and could be based in New York, Los Angeles or Los Gatos.

",
                "extras": [{"title":"Responsibilities will include:","content":["Support Sales and Account Management as the first line of defense in addressing pricing & packaging inquiries, as well as exceptions that deviate from business protocol","Create, manage and implement negotiated ratecards and ensure adherence to terms and conditions","Define GTM pricing & packaging requirements for new ad products, targeting capabilities and/or sponsorships","Partner with Ads FS&A leaders across regions to customize market-level strategy and consolidate outcomes into a cohesive macro view of the Ads business.","Partner with MSFT deal desk team on deal approvals to ensure effective pricing and adherence to business rules","Optimize our targeting GTM strategies based on data-driven insights of our targeted inventory pools alongside advertiser buying behavior","Supply marketplace feedback to support FS&A internal valuations of new product offerings, targeting capabilities and/or sponsorships","Collaborate with Revenue Accounting to ensure pricing is compliant with corporate policy and minimizes billing discrepancies","Steward internal & marketplace feedback to resolve pricing/packaging gaps, roadblocks or opportunities","Establish pricing integrity across all ways Netflix can be bought and sold"]},{"title":"What we’re looking for:","content":["9+ years of experience in Pricing & Planning, Yield Management and/or Advertising Strategy","Strong modeling skills and comfort with manipulating large datasets in Excel, Google Sheets, Tableau, and other data visualization tools","A strong attention to detail and eye towards using the 80/20 rule to address problems","Candidates must be motivated, disciplined, flexible, able to work autonomously, and perform tasks with a wide range of difficulties","Very strong project management, planning and organizational skills, including the ability to handle multiple projects simultaneously and to deliver under tight timelines","Excellent communication and interpersonal skills, with proven ability to build successful relationships and partners at all levels","The ability to communicate financial calculations with varying degrees of detail depending on the forum. You know your audience and what they’re looking for.","Familiarity with programmatic advertising, auction dynamics, ad tech and the streaming ecosystem is a plus (though not required)"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/3c58b823-71d6-4e65-b0a2-ea68219c5775"
            }