            {
                "id": 452,
                "companyId": 6,
                "title": "Strategist, Ads Policy",
                "location": ["Los Angeles, California"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Ads Policy","Advertising Standards","Functional Expert","Operational Strategist","Project Management","Global Player","Content Moderation","Policy/Legal Operations","Trust & Safety","Communication Skills","Cross-Functional Skills"],
                "skills": ["Content Moderation","Policy/Legal Operations","Trust & Safety","Technology sector","Online and brand safety","Communication","Cross-functional skills"],
                "overview": "The Ads Policy team at Netflix sets advertising standards to protect the member's experience and works with various teams to deliver ads that drive great outcomes for advertisers. They are looking for an Ads Policy team member who can develop and deploy ads policies, improve operational strategies, and advocate for the specific needs of Ads Policy globally. The ideal candidate should have functional expertise in content moderation, policy/legal operations, and strong communication skills.",
                "description": "Netflix is the world's leading streaming entertainment service with 238 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen.

We recently launched a new ad-supported tier to offer our members with more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point, while also creating a compelling path for advertisers to reach audiences that are deeply immersed. 

Our Team 

The Ads Policy Team is a part of Advertising Legal & Policy Team and sets advertising standards to protect the experience of our members and business partners. We work with a variety of teams from Advertising, Product Management, Engineering, Legal, Public Policy, and Strategic Planning and Analysis to set policies in a scalable way and deliver ads in a manner that’s thoughtful of our member’s viewing experience and drives great outcomes for advertisers. Ads Policy Team members are motivated to find innovative solutions, and use technical know-how, user insights and proactive communication to pursue the highest possible quality and safety standards for members and advertisers.

On this new team, you're a big-picture and strategic thinker. You understand the member's point of view and are passionate about using your combined technical, sales and customer service acumen to deliver high impact to our business by monetizing our incredible slate of content. 

We are looking for an Ads Policy team member who is excited to join us on this journey.
",
                "extras": [{"title":"Key Responsibilities","content":["Functional Expert. Develop and deploy ads policy and enforcement across a functional area (e.g., dating, alcohol, high fat, salt, sugar food and beverages). Counsel ads sales on questions that arise based on those policies.","Operational Strategist & Project Management. Proactively identify opportunities to improve how we advise, align, finalize, and enforce ads policies at Netflix. Support issue escalation and resolution from advertisers, ad sales, and members.","Global & Regional Player. Ability to be an advocate for the specific needs of Ads Policy bringing a global lens, striking a balance between scalability, localization, and highly nuanced sensitivities and cultural perspectives to drive meaningful ads policies for Netflix, our members and advertisers."]},{"title":"Experience & Skills","content":["Functional expertise in Content Moderation, Policy/Legal Operations, Trust & Safety","Policy experience with knowledge of the technology sector and the key policy issues affecting the internet like online and brand safety.","Experience managing and scaling a high volume of content across multiple verticals and countries and/or running multiple, simultaneous and complex policy projects from inception through to completion.","Strong communication and cross-functional skills, with the ability to engage, listen, and collaborate with internal departments/teams to align from strategy through execution and translate complex issues into simple, clear language.","Have experience collaborating closely with advertisers, legal, and sales teams.","You thrive in a fast-paced environment, possess a high level of intellectual curiosity, and have a goal-oriented entrepreneurial mindset, driven to succeed and always up for a challenge!"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/e8059dcd-feb6-45a6-aff0-f833f5bcfd4d"
            }