            {
                "id": 453,
                "companyId": 6,
                "title": "Studio Admin & Services Specialist - UK",
                "location": ["London, United Kingdom"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Operational Accounting","Financial Management","Budget Monitoring","Vendor Contract Management","Data Analysis","Stakeholder Management","Microsoft Excel"],
                "skills": ["account reconciliation","general ledger accounting","accounts receivable","accounts payable","UK GAAP","Studio Facilities Operations","Google Docs","Sheets","Gmail","MS Word","MS Excel","English"],
                "overview": "The Studio Admin & Services Specialist - UK position at Netflix involves being the main point of contact for operational accounting at the UK / EMEA studio locations, managing financials, budgeting, vendor contracts, and providing operational input.",
                "description": "Netflix is one of the world's leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.

THE ROLE

Reporting to the Studio Projects Manager, you will be the main point of contact with regards to all operational accounting for our UK / EMEA studio locations.

As the Studio Admin & Services Specialist you will work across multiple studio sites, maintaining a record of all operational financials, levels of spend against our operating budget (both fixed and variable costs), whilst aligning with our Studio Finance Business Partner on any reporting and analysis.

In conjunction with these financial accountabilities, you will have an oversight of all studio project work and operational vendor contracts, so having the ability to prioritise and manage multiple tasks simultaneously is a must.

",
                "extras": [{"title":"KEY RESPONSIBILITIES","content":["Main point of contact for our cross functional partners in relation to Studio related POs, invoice monitoring, ancillary billing, energy & utility management, etc.","Assist in collating our Studio Opex and Capex budgets in conjunction with site based colleagues through data collection and YoY analysis, for a streamlined approach.","Maintain strong communication with team members in order to capture all financial tracking information, anticipated invoices, production recharges, etc.","Advise Managers of any abnormal or unexpected spend and query with vendors as required.","Conduct trend analysis on high level financials to provide operational level reporting.","Provide operational input on expenditure for collating studio rate cards year on year.","Enter data for all rechargeable ancillary billing onto Xytech, allowing for the relevant colleagues to approve.","Manage our internal Meter Online portal for recharging and trend analysis purposes, as well as tracking any incorrect meter readings.","Maintain records of utility information for all studios in relation to gas, water and electricity.","Support the procurement of any studio MSAs and utility contracts, through data analysis and historical trends.","Collate relevant documentation and company information in order to upload new vendors onto our internal system for future billing.","Awareness and support for all studio related projects, associated targets and aid in the delivery as and when required."]},{"title":"SKILLS & EXPERIENCE","content":["Financial background with regards to account reconciliation, general ledger accounting, accounts receivable, accounts payable, etc.","Knowledge of UK GAAP (Generally Accepted Accounting Principles) regulations.","Proven experience working within a Studio Facilities Operations environment.","Strong communication and stakeholder management skills. Experience dealing with landlords, 3rd party providers (e.g. utility companies, vendors, etc.) is a plus.","Strong administrative and organisational skills in a fast moving environment.","Proficiency in Google Docs, Sheets, GMail, MS Word and MS Excel.","Fluency in English is a must. Spanish is a bonus."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/ace3f2ff-9e46-492d-a3ef-ae80018851c8"
            }