            {
                "id": 464,
                "companyId": 6,
                "title": "Systems Engineer, L5, Corporate Systems Engineering",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 2,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Linux Systems Administration","API Automation","Scalable System Design","Programming Languages","AWS Infrastructure Management","SDLC","JIRA/Confluence Support"],
                "skills": ["Linux systems administration","API automation","Scalable system design","Ruby","Python","AWS","SDLC"],
                "overview": "The Systems Engineer, L5, in Corporate Systems Engineering at Netflix focuses on improving the employee experience, collaboration, and productivity by providing issue tracking and documentation solutions through Jira and Confluence.",
                "description": "At Netflix, we are shaping the future of global entertainment, bringing moments of joy to 200+ million customers. The Netflix Systems Engineering (CoSE) team at Netflix focuses on improving the employee experience, collaboration, and productivity of our global employees and support teams. As a centralized engineering team responsible for helping Netflix employees with how they work, we aim to remove friction, simplify workflows by increasing automation, and provide technical solutions so they can focus on bringing engaging stories to our members all over the world. This role will focus on providing issue tracking and documentation solutions to Netflix employees through Jira and Confluence. 
",
                "extras": [{"title":"Must Have:","content":["Experience administering Linux systems in a production environment","Working knowledge utilizing APIs for automation of work","Strong background in designing scalable, reliable, and efficient systems. Including understanding trade-offs in system design, design for fault tolerance and recovery, and knowledge of best practices in distributed systems.","Know one or more general purpose programming languages including but not limited to: Ruby, Python, Swift, Javascript, or Go","Ability to use well established enterprise standards, processes and procedures to ensure engineering projects are delivered in a timely fashion with high quality of work product","Ability to manage and maintain AWS infrastructure to support production systems.","Understanding SDLC and project management frameworks agile, scrum and iterative.","Systems Engineering experience supporting JIRA/Confluence both cloud and on-premise."]},{"title":"Nice To Have:","content":["Experience developing productivity solutions for SaaS based applications. i.e. Google Workspace, Slack, Zendesk, JIRA/Confluence.","Well-versed in producing detailed documentation","Knowledge in CI/CD for client engineering processes and tools"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/e2998560-99d0-4e25-ae99-f27ae0ccdd44"
            }