            {
                "id": 465,
                "companyId": 6,
                "title": "Talent Intelligence Partner - EMEA",
                "location": ["Amsterdam, Netherlands"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Talent Intelligence","Recruiting","Retention","Strategic Thinking","Market Research","Data Analysis","Collaboration"],
                "skills": ["data-driven","sourcing","synthesizing","translating","market sizing research","location strategy","executive engagement strategies"],
                "overview": "The Talent Intelligence Partner - EMEA position at Netflix is a strategic role that involves being a consultative partner to talent acquisition and business teams in the EMEA region, providing insights and strategies to recruit and retain top talent, and supporting the development and implementation of operating strategies.",
                "description": "Overview
Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.

It's an exciting time at Netflix as we continue to expand our business globally. We are revolutionizing the way people watch their favorite shows and movies, and building our own library of original Netflix content for all to enjoy. Visit our Culture Memo and Long-Term View to learn more about our unique Netflix culture and our bold goals for the future.

The Team
Talent Intelligence is part of the Talent Acquisition Team, partnering with leaders throughout the company to enable Netflix to recruit and retain top talent. The Talent Intelligence team serves as a consultative partner on critical talent questions, leveraging external labor market insights to address immediate internal talent priorities. The team works across every function at Netflix; you will be the connective tissue between them all, identifying opportunities for collaboration and driving TA strategies. 

The Role
In this role, you will serve as a dedicated consultative partner to talent acquisition and business teams in EMEA. You will be asked to think about the concrete and the abstract: how changes in the competitive landscape should inform the way we recruit and retain stunning colleagues. You will be asked to identify future challenges our talent teams should anticipate and to think strategically and creatively about how to best equip our teams to address these challenges. Additionally, you will serve as a strategic thought-partner to the talent acquisition leadership team in order to support the development and roll-out of operating strategies. 


Depending on the day, your work could include using market sizing research to guide recruiting strategies, providing talent density insights to influence location strategy, or partnering with talent acquisition leadership to develop long-term executive engagement strategies.
",
                "extras": [{"title":"You","content":["You have an insatiable curiosity for all things. You are a lifelong learner and the opportunity to develop an understanding of a new industry energizes you. If given a set amount of time to grasp a new topic, you can determine the right amount of information you need for the task at hand.","You are data-driven and are able to source, synthesize, and translate disparate forms of data into strategic, actionable insights.","You are an innovator. When facing a challenge, you think of creative ways you could tackle the problem. You’re equally likely to take a tried and true approach and to test out something entirely new, depending on what best suits the situation.","You care deeply about your colleagues and when you hear something like \"people over process\" you don't just get excited about good business outcomes, you also think about the good people outcomes that concept can generate. Because of your natural people-orientation, you have the ability to partner cross-functionally with a broad range of partners.","You live our inclusion value and may even have life experience that has led you down an untraditional but exceptionally enriching path. We care less about how impressive-sounding your background is and more about how impressive you are. And we expect you to bring this open-minded and inclusive spirit to the work you are doing in and with Talent at Netflix.","You have at least 5 years of professional experience and have worked in a Talent Intelligence function. You may also have experience working in consulting, market research, or executive search."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/13cd4132-4686-42a5-a273-edd955811257"
            }