            {
                "id": 467,
                "companyId": 6,
                "title": "Taxonomy Strategist, Editorial Creative",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": [""],
                "skills": [""],
                "overview": "The Taxonomy Strategist, Editorial Creative position at Netflix involves driving the metadata strategy and construction of taxonomies to support the development and maintenance of large-scale databases of creative assets for on and off-service title discovery.",
                "description": "At Netflix, we strive to be the most engaging entertainment platform and storyteller marketer in the world. A big part of that engagement is the interaction our members have with our content and how they discover a new story they'll love. Behind that discovery is a wealth of creative material -- images, clips, trailers, featurettes, synopses, factoids, tags, and genre categorizations -- that leads the industry in its scale and utilization. We are evolving and creating internal products to improve the efficiency of creative assets conceptualization, development, production, and deployment for on and off-service title discovery. In this role, you will be responsible for driving the metadata strategy and construction of taxonomies that will support these efforts.

We are seeking a Taxonomy Strategist who has experience with and passion for bringing structure to large-scale, disparate databases of creative assets that include audio-visual, static image, and textual assets. Your experience includes implementing best practices and driving adoption of standardized metadata and taxonomies.  The taxonomies this person develops will support asset metadata that can be both technical, administrative and creative in nature. You must be adept at setting up users for success in applying both objective and subjective points of metadata. You will be responsible for scoping, creating, and maintaining data dictionaries, controlled vocabularies, schema governance, and data integrity/enforcement.

We are looking for someone who has extensive experience leading or driving the development and maintenance of taxonomies and metadata models for digital promotional media assets (trailers, key art, billboards, etc). The ideal candidate will be confident in making informed decisions after receiving input and asking for critical feedback from cross-functional partners. They possess the communication skills to successfully advocate for and gain acceptance of new taxonomy-related processes and governance policies. They must be concise, definitive, and convincing in their well-founded recommendations.

As a Taxonomy Strategist within Creative Production, you will work closely with Marketing, Publicity, Brand, Product Studio, Editorial Creative, Globalization and Data Science Engineering teams to define and develop common metadata and taxonomies that will allow Netflix to maximize the efficiency of its creative assets. You will partner with Global teams ensuring the work is regionally friendly outside of the US.  You will also partner with Creative Operations, Platform Engineering, and Product Engineering to introduce user-focused, scalable solutions for applying metadata to creative assets.

You are comfortable working in an environment where giving and receiving feedback is the norm. Successful colleagues do not shy away from difficult conversations.

Reporting to the Editorial Curation & Taxonomy Manager, this is an exempt role. Preferred location is Los Gatos or Los Angeles, but will consider US Remote, with some required travel to California.

",
                "extras": [{"title":"Responsibilities include:","content":["Defining new taxonomies and metadata related to technical, administrative and creative attributes for all promotional video, artwork and digital media assets and their campaigns.","Surveying and interviewing stakeholders and observing current workflows.","Identifying new needs and filling gaps in current information architecture from a data structure/data connectedness perspective rather than a visual design perspective.","Working with subject matter experts to define workflows and standards for metadata application.","Reconciling disparate taxonomies and metadata across teams.","Advocating for shared metadata and taxonomies across tools and teams, and evangelizing its value.","Working closely with engineering partners to identify solution requirements, including intuitive UI for metadata application.","Auditing existing taxonomies and improving their efficiency.","Ensuring metadata is defined such that its integrity will not be compromised by cultural bias.","Establishing a governance framework for all metadata and taxonomies.","Establishing maintenance systems for all metadata and taxonomies.","Working with team experts to develop training materials and sessions."]},{"title":"Requirements:","content":["Experience defining and developing taxonomy and metadata schemas.","Experience working with Marketing, Publicity and/or creative promotional assets.","Experience with Information Architecture from a data structure/data connectedness perspective rather than a visual design perspective.","Experience working with asset management systems like DAMS or MAMS for creative and production assets.","Experience working with collaborative, internal-facing workflow applications and project management tools.","Experience working in a high-volume content environment.","Experience working with systems shared across internal teams and vendors","Experience establishing a governance system to maintain taxonomies.","Excellent communication skills: written, verbal and presentation","Experience working in a global context.","Able to work with and manage multiple stakeholders expectations and priorities.","Ability to set goals and work independently in a highly cross-functional, non-hierarchical workplace.","Ability to influence across various function groups.","Familiarity with software development cycles and practices.","Comfortable working in a wide range of software from spreadsheets to proprietary apps to third-party tools."]},{"title":"Nice to Have:","content":["Masters degree in related fields: Data Management, Computer Science, Library & Information Science","Experience working in the entertainment industry.","Experience with Rights Management.","Interest in Machine Learning and/or Artificial Intelligence capabilities.","Interest in User Experience and/or Human Computer Interaction.","Experience with Multilingual Taxonomies.","Familiarity with Ontologies."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/0347bb9f-d4af-4979-a563-f622a2b79ad5"
            }