            {
                "id": 473,
                "companyId": 6,
                "title": "Technology Systems and Operations Specialist",
                "location": ["Tokyo, Japan"],
                "type": [],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Technology Systems","Operations Specialist","technical issues","research","documentation","business-to-business relationships","analyzing trends","improvements","Netflix facilities","user experience","digital software trends","best practices","frontline Netflix Technology Support","AV","networking teams","escalation point","applications","services","technologies","reducing complexity","user experience","workflow enhancements","Netflix Facilities","end-user experience","workflow design","stakeholders' needs","operational decisions","business outcomes","forecasting","planning","partners cross-functionally","Networking Teams","Post Facilities","Content Business Product Success","Workplace","Space & Occupancy","Standard Operating Procedures","User-Experience","Engineering teams","Managed Service Providers","continuous review","feedback","coaching","metrics","reporting","trends","environment","collaborate effectively","partner teams","provide face-to-face support","proactive support","reduce support volume","Quality & Assurance processes","runbook documentation","troubleshoot","resolve","escalate","Self Help","blend deep knowledge","qualitative","quantitative data","reduce friction","productivity","trusting relationships","N-Tech Reliability Specialists","onboarding new work","designing","optimal","service path","collaborating","advocating","memos","NECESSARY SKILLS","EXPERIENCE","Business-level fluency","speaking","writing English","Japanese","Strategic thinking","technically","business-wise","build strong cross-functional partnerships","Working knowledge","Network infrastructure","smart hands approach","routing","switching","DHCP servers","subnetting","low voltage cabling","troubleshooting","MacOS","Windows","Saas Applications","AV systems","learn new technologies","minimal guidance","familiarity","asset tracking","management","deployment","Local/Regional knowledge","vendors","general operation standards","culture","technical challenges","interpersonal","communication skills","written","verbal","work independently","minimal supervision","self-motivated","self-starter","initiate ideas","ambiguity","technical depth","analyze support data","identify trends","drive insight","operational improvement","informed captain","lead new initiatives","workflows","support","Flexible","ever-changing","growing environment","Information tracking","ancillary charges","overhead budgets","compose clear process","procedure documentation"],
                "skills": ["Network infrastructure","MacOS","Windows","Saas Applications","AV systems","Asset tracking","Troubleshooting"],
                "overview": "",
                "description": "ROLE
As a team, we champion the end user to drive their success through technology. We simplify the complex. As a Learning Engine for Netflix, Netflix Technology team (N-Tech) will seek out the friction users experience with technology and convert user friction into the fuel that drives effortless technology experiences.

As a Technology Systems and Operations Specialist (TSOS) for Netflix, you will be part of a global team ensuring an exceptional experience for Netflix’s 10,000+ users. Your top priorities will be managing technical issues, research, documentation, business-to-business relationships, and analyzing trends and the impact of these issues with the ultimate goal of driving improvements in Netflix facilities and overall user experience.

The N-Tech Technology Systems and Operations Specialist will strive to provide the best technical solution for each situation, which may sometimes mean utilizing technology not owned by Netflix. Therefore they must have a working knowledge of current digital software trends and business needs as well as best practices both within and outside of the entertainment industry. 

This position will partner with our frontline Netflix Technology Support, AV, and networking teams, as well as others, as we operate as an escalation point for various applications, services, and technologies. You’ll be responsible for reducing complexity and improving the user experience at Netflix-owned properties by leveraging technology and workflow enhancements. 


RESPONSIBILITIES

",
                "extras": [{"title":"Own the onsite experience for assigned Netflix Facilities.","content":["Drive an end-user experience, including workflow design that meets the business outcomes of our N-Tech organizations and meets our stakeholders' needs.","Make autonomous operational decisions based on data and anticipate impacts to the business.","Understand business outcomes and provide forecasting and planning.","Partners cross-functionally with Stakeholders (including, but not limited to, Networking Teams, Post Facilities, Content Business Product Success, Workplace, Space & Occupancy, etc.) to learn, document, and advise with a focus on driving efficiency, resolution of issues and improved onsite experience."]},{"title":"Lead the day-to-day operation of Netflix facilities, Netflix-owned tools, and services, which include:","content":["Develop Standard Operating Procedures and communicate changes to User-Experience and Engineering teams.","Train and lead a team of Managed Service Providers (MSPs) or contractors to conduct work on behalf of Netflix. Ensures the quality of support through continuous review, feedback, and coaching.","Create and leverage metrics and reporting to identify trends within the environment and collaborate effectively with partner teams to build valued add and scalable solutions.","Help create and maintain the decision-making framework for whether we need to provide face-to-face support.","Act on and identify areas for proactive support to improve the end-user experience and reduce support volume and complexity around service offerings."]},{"title":"Serve as the escalation point for N-Tech teams and high-priority issues to ensure proper and timely resolution.","content":["Curate insights. Create and maintain all root cause analysis reports after an escalation to identify workflows or systems to help mitigate reoccurring issues.","Troubleshooting + escalation to various engineering partners.","Collaborate with cross-functional partners to proactively identify issues as they arise and conduct retrospective analysis on large-scale issues.","Manages, and drives incidents to conclusions."]},{"title":"Development of Quality & Assurance processes and runbook documentation that our Stakeholders will use to self-serve as well as by our support teams to troubleshoot, resolve and/or escalate.","content":["Right-fitting the work as needed ensures that all N-Tech partners and Stakeholders participate at the right time.","Create How to documentation and Self Help (Tier 0)"]},{"title":"Blend deep knowledge of how users experience products with qualitative and quantitative data in order to help our product specialists reduce friction and complexity in the end-to-end user experience.","content":["Tell data-driven stories around how users experience friction with technology, with the goal of influencing Product, Eng and partners to reduce complexity and improve productivity with technology.","Drive frictionless user experiences by developing strong trusting relationships with partners, stakeholders, and N-Tech Reliability Specialists.","Provide escalated support for issues that cannot be solved by N-Tech User Experience and Domain/SME Specialists (ie support which requires additional knowledge of user workflow, deeper subject matter expertise, etc).","Responsible for onboarding new work, and designing the most optimal and scalable service path to ensure that N-Tech scales (ie determine what work goes back to Product etc).","Responsible for collaborating and advocating on memos created by Domain/SME Specialists and N-Tech Reliability Specialists."]},{"title":"NECESSARY SKILLS & EXPERIENCE","content":["Business-level fluency in speaking and writing English and Japanese","Strategic thinking, technically and business-wise, with the ability to build strong cross-functional partnerships.","Working knowledge of Network infrastructure with the intent of a smart hands approach; routing & switching, DHCP servers, subnetting, & low voltage cabling.","Proven knowledge of troubleshooting MacOS/Windows, Saas Applications, and AV systems.","Ability to learn new technologies quickly and with minimal guidance.","Familiarity with asset tracking, management, and deployment.","Local/Regional knowledge (vendors, general operation standards, culture, etc).","Thrives on technical challenges and takes pride in solving them.","Excellent interpersonal and communication skills both written and verbal.","Proven ability to work independently with minimal supervision; must be a self-motivated self-starter that can initiate ideas amidst ambiguity.","Technical depth and ability to analyze support data to identify trends to drive insight and overall product and operational improvement.","Ability to act as the informed captain and lead new initiatives concerning workflows and support.","Flexible amid an ever-changing and growing environment.","Information tracking, as it pertains to ancillary charges and overhead budgets","Capable of composing clear process, and procedure documentation on complex topics"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/d32d9754-a13d-4a6d-aa9f-074d396ea83a"
            }