            {
                "id": 477,
                "companyId": 6,
                "title": "UI Software Engineer (L5) - Delivery Engineering",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["UI Software Engineer","Delivery Engineering","Continuous Delivery","Spinnaker","Netflix","Cloud","JavaScript"],
                "skills": ["JavaScript","HTML","CSS","React.js","AWS","GCP"],
                "overview": "The UI Software Engineer (L5) - Delivery Engineering position involves building, improving, and optimizing the UI experience in Netflix's Continuous Delivery platform, collaborating with stakeholders to understand their needs, and using JavaScript, HTML, and CSS to build web applications that enhance user experience.",
                "description": "The Delivery Engineering team at Netflix is building Spinnaker, our Continuous Delivery platform, which facilitates Netflix in delivering billions of hours of movies and TV shows per month.  The ability to rapidly and confidently deploy the code that directly affects the Netflix experience is a huge competitive advantage. Whether it's an internal tool, a new recommendation algorithm, or changing the UI to showcase Squid Game, teams across Netflix rely on Delivery Engineering's Continuous Delivery platform to make it happen.

We are looking for senior software engineers to join our Delivery Engineering team. We’re eager to talk to you if you’re passionate about building software that enables developers to use the cloud more effectively, enables developers to deploy code to production, and accelerates developer productivity.
",
                "extras": [{"title":"What you will do:","content":["Build, improve, and optimize the UI experience in Spinnaker, Netflix’s Continuous Delivery platform","Partner with product management, product designers, backend engineers, and UI engineers to define and refine the user experience for our continuous delivery platform","Collaborate with stakeholders to understand their needs and use cases for continuous delivery"]},{"title":"The skills we require:","content":["Great communication skills, both verbal and written","Experience building web applications using JavaScript, HTML, CSS","Passionate about user experience and have an eye for improving UIs","Desire to work in a fast paced and dynamic environment"]},{"title":"The skills we prefer:","content":["Experience with React.js","Passion for intuitive user interfaces","Experience with AWS, GCP, or similar cloud computing environment"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/netflix/8589dc80-2079-4a6c-9960-8efc411be1d3"
            }