            {
                "id": 138,
                "companyId": 5,
                "title": "Brand Strategy Lead",
                "location": ["Remote, England, United Kingdom"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 8,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Brand Strategy","Global Brand","Campaign Development","Brand Equity","Consumer Insights","Brand Health","Creative Brief"],
                "skills": ["brand marketing","campaign management","creative brief skills","verbal communication skills","advertising agency experience","fast-paced environment","live experiences"],
                "overview": "The Brand Strategy Lead position at Eventbrite is responsible for developing, shaping, and strengthening Eventbrite's global brand with the goal of accelerating their repositioning as the definitive destination to discover live events.",
                "description": "THE CHALLENGE
Our mission is to bring the world together through live experiences, and we live that every day in our actions, supporting creators in building their event businesses and forging an enduring brand that consumers trust. Last year, our marketplace powered more than 4 million events organized by our diverse and vibrant creator community. Now it’s time to unlock the power of our discovery experience, helping connect consumers with the best live experiences our creators have to offer.

THE TEAM
The Eventbrite Marketing team is a centralized, multi-disciplinary group focused on acquiring, retaining, and building a world-class brand that resonates with both event creators and event goers. We are data driven and biased towards action, and put the customer at the center of everything we do. We are specialists within our individual areas of expertise and work together to connect with and support our customers. 

THE ROLE
As the Brand Strategy Lead, you will be responsible for developing, shaping, and strengthening Eventbrite’s global brand with the goal of accelerating our repositioning as the definitive destination to discover live events. You will build and protect the brand by guiding efforts across channels and executing campaigns to reinforce our positioning and values. Although you will drive the development of strategies  that enhance brand visibility and strengthen brand equity among audiences across both sides of our marketplace, your primary focus will be on consumers. You will partner closely with internal teams including Product Marketing, Growth Marketing, Design, and PR as well as with external agencies to produce work at the highest level. Reporting to the Director of Consumer Marketing, this full-time role is based in the UK.
",
                "extras": [{"title":"YOU WILL","content":["Partner with execs on the development of a new global brand strategy and play a critical role in rolling out that strategy across channels.","Drive the strategic development and production of global brand campaigns ensuring that the concepts align with Evenbrite’s identity, values and objectives.","Continuously work to identify emerging opportunities, market trends, consumer insights, and competitive landscapes to inform campaign strategies and tactics.","Track brand health, report on KPIs and provide strategic recommendations, learnings and action items to improve brand performance.","Guide marketing efforts across channels and functions to ensure we are consistently delivering our brand strategyIdentify new opportunities to bring our brand to life.","Partner closely with internal and external partners to create award-winning/ best-in-class creative"]},{"title":"THE SKILLSET","content":["At least 8 years of experience in brand marketing, preferably at an iconic consumer brand.","Fluency in brand marketing metrics.","Exceptional campaign management skills.","Exceptional creative brief skills and verbal communication skills.","Able to present to senior management.","Advertising agency experience is a plus.","A true self-starter, comfortable working in a fast-paced environment.","A passion for live experiences."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/b4a76b03-1729-4cae-a3cd-e62ce2331355"
            }