            {
                "id": 142,
                "companyId": 5,
                "title": "Financial Analyst",
                "location": ["Remote, Ireland"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 2,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Financial Analysis","Data Analysis","Strategic Decision Making","Financial Modeling","Excel","Accounting Concepts","Communication Skills"],
                "skills": ["Excel","Financial statements","Accounting concepts","Analytical skills","Data analysis","Process management","Written and verbal communication skills"],
                "overview": "The Financial Analyst role at Eventbrite involves collaborating cross-functionally to turn financial data into actionable insights that drive business decisions, support finance cycles, and contribute to process improvements.",
                "description": "THE CHALLENGE
It’s an exciting time to join Eventbrite! We’re on a journey to make our platform even more powerful and intuitive for our most valuable creators. As Eventbrite focuses on expanding its product offerings, our FP&A team is evolving its capabilities to address the increased complexity of the business while partnering with executive leadership to guide the business through this critical phase! Our mission is to provide leadership with accurate, insightful, and action-oriented guidance for decision-making. 

THE TEAM
The FP&A team is a high impact, high visibility team that partners with the CFO and senior company leaders to inform and influence decision-making through timely, accurate analysis, and data-driven business recommendations. We are a fast-moving team who gives structure to complicated issues. If you welcome ambiguous situations, gravitate towards data driven results, and want to be part of a dynamic, high-performing team, let’s talk.

THE ROLE
You will collaborate cross-functionally with finance, executive leadership, and specifically the product and engineering teams to turn financial data into actionable insights that help drive business decisions. You will contribute to developing and ensuring the accuracy of financial trackers and models that support operational and strategic decision making.  You will connect the dots between shorter-term operational strategies and longer-term financial goals and build out best in class analytical capabilities. The ideal candidate is detail-oriented, proactive, relentlessly curious and has exceptional communication skills. You are an analytical all-star who can juggle multiple assignments, meet tight deadlines and thrive in a fast-paced environment.
",
                "extras": [{"title":"You will:","content":["Support standard Finance cycles including month end close, forecasting, and associated management reporting","Collect and analyze data that looks at trends and clearly exposes investment opportunities, risks, and returns for a call to action to be made","Work closely with the product and engineering leadership teams to achieve company goals and manage department budgets","Actively contribute to process improvements and enhancements"]},{"title":"The requirements & skills","content":["2+ years of relevant experience in finance or analytics at a fast-growing company, or a background in a highly quantitative field","Strong planning, process management, and organizational skills","Experience working with large quantities of raw, disorganized data","Effective, clear, and concise written and verbal communication skills","Strong understanding of financial statements and accounting concepts","Advanced modeling, Excel and analytical skills","Highly motivated and naturally inquisitive with an aptitude for learning new tools and skills","Ability to work autonomously, to meet tight deadlines, and to thrive in a fast paced environment under pressure","Desire to solve problems and improve processes"]},{"title":"Bonus Points","content":["Experience with Workday Financials"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/1e238d8b-b2be-42e9-b293-208b4159dcbd"
            }