            {
                "id": 145,
                "companyId": 5,
                "title": "Paid Media Expert - Paid Search",
                "location": ["Remote, Spain"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 4,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Paid Media Expert","Paid Search","Growth Marketing","Performance Marketing","Search Engine Marketing","Pay-Per-Click","PPC"],
                "skills": ["Search Engine Marketing (SEM)","Pay-Per-Click (PPC)","Google","MS Bing","YouTube","LinkedIn","Facebook"],
                "overview": "The Paid Media Expert - Paid Search will develop and implement a paid media strategy, optimize performance-based PPC campaigns, and monitor and report on campaign metrics.",
                "description": "THE CHALLENGE
Our mission is to bring the world together through live experiences, and we live that every day in our actions, supporting creators in building their event businesses and forging an enduring brand that consumers trust. Last year, our platform powered more than 4 million events organized by our diverse and vibrant creator community. Now it’s time to unlock the power of our discovery experience, helping connect consumers with the best events our creators have to offer. 

THE TEAM
You’ll be joining the Growth Marketing team, a centralized, multi-disciplinary group focused on acquiring, retaining, and building a world-class brand and product that resonates with both event creators and event attendees. The team is part of the marketing organization and we work very closely with other marketing teams as well as directly partner with product, dev, and data teams. We are specialists within our individual areas of expertise and work together to connect with and support our customers. 

THE ROLE
As a Paid Media Expert, you will be working with our Senior Performance Marketing & Growth Lead to develop our Paid media strategy and ensure effective implementation of the highest impact Performance opportunities for the acquisition of event-goers.
You will cross-functionally collaborate with other Marketing departments, Product & Data teams to develop and optimize media programs for priority markets to implement these opportunities and follow-up on projects. You’ll also manage analytics tools and reporting to ensure that our current and future  Paid Media strategy aligns with our goals. 
",
                "extras": [{"title":"YOU WILL","content":["Execute Paid Media campaigns and optimize media spending across performance tactics to improve acquisition metrics.","Monitor active campaigns in order to achieve projects as well as company goals.","Focus on performance strategy campaigns.","Develop retargeting campaigns, manage audience segments and create new ones to reach our target audiences.","Analyze and report on performance metrics and identify levers to improve funnel conversion."]},{"title":"THE SKILL SET","content":["4+ years of performance marketing experience working with deep understanding of Search Engine Marketing (SEM), Pay-Per-Click (PPC) strategies and implementation including bid strategies. Other platform experience a plus.","Ability to research, develop, implement, optimize performance based PPC campaigns across properties like Google, MS Bing, YouTube, LinkedIn, Facebook, etc.","Strong understanding of industry standard marketing channels and metrics used within them","Passion for staying current on the latest marketing trends","Self-starter with proven track record of execution and results","Proven ability to work cross-functionally, collaborate, influence and work as part of a team","Data-driven approach with the ability to leverage data to make decisions","Expert in using analytics tools including Google Ads, Meta for Business. Other platforms experience is a plus.","Excellent written and oral communication skills"]},{"title":"BONUS POINTS","content":["Experience working in cross-functional growth teams","Experience managing Search Ads 360","Experience in using Google Tag Manager","Experience in using A/B test tools (Google Optimize, AB Tasty)"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/5166cbfe-1b5a-496c-ab16-3bcbc7f09e26"
            }