            {
                "id": 146,
                "companyId": 5,
                "title": "Principal Machine Learning Engineer",
                "location": ["San Francisco, California"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 8,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Machine Learning","Data Science","Product Development","Project Planning","Technical Mentor","Data Analysis","NLP","Computer Vision"],
                "skills": ["Machine Learning","Natural Language Processing","Computer Vision","Scaling data processes","Realtime and offline environments","Collaboration with product and data engineers","Technical leadership"],
                "overview": "The Principal Machine Learning Engineer position at Eventbrite involves shaping how machine learning solutions are delivered, identifying reusable patterns and technology investments, mentoring the Data Science team, and driving projects in consumer personalization and abuse detection. Requirements include 8+ years of practical machine learning experience, expertise in operationalizing and scaling data processes, and strong collaboration skills with product and data engineers. Bonus points for knowledge of Spark, Snowpark, Python, Sagemaker ecosystem, domain expertise in recommender systems or fraud detection, and being an active Eventbrite user with a passion for live events.",
                "description": "THE CHALLENGE
Eventbrite is building the global platform for live experience and helping to build new connections between creators and their audience every day. The Eventbrite platform generates a huge amount of data about what creators should do to succeed, about how consumers really make decisions, and about what’s cool in your neighborhood. The Data Science team is charged with converting the massive potential of our data about events and customer preferences into product features that delight our customers and build a foundation of trust in our marketplace.

THE TEAM
The Data Science team partners directly with product development teams to deliver machine learning solutions directly into critical product experiences through offline and real time solutions. Our team members work hand in hand with product development teams such as Personalization, Search and Discovery, and Fraud & Risk Prevention to solve customer problems like finding their next great live experience. The six members of the data science team and their current embedded development teams are all US-based and fully remote with partnership opportunities developing with teams in Spain and India.   

THE ROLE
You will shape how Eventbrite delivers machine learning solutions that are effective, efficient, and durable. You will identify reusable patterns and technology investments that help us move faster and build for scale by setting a high bar for efficient project planning, thoughtful peer feedback, and constructive collaboration. You will be a technical mentor to the Data Science team and a primary contact on machine learning development across all of engineering. In high leverage situations, you will drive individual projects especially in our focus areas: consumer personalization and abuse detection. As part of the Data organization, you will work closely with analysts and data engineers to find the right data and stage it for action. And as a member of the Principal Engineering community, you will have a voice in the technical future of Eventbrite and ensure data science can reach its full potential.  
",
                "extras": [{"title":"The Skill set:","content":["8+ years of practical machine learning experience including excellent foundational knowledge and depth in at least one specialization like Natural Language Processing, Computer Vision, or similar","Expertise operationalizing, monitoring, and scaling data processes and models in spanning realtime and offline environments","Comfort collaborating with both product and data engineers to deliver solutions with complex requirements","Demonstrated ability to be a technical lead with strong communication skills and an ability to drive the company’s vision for machine learning"]},{"title":"Bonus points","content":["Advanced knowledge of Spark, Snowpark, Python or the Sagemaker ecosystem","Domain expertise in recommender systems or fraud detection","Active Eventbrite user with a passion for live events"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/8ec0f8df-3542-43aa-ae4f-c45e9d25537a"
            }