            {
                "id": 152,
                "companyId": 5,
                "title": "Salesforce Manager",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 4,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Salesforce","GTM Tech Stack","Configuration","Maintenance","Administrators","Developers"],
                "skills": ["Salesforce","Gainsight","Geneysys","SAFe Agile Methodology","Salesforce Platform Developer Certification","Scrum","Executive Leadership"],
                "overview": "The Manager of GTM Business Systems provides direction and oversight on the solution design, configuration and maintenance of Eventbrites Go-to-Market Technology Stack, including Salesforce, Gainsight, and Geneysys, managing a team of administrators and developers to support the business.",
                "description": "THE TEAM
The GTM Business Systems Team is responsible for providing thoughtful solutions to solve our stakeholders' challenges.  We are passionate about GTM tools and align ourselves as the trusted-advisor to our business as it relates to the GTM Tech Stack.  Our focus goes beyond the day-to-day support of user requests and platform management and reaches into being proactive in thought leaders in which tools Eventbrite should leverage and how they should be leveraged to support our GTM.

The role can be based anywhere on the US East Coast.

THE ROLE
The Manager of GTM Business Systems provides direction and oversight on the solution design, configuration and maintenance of Eventbrites Go-to-Market Technology Stack, including; however, not limited to Salesforce, Gainsight and Geneysys.  You will manage a team of administrators and developers to support the business in receiving the maximum benefit from tools.



",
                "extras": [{"title":"KEY RESPONSIBILITIES","content":["Maximize product value of Eventbrite’s GTM Technology Stack, in partnership with the support of the Director, Business Systems, decides what work to do now and what work gets done later, including defects and bugs","Manages a team of Salesforce Administrators and Developers to drive continuous delivery","Provides guidance, coaching, upskilling, and training to team members","Maintains the strategy for Salesforce license management, profile and role hierarchy, technical clean up, report management.","Works closely with business and IT leadership to drive alignment and process improvement.","Responsible for improving processes, training, and tools to enhance performance of the team and platform.","Drive Agile methodology with the Business System Team to improve operational efficiency and drive team collaboration","Lead team backlog refinement and sprint planning sessions and groom team members to serve as lead for different Agile ceremonies","Operates as a key partner in managing the relationship with vendors.","Evaluates, designs and documents team processes and procedures.","Cultivates collaboration between business and IT for optimal delivery and developer operations.","Works to achieve operational targets with direct impact on departmental results.","Accountable for the overall administration and maintenance of the salesforce platform.","Identify, develop and support business process change and process optimization across business functions such as Marketing, Sales and Customer Success and Technology","Continuously builds expertise across Eventbrites GTM Technology Stack"]},{"title":"THE SKILL SET","content":["4+ years prior relevant Salesforce and Go-To-Market tool administration experience, including prior management experience gained as a team leader, supervisor or project/program manager.","Previous experience is a people leader, or as a peer-to-peer coach, desirable","Required in-depth knowledge of Salesforce products and their functionalities Experience with SAFe Agile Methodology","In-depth knowledge of salesforce products and their functionalities","Motivated self-starter with excellent work ethic and team-first attitude","Strong analytical and problem-solving skills.","Highly skilled in interpersonal and verbal/written communications, presentations, analytical and problem-solving skills.","Understands basic management approaches such as work scheduling, prioritizing, coaching and process execution, work organization, risk management and delegation."]},{"title":"PREFERRED","content":["Salesforce Platform Developer Certification","Experience implementing scrum and/or serving as a Scrum Master","Experience leading a team of Salesforce Administrators and Developers","Experience presenting to Executive Leadership","Extensive knowledge of Gainsight"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/c219870e-cd73-4016-9761-d8aab8e37a8d"
            }