            {
                "id": 153,
                "companyId": 5,
                "title": "Security Program Manager",
                "location": ["Remote, Spain"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 7,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Security Program Management","Project Management","Sprint Planning","Cloud Security","Product Development","PCI-DSS","SOC2"],
                "skills": ["security program management","project management","sprint planning","cloud security","product development","security requirements","compliance programs"],
                "overview": "The Security Program Manager will be responsible for building and managing security programs, overseeing project planning and tracking, and managing cybersecurity compliance programs.",
                "description": "THE CHALLENGE
Eventbrite is the leading global ticketing and event technology platform, powering over five million live experiences and 300 million tickets every year. We empower creators of events of all shapes and sizes – from music festivals, experiential yoga, political rallies to gaming competitions –– by providing them the tools and resources they need to seamlessly plan, promote, and produce live experiences around the world.
While being a member of the Security Team, you’ll be building and managing world class security programs. This requires extensive knowledge in security program management frameworks, project management, sprint planning, cloud security, and product development. You will oversee the security team’s project planning, tracking, and OKRs; shifting us from tactical to more strategic level work. You will be strategically a part of the product and engineering sprint planning cycles representing security requirements, priorities, timelines, and deliverables. You will also oversee and manage the cybersecurity arm of our compliance programs such as: PCI-DSS, SOC2, and SOX, and work closely with internal / external audit teams.  


THE TEAM
The Security Team provides governance, operations, engineering, and technical support throughout the organization. The security team works closely with all departments to ensure security measures are operating effectively and that risk is being managed appropriately. We are responsible for data protection, product security, incident response, compliance, backoffice security, and business enablement. Our goal is to ensure security is operating at the highest levels while unlocking the business to move faster.  

THE ROLE
As part of the Security Team, you will be building and managing a wide variety of security programs and oversee project management, capacity planning, execution and deliverables. You will bring the vision and strategy on how to shift teams from tactical level work to more strategic level work, with program management oversight. You will have experience in developing and aligning OKRs and KPIs with the broader organization and know what success looks like. You will oversee teams from the US, Spain and India and have experience with product and engineering organizations that are cloud centric. You will have a strong cloud and technology background with experience in defining / gathering security requirements. In this position you will be working closely with our governance, risk and compliance teams, security engineering, SRE, product and other engineering teams to ensure the highest level of security is being met. As part of the broader security team, you will help inspire, mentor, and lead by example as we strive to make a positive impact on our customers and the business.
",
                "extras": [{"title":"THE SKILL SET","content":["You have 7+ years of security engineering, software engineering, systems engineering, or technical product/program management experience","You will be able to define, build and lead cross-functional security programs to deliver end-to-end security solutions which solve various functional, process or security risks","You will have experience leading various governance programs and audit committees that drive compliance through strategic partnerships","You will lead the business continuity and disaster recovery efforts across various teams and own the framework, testing and technical requirements","You will be accountable for identifying and overcoming end-to-end, cross-functional problems in both technical and security domains across cloud and back office infrastructure","You will provide security program management oversight to the Security Team, building structure, project tracking, metrics and reporting","You will lead the execution and delivery of security solutions to resolve business problems via strategic thinking and hands-on leadership","Drive and influence technical and product security strategy, proactively identify problems, align on priorities, and set direction for security roadmaps","Responsible for defining and delivering on technical requirements that solve various security problems","Define and own what success looks like: metrics and measurement, OKRs / KPIs, rollout, scalable and sustainable operational plans","Build strong, trusting partnerships to readily mobilize people and influence across a broad range of partners, leaders, and organizations","Identify and improve inefficiencies in how we operate to move faster with higher quality outcomes","You will have experience delivering technology and security programs or products from inception to delivery","You will have knowledge of user needs, gathering requirements, and defining scope","Experience operating autonomously across multiple teams, demonstrated critical thinking, and thought leadership","Communication experience and experience working with technical management teams to develop secure solutions, systems, and products","You will have organizational, coordination and multi-tasking experience","You will have analytical and problem-solving experience with large-scale cloud platforms","Experience establishing work relationships across multi-disciplinary teams and multiple partners in different time zones."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/8ac47928-320d-4462-a954-0dd1302f680e"
            }