            {
                "id": 154,
                "companyId": 5,
                "title": "Senior Analyst People Analytics & Insights",
                "location": ["Remote, Spain"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["People Analytics","Data-driven Insights","Business Challenges","Talent Lifecycle","Data Visualization","Business Intelligence","Reporting"],
                "skills": ["data visualization","business intelligence","reporting","analytics tools","organizational HR data","metrics","talent analytical methods"],
                "overview": "A Senior Analyst People Analytics & Insights is responsible for using data-driven insights to solve business challenges across the talent lifecycle and enable transformational change, by transforming data into intelligence and expanding how people think and pro-actively impact decisions.",
                "description": "THE CHALLENGE
Eventbrite is a people-first organization. Our goal of building the global platform for live experience relies on the foundation of top talent and strong company culture. Our team is the face of Eventbrite, and we’re charged with finding, attracting, and bringing on the best of the best to drive Eventbrite’s growing business and award-winning culture forward. Hiring the best talent globally is no easy feat. However, we have a talented team who has an inspiring story and mission. Our perfect candidate is someone who can connect that vision and story with top-notch talent. As a People Analytics & Insights lead, you will use data-driven insights to solve business challenges across the talent lifecycle and enable transformational change. You will serve as a functional expert by transforming data into intelligence and insights and expanding how people think and pro-actively impact decisions. You are super process-oriented, love to drive change within an organization, and thrive in a fast-paced environment.    

THE TEAM 
Eventbrite’s People Systems & Operations team is dedicated to creating and delivering an exceptional Briteling experience at every stage of the employee lifecycle with efficient and seamless people processes, policies, systems, and programs. We strive to remove barriers and provide the tools to help our Britelings develop and thrive. We’ve built an unparalleled team culture, and we’re committed to elevating our bar of excellence.  

THE ROLE
As a People Analytics & Insights lead, you will help drive decision-making processes through the build-out of comprehensive human capital reporting and metrics. The role is responsible for consulting business leaders to understand business challenges and provide strategic decision support through data and analytics. 

",
                "extras": [{"title":"YOU WILL","content":["Execute I&A roadmaps","Build a metrics-driven infrastructure that leverages insights, analytics, and dashboards","Build standard storyboards with data and insights that inform critical decisions across the talent lifecycle.","Partner with leaders to develop reporting functionality, allowing leaders to easily track key business drivers such as retention, engagement, and performance","Have deep technical hands-on expertise in data visualization, business intelligence, reporting, and analytics tools"]},{"title":"THE SKILL SET","content":["Subject matter expert in organizational HR data and metrics, including industry trends and state-of-the-art talent analytical methods","You have 5+ years of relevant analytics experience in People/Talent, Human Resources, and solving workforce problems using quantitative & qualitative approaches.","Analyzes situations that require in-depth knowledge of organizational objectives","Must thrive in a fast-paced environment, be able to work independently, and possess strong project management skills"]},{"title":"BONUS POINTS","content":["Global HR experience","Workday experience","Experience with data visualization tools (Tableau, Looker, Power BI)","Proficiency with SQL and Python/R"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/6369c8cf-b038-4858-9f7c-187eb33f0214"
            }