            {
                "id": 159,
                "companyId": 5,
                "title": "Senior Program Manager - Localization",
                "location": ["Remote, Spain"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Localization Program Manager","Project Management","Translation Management Systems","CAT Tools","Localization Service Providers","Internationalization","Localization Issues"],
                "skills": ["Localization project management","Translation Management Systems","CAT tools","Language Vendors","Comprehensive documentation","JIRA","Google Drive"],
                "overview": "The Senior Localization Program Manager will manage localization projects and deliverables for Eventbrite, coordinating with localization service providers to produce culturally and linguistically accurate products and content for each market.",
                "description": "THE CHALLENGE
Eventbrite is the leading global ticketing and event technology platform, powering over five million live experiences and 300 million tickets every year. We empower creators of events of all shapes and sizes – from music festivals, experiential yoga, political rallies to gaming competitions –– by providing them the tools and resources they need to seamlessly plan, promote, and produce live experiences around the world.

Localization at Eventbrite aims to delight our users worldwide with a high quality localized experience through globally accessible content and meaningful product-market fit.


THE TEAM
The Engineering Strategy and Operations team is a global team of Technical Program Managers, Business Program Managers and Project Managers that are responsible for the planning, execution and tracking of key engineering programs. They enable communication, collaboration, strategy execution, technical delivery and special projects within the Engineering organization and cross-functionally. They facilitate alignment across stakeholders, identify and mitigate risks and influence behaviors that breed success in line with our strategic vision. Our Localization resources aim to deliver a high-quality localized experience for Eventbrite users all over the world
 
 
THE ROLE
The Senior Localization Program Manager will be instrumental in managing localization projects and deliverables for all the products and teams that we support. The Senior Localization PM keeps the Localization Program Manager and all the program stakeholders up to date tracking overall progress of each project while flagging internationalization and localization issues, proposes possible solutions and researches and recommends feature improvements. She/he will coordinate with localization service providers to produce localized products and content that are culturally and linguistically accurate for each market.  The Localization PM will ensure proper localization with an eye on quality and perform scheduled and ad hoc audits of the deliverables as well as contributing  to the broader global operational strategies. 

The ideal candidate is results-driven, an effective problem solver and is passionate about managing the localization of web-based products, customer care content and other deliverables.
",
                "extras": [{"title":"THE SKILL SET","content":["Between 3-5 years localization project management experience","Experience working with Translation Management Systems, CAT tools and localization service providers","Manage the entire life-cycle of multiple localisation projects in a fast-paced environment, ensuring timely, successful execution, and scalability in line with company’s objectives","Work with translators alongside Language Vendors ensuring meaningful collaborations and a high quality and culturally sensitive approach to localisation","Contribute to and maintain comprehensive documentation of internal localisation processes and infrastructureUnderstand localization budget and vendor pricing structures, quotes and invoices","Experience launching new locales","Collaborate closely with stakeholders at all levels","Educate partner teams on the localization process to increase efficacy and drive best practices","A focus on the details and strong empathy for end users in different markets","A team player who loves to engage with others across cultural, functional and geographic linesAdvanced knowledge of JIRA, Google Drive and other related tools","Excellent communication and organization skills","Stay current with industry trends, actively experimenting with emerging technologies, and applying innovative solutions to enhance our localisation processes and efficiency"]},{"title":"BONUS POINTS","content":["Active Eventbrite user with a passion for live events","Fluent in multiple languages","Experience using Transifex, XTM and Global App Testing"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/c98b0f8b-ba25-4f9e-bc55-2d4727dfdb59"
            }