            {
                "id": 167,
                "companyId": 5,
                "title": "Staff Product Analyst - Experimentation",
                "location": ["Remote, Spain"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Staff Product Analyst","Experimentation","Product Analytics","Collaboration","Cross-functional Teams","Data Insights","A/B Testing"],
                "skills": ["SQL","Tableau","Snowflake","Heap","Github","Statsig","data storytelling"],
                "overview": "The Staff Product Analyst - Experimentation role at Eventbrite involves partnering with senior product and engineering leaders, defining and driving the experimentation framework, and communicating data insights to stakeholders.",
                "description": "THE CHALLENGE
Eventbrite has the world’s largest data repository of live events, powering millions of events and hundreds of millions of ticket transactions each year in 170+ countries. The Product Analytics team’s mission is to leverage all this data so we can build a better product to help our Creators better manage and promote their events, support our Attendees to find the perfect event, and grow our business. As we position Eventbrite for continued success, we are looking for a Staff Product Analyst who is a strong collaborator with a proven track record of working with cross-functional teams to build impactful products. You will partner with senior product & engineering leaders, product development teams, and other analysts to define, measure, and analyze the impact of product features. You will be responsible for communicating data insights to stakeholders clearly and concisely. As experimentation and A/B testing expert, you will play a key role in reshaping the company's experimentation vision and ensuring that all teams leverage it effectively.


THE TEAM
Our product analytics team is centralized within the Data Organization, where each analyst partners directly with product development teams and leaders. The team's scope spans multiple user types and business models across the entire breadth of the product. We leverage various data sources to generate novel insights and recommendations that drive impact. We conquer significant problems by putting our heads together, learning, supporting, and mentoring each other to reach greater heights as a team and company.


THE TECH STACK
Our data operations rely on diverse, powerful technologies, including Heap, Statsig, Tableau, and Snowflake. Using Heap, we can seamlessly capture and analyze user interactions, enabling us to uncover invaluable insights into user behavior. Statsig empowers us to conduct feature experimentation and A/B testing with great precision, facilitating data-driven decision-making. With Tableau, we can create visually stunning data representations, which in turn help our teams to comprehend complex data trends better. Finally, Snowflake is critical in our data infrastructure, providing a highly scalable and flexible platform for managing and analyzing our data.

",
                "extras": [{"title":"THE ROLE","content":["Define and drive Eventbrite’s experimentation framework","Collaborate with Sr. product & engineering leaders to ideate, evaluate, and assess the effectiveness of new product and features","Educate and enable analysts to identify opportunities for experimentation, provide guidance on formal statistical methods, metrics and evaluation criteria","Consult on analyzing customer impact and proactively share business opportunities and recommended actions","Develop dashboards, reports, and analyses that enables you, other analysts, and your partners to more efficiently glean insights and work with data","Confidently communicate insights to stakeholders in a concise and actionable manner","Empower your partners to self-serve and leverage experimental evidence more frequently in decision making","Elevate the impact of the analytics teams through technical mentoring/coaching while promoting a team culture that values teamwork and continuous learning"]},{"title":"THE SKILL SET","content":["5+ years experience in an experimentation role at a consumer scale product company","Strong interpersonal and communication skills (both written and verbal)","Experience partnering with product development teams, scaling experimentation programs, and improving testing velocity and impact","Outstanding understanding of statistical methods specifically around experimentation","Strong ability to distill complicated problems into simpler actionable frameworks","Proven track record driving insights and impact with a natural knack for data storytelling","Experience with data languages/tools and how to leverage them for impact including SQL, Tableau, Snowflake, Heap, Github, & Statsig (or similar experimentation tool)","Proven autonomy and ability to independently prioritize and manage multiple concurrent projects"]},{"title":"BONUS POINTS","content":["Background in statistics, math, computer science or related technical field","Demonstrated experience using advanced statistical / data science techniques to deliver insights and measure impact"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/7297094c-d1f8-4706-a286-1658e48c5613"
            }