            {
                "id": 168,
                "companyId": 5,
                "title": "Staff Software Engineer",
                "location": ["Remote, India"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 10,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Python/Django","Kotlin","AWS","Computer Science Fundamentals","Software Design","Cloud Architecture","Testing Frameworks"],
                "skills": ["Python","Django","Kotlin","AWS","RabbitMQ","Kafka"],
                "overview": "The Staff Software Engineer position at Eventbrite involves collaborating with product, design, and other engineers to implement solutions, shaping the technical direction of Core Services, and mentoring other engineers' technical growth. The primary tech stack includes Python, Django, Kotlin, and AWS services. The ideal candidate has 10+ years of full-stack development experience and deep knowledge of complex software and distributed system design. Bonus points for experience with modern frontend frameworks and a passion for live events.",
                "description": "THE CHALLENGE
Eventbrite is a people-first organization. Our goal of building the global platform for live experience relies on the foundation of top talent and strong company culture. Our team is the face of Eventbrite, and we’re charged with finding, attracting, and bringing on the best of the best to drive Eventbrite’s growing business and award-winning culture forward. Hiring the best talent globally is no easy feat. However, we have a talented team who has an inspiring story and mission. Our perfect candidate is someone who can connect that vision and story with top-notch talent. 

THE TEAM
The members of our team tackle big problems through small group collaboration. Our technology spans web, mobile, APIs, big data and machine learning, search, as well as physical point of sale and ticket scanning systems. As a people-focused organization, we support a culture of inclusion, mentorship, and continuous learning. Pair programming, weekly demos, tech talks, and hackathons are at the core of how we build our team and product. We engage with the community by hosting events with exciting technical speakers and releasing key building blocks of our stack as open-source software.   
Our engineering teams own their services and systems end to end from requirements gathering to deployment to maintenance. Team members follow an on-call rotation to ensure any issues are mitigated immediately and root causes are rectified.

THE ROLE
As Staff Software Engineer you will collaborate with product, design and other engineers to formulate and implement solutions to various needs and requirements. You’ll also be in a preferred position to shape the technical direction of the Core Services, working closely with our Principal Engineer ensuring Eventbrite’s platform evolves to exceed our customers’ expectations. We work in an iterative fashion to always have a shippable product that can instantly add incremental value to our users. We value code quality and high confidence around our releases. Besides this, and at the team level, you will be also involved in other engineers' technical growth by following their progress in the career path, providing feedback, and evaluating team members' performance. This mentorship also implies that you will be involved in the definition of that career along with other more experienced engineers and that you will be a decision-maker helper about really important things in relation to the team.

",
                "extras": [{"title":"THE TECH STACK","content":["Our primary stack is Python/Django and Kotlin based microservices, running on the AWS platform. In addition to self-managed infrastructure like RabbitMQ and Kafka, we heavily rely on various AWS services such as Aurora, OpenSearch, ElastiCache, and many others. We also leverage the HashiCorp toolset in our stack (Consul, Nomad, Vault, and Terraform)."]},{"title":"THE SKILL SET","content":["Understanding and application of computer science fundamentals: data structures, algorithms, and design patterns.","10+ years of application (full stack) development and design experience with modern languages like Python, Kotlin, etc.","Advanced knowledge of complex software design, distributed system design, design patterns, data structures and algorithms.","Deep understanding of cloud providers such as AWS, and cloud architectures and design patterns.","Track record of delivering successful solutions and collaborating with others.","You enjoy teaching and mentoring others","Testing Frameworks"]},{"title":"BONUS POINTS","content":["You have experience working with modern frontend frameworks: React, Backbone/Marionette, etc","Passionate about Front Ending Tech Stacks","Active Eventbrite user with a passion for live events"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/099aad78-d7ab-44cb-848c-65b6f7e08706"
            }