            {
                "id": 170,
                "companyId": 5,
                "title": "Strategic Advisor, Strategic Success",
                "location": ["Remote, United States"],
                "type": ["Full-time"],
                "attendance": ["Remote"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Strategic Advisor","Strategic Success","ROI","customer onboarding","customer enablement","delivery model","ticket growth"],
                "skills": ["Customer Success","Account Management","SaaS product","Client engagements","Communication skills","CRM software","Google suite"],
                "overview": "The Strategic Advisor, Strategic Success position involves driving successful customer experiences, increasing product adoption, conducting regular customer health checks, guiding creators through onboarding, providing feedback to improve the self-service experience, and working cross-functionally to ensure customer retention and satisfaction. The ideal candidate should have 5+ years of experience in Customer Success/Account Management, experience with SaaS products, strong organization and communication skills, and the ability to work collaboratively and adapt to change.",
                "description": "THE CHALLENGE
We’re disrupting a huge industry. Our success is anchored on building long-lasting, trusted and strategic partnerships with our customers. The Strategic Success team is responsible for ensuring the long-term success of every customer we support.

THE ROLE
As a Strategic Advisor, Strategic Success, you will help our customers realize the maximum ROI with the Eventbrite platform, and help the company build a world-class customer onboarding and enablement experience that supports our core business and expands our revenue potential. Each day you will be responsible for ensuring a high-quality, predictable, and repeatable delivery model is implemented that maximizes delivery quality, retention, and revenue.

1. Drive re-engagement with inactive or at-risk accounts
2. Increase product and feature adoption amongst creators that will help improve their success on the platform
3. Conduct regularly cadenced customer health checks & check-ins with high-value customers to evaluate customer health and identify opportunities for an account and event optimization that will help drive ticket growth
4. Effectively guide creators through the onboarding process, ensuring you provide them with the necessary training and tools to set them up for success. 

Your contact with our creators will also help provide a feedback loop with Eventbrite Product and Engineering teams, to help identify opportunities to reduce contact drivers that detract from our self-service experience.
",
                "extras": [{"title":"YOU WILL","content":["Drive successful experiences for our customers with an emphasis on strategic planning, engagement implementation, feature adoption, and meaningful measurement","Lead customer outreach campaigns with identified customers to help increase acquisition, activation, retention, and growth","Work cross-functionally with our Business Development, Marketing, and Customer Support teams to manage tactical needs for organizer events","Articulate and position the value Eventbrite drives for customers (with a focus on proven success and ROI) through consistent measurement, reporting, and check-ins","Actively help tell the Eventbrite story through thought leadership contributions, including case studies, client success stories, and other marketing materials.","Be an active contributing member of the global strategic success team","Identify customer requirements, uncover roadblocks, and work constructively with our Commercial Manager to ensure long-term client retention","Leverage knowledge of the Eventbrite Platform and industry best practices to provide excellent consultative support","Proactively engage with rotating customers to identify risks and growth opportunities; work cross-functionally to develop resolution strategies and ensure high levels of customer satisfaction","Continuously deliver feedback to leadership teams and participate in process improvements and optimization"]},{"title":"THE SKILLSET","content":["5+ years experience in a Customer Success/Account Management role","Experience working in the ticketing business (a plus but not required)","Experience managing customer outcomes with a SaaS product","Demonstrated ability in driving and fostering meaningful client engagements","Strong organization skills & superb capabilities in managing multiple high-priority projects simultaneously and successfully","Excellent communication skills (both verbal and written), meticulous attention to detail, and a resourceful problem-solving attitude","An analytical and results-focused mindset, coupled with a creative make-it-happen spirit","Experience using CRM software (Salesforce, Gainsight), Google suite (Sheets, slides, docs)","Bonus points for experience with Tableau, Snowflake and SQL","Strong interpersonal skills, and a proven track record of working cross-functionally to resolve customer issues","A team player with a growth mindset, adept at accepting and working through change, and a desire to help collaboratively improve processes beyond day-to-day tasks - we’re often all hands on deck!"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/eventbrite/918c155d-c903-46b3-8ddf-d97abf5217e1"
            }