{"title":"Product Designer","location":["Lahore"],"attendance":["Onsite"],"type":["Full-time"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Designer","Customer Experience","Customer Feedback","Product Roadmap","Engineering","Design Requirements","User Research","Concepts","Wireframes","High-quality Designs","Prototypes","Design System","Design Quality","Experience","Software Design","Design Degree","UX Research","Qualitative Feedback","Quantitative Feedback","Design Process","User Research","Copywriting","Wireframing","Prototyping","Visual Design","Interaction Design","Usability Testing","Visual Design Skills","Collaboration","Versatile Portfolio","Interaction Design Skills","Creative Problem-solving Skills","Documentation","Presentation","Communication Skills"],"skills":["UX research","user research","copywriting","wireframing","prototyping","visual design","interaction design"],"overview":"The Product Designer will advocate for the customer experience, collaborate cross-functionally, set design requirements, create concepts and deliver high-quality designs through testing and experimentation, and constantly bring new and impactful ideas to improve the design quality. They must have at least 3 years of experience as a Product Designer, familiarity with UX research, and excellent visual design skills.","description":"Responsibilities:\n\n• Your primary role as a Product designer is to advocate for the customer experience (CX).\n• You obsess over customer pain points and continually push to make the CX more useful, enjoyable, and accessible.\n• Cross-functional collaboration is key to your work — you will sync with product managers on customer feedback and the product roadmap, then work with engineering to bring designs and solutions to life.\n• Set design requirements based on information from internal teams and user research.\n• Create concepts and wireframes, and deliver high-quality designs/prototypes through testing, experimentation, and development.\n• Present and defend your product design ideas to cross-functional teams and senior leadership.\n• Follow an existing design system with the latitude to push it further.\n• Constantly bring new and impactful ideas and improve the design quality at Educative.\n\nRequirements:\n\n• 3+ years of experience as a Product Designer, ideally designing complex or enterprise-level software.\n• A design degree in VCD, UX, Fine Arts, Interaction Design, or CS focusing on HCI or relevant experience.\n• Familiarity with UX research and an ability to collect and interpret both qualitative and quantitative feedback\n• Proven experience in all phases of the design process, including user research, copywriting, wireframing, prototyping, visual design, interaction design, and usability testing\n• Excellent eye for visual design and ability to help fellow designers.\n• Ability to collaborate with cross-functional team members\n• A versatile portfolio that showcases deep interaction and visual design skills.\n• Passion for design; not satisfied with the status quo and always thinking of ways to improve\n• Creative problem-solving skills\n• Excellent documentation, presentation, and communication skills - you can clearly articulate your design vision and rationale through verbal and written explanation to any audience ranging from fellow designers to the leadership team.\n","requirements":[],"extras":[],"location_emoji":"🌍"}