{"title":"Product Manager","location":["Lahore"],"attendance":["Onsite"],"type":["Full-time"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Manager","Product Vision","Data-Driven Decisions","Project Management","Strategic Thinking","Business Opportunities","Cross-Functional Collaboration"],"skills":["Product Management","Strategic Planning","Data Analysis","Roadmap","Go-to-Market Strategy","Design Thinking","Prioritization"],"overview":"The Product Manager position involves working with a small team of product managers to grow the developer base and increase enterprise customer base, leading the product vision, making data-driven decisions, and influencing significant decisions across multiple departments. The ideal candidate should have a passion for building a world-class service and be flexible and committed. They will be responsible for defining, designing, launching, and measuring new features, communicating success/failure to leadership, owning the long-term vision and roadmap, identifying global business opportunities, prioritizing projects, and delivering results autonomously. The candidate should have a degree in computer science or engineering, at least 3 years of product management experience, experience with go-to-market strategies and design thinking processes, proven track record of prioritizing activities and delivering technology products/services, strong analytical and quantitative skills, excellent customer experience intuition, technical fluency, and strong communication and persuasion skills. Experience with eLearning/education applications is preferred.","description":"Our platform includes pre-configured interactive environments. This allows learners to practice their new skills right away with no additional setup on their machines. The courses weave in quizzes and coding challenges to enhance learning, and the test code can even be deployed so the learner can see what he/she has built. This is a far cry from the all too common one-size-fits-all video monologues.\n\nYou'll join a small team of product managers and will help us grow from 2 million developers. In addition, you’ll help us increase our enterprise customer base to hundreds of organizations.\n\nYou will work directly with the co-founders of Educative. This is a unique opportunity for someone who wants to lead the product vision for a V1 product where we have already achieved product-market fit and are focused on scaling to change how developers will learn new technologies in this decade.\n\nYou will be an individual contributor with the freedom to think strategically and make data-driven decisions, and the ability to drive significant impact to the customer experience and the business.\n\nThe ideal candidate will be a self-starter with a passion for building a world-class service and have a high level of flexibility and commitment. You'll shape company strategy in a rapidly evolving environment. With stakeholders spanning the company - Sales, Marketing, Content, and Engineering - you'll have frequent opportunities to influence significant decisions.\n","requirements":[],"extras":[{"title":"In this role, you will be responsible for the following areas:","content":["Define, design, launch and measure new features to drive improved profitability and discovery of products, resulting in growth and superior customer experience.","Define, collect, and measure key metrics to communicate success/failure with executive leadership and relevant stakeholders.","Own the long-term vision and roadmap for Educative products as it matures, maintain a deep competitive awareness and think big to identify global business opportunities worthy of investment.","Determine root causes, develop business cases, test/implement solutions and prioritize competing opportunities.","Operate with significant autonomy to deliver results and achieve the goals and objectives of both your team and the broader organization."]},{"title":"About you:","content":["Bachelor’s, Master’s degree or Ph.D. in computer science, engineering or related field.","3+ years of Product Management experience (i.e. creating strategic product roadmap(s) from conception to launch and working with cross-functional teams).","Experience driving the product vision, go-to-market strategy, and design discussions. Familiarity or experience with design thinking processes.","Proven track record of prioritizing high impact activities and keeping complicated projects moving forward, working with cross-functional teams.","Proven experience delivering technology products/services in a high growth environment with a demonstrated ability to translate customer needs into business and product requirements.","Superior analytical and quantitative skills; experience using data and metrics to independently test theories, confirm assumptions, and measure success with extreme attention to detail.","Excellent customer experience intuition; demonstrated success in creating innovative and user-friendly products and customer-facing features.","Technical fluency; comfort understanding and discussing technical concepts, schedule tradeoffs and new opportunities with technical team members.","Strong written and verbal communication and persuasion skills.","Experience with eLearning/education applications preferred","You are a Recruiter! Educative hires company builders and, in this role, you will be asked to be on the constant lookout for the best talent to bring on board to help us continue to build Educative"]}],"location_emoji":"🌍"}