{"title":"Project Manager (Islamabad)","location":["Islamabad"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Project Manager","Content Project Manager","Workforce Management","Resource Allocation","Workflow Processes","Automation","Performance Analysis"],"skills":["Workforce management","Resource allocation","Workflow processes","Automation","Productivity metrics","Forecasting data","Action plans"],"overview":"The Content Project Manager in Islamabad is responsible for workforce management, including staffing plans and resource allocation, as well as performance analysis through productivity metrics and forecasting data analysis. They should thrive in an entrepreneurial environment, be responsive to changing business needs, and have enthusiasm for continuous improvement.","description":"Do you want to be part of a high-performing team at a fast-growing technology company?\n\nAre you passionate about enabling learning and career growth for a community of developers?\n\nDo you feel motivated by contributing to a culture of continuous improvement?\n\nThe Content Project Manager role may be right for you. The Content Project Manager is integral for company growth and you will help drive the future of the company by maximizing the our ability to deliver high quality technical courses.\n\nYou’ll also have the freedom to make Educative better every day. To see your ideas in action.\n\nIn this role, you will perform:\n\nWorkforce management:\n• Develop staffing plans and facilitate tradeoffs when conflicts arise.\n• Oversee resource allocation to ensure delivery of courses, response to author and learner tickets, and completion of strategic projects under agreed upon timelines.\n• Work with management to achieve cross-training initiatives to ensure even workload distribution.\n• Communicate proactively with internal stakeholders on any internal and/or external changes that could impact delivery status.\n• Promote content development estimation techniques to forecast delivery dates and efficiently use resources.\n• Evaluate and implement opportunities for improving workflow processes and automation of processes.\n• Point of contact for any issues with workforce management tools.\n\nPerformance analysis:\n• Define, implement and monitor productivity metrics for the team and individual contributors.\n• Analyze forecasting data to assist in developing action plans to remedy any service level gaps\n","requirements":[],"extras":[{"title":"You are:","content":["Highly motivated with proven track record of thriving in an entrepreneurial environment","Ability to be responsive to changing business needs, manage and prioritize concurrent assignments","Enthusiasm and curiosity for continuous improvement and root cause analysis","Proven track record of enabling teams and building cross-functional relationships"]}],"location_emoji":"🌍"}