{"title":"Video Editor","location":["Lahore"],"attendance":["Onsite"],"type":["Full-time"],"experience":"3-5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Video Editor","Content Creation","Video Editing","Adobe Creative Cloud","Sound Design","Color Correction","Social Media Trends"],"skills":["Adobe Creative Cloud","Premiere","After Effects","Photoshop","Illustrator","video production","post-production"],"overview":"The job involves creating engaging video content for software developers, including ads, tutorials, and webinars, while adhering to brand guidelines and collaborating with content producers and marketing teams. The ideal candidate should have 3-5 years of video editing experience, strong skills in sound design and color correction, proficiency in Adobe Creative Cloud, knowledge of video production workflows and social media trends, and the ability to manage multiple projects within tight deadlines. Experience working with startups and marketing teams is preferred.","description":"Educative (educative.io) is a rapidly growing startup helping nearly 2 million developers learn new skills and advance their engineering careers through online courses and interview prep.  We are seeking a seasoned Video Editor experienced creating content for US and worldwide audiences.  This individual will help create content for software developers, post-producing engaging video ads, Youtube content tutorials, and webinars to reach the next million developers.\n","requirements":[],"extras":[{"title":"In this role you will:","content":["Help create the best video content in our category","Professionally edit and post-produce videos spanning ads, webinar content, and technical tutorials for maximum engagement while adhering to brand guidelines","Collaborate closely with Content Producers and marketing to match video output to marketing needs","Rapidly iterate, taking verbal and written feedback to make precise changes, mistake-free with minimum revision cycles","Can execute on a brief with little oversight, can cut content from scratch, reassemble iterations and cutdowns swiftly for length, aspect ratio, and mobile/desktop resolutions","Imaginative and creative self-starter with a take-ownership mentality and high design standards","Comfortable working in a fast-paced startup environmentAble to attend production sync meetings that may occur with our US team"]},{"title":"About you:","content":["3-5 years of professional video editing experience with proven instincts for timing and pacing","Strong sound design, mixing, and color correction skills.","Expert in Adobe Creative Cloud - Premiere, After Effects, Photoshop and Illustrator","Understand video production and post-production workflows, video codecs and deliverable formats, especially Youtube, LinkedIn, Facebook and Twitter, and are current on social media trends","Resourceful, have an entrepreneurial mindset with the ability to self-manage and organize workloads around tight deadlines","Demand excellence and demonstrate deep passion for creating content and audience-centric experiences","Detail-oriented, Quality and deadline driven, able to prioritize and manage several milestones and projects efficiently","Prior experience working with startups and/or marketing teams","Ability to work effectively in a collaborative environment","Fluent in written and spoken English","A portfolio of prior video work to showcase your experience and creativity"]}],"location_emoji":"🌍"}