            {
                "id": 38,
                "companyId": 4,
                "title": "Agency Lead, Japan",
                "location": ["Tokyo"],
                "type": ["Permanent"],
                "attendance": ["Onsite"],
                "experience": 10,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Sales Leadership","Partnership Creation","Trading Experience","Relationship Management","Digital Media","Music","Podcasts"],
                "skills": ["Sales Leadership","Partnership Creation","Trading Experience","Relationship Management","Digital Media","Music","Podcasts"],
                "overview": "The Agency Lead, Japan position requires an experienced sales leader with a deep interest and passion for digital media, music, podcasts, and innovation, who will oversee enterprise agency partnerships in Japan to make Spotify the go-to audio and audience platform.",
                "description": "Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.

We are looking for an Agency Lead for our Japan market with an established record of sales leadership, partnership creation, trading experience, and relationship management, as well as a deep interest and passion for digital media, music, podcasts and innovation.
In this role, you will oversee enterprise agency partnerships with the agency partners in Japan to make Spotify the go to audio and audience platform.

We want someone who loves our product, knows the Japan advertising industry, senior agency clients, and marketers. A senior leader who can build creative, long-term consultative solutions, and innovative ways of working with agencies. You should be confident without being arrogant, and hardworking while still knowing how to have fun. 


",
                "extras": [{"title":"What You'll Do","content":["Work alongside the Japan sales team and Head of Enterprise Sales to execute annual enterprise deals with agency partners to address Spotify business objectives, including rate structure, strategic value ads, incentives, etc.","Serve as a Spotify trading expert with deep knowledge of various deal types, compliance requirements, internal systems, approvals processes, and provide guidance to members of Japan sales team who are conducting Joint Business Plans and contractual agreements.","Maintain executive level client engagement with agency leadership such as Dentsu/Hakuhodo at Holding and Operating Companies to understand their business needs, strategy and determine how Spotify can collaborate in support of their ambitions.","Proactively identify and seek out opportunities to grow existing partners, and unlock new business opportunities within designated agencies.","Deliver excellent customer service and serve as point of contact for agency led initiatives such as collaborative research projects, innovation sessions, creative workshops, educational programs, etc.","Host quarterly business reviews with agency operating companies to track pacing against quarterly and annual investment goals.","Represent Spotify in the advertising community by seeking out and participating at industry events.","Maintain high levels of communication and transparency with management, cross-functional teams, and business partners"]},{"title":"Who You Are","content":["You are an experienced Sales Leader and have a minimum of 10+ years of digital advertising/marketing/partnerships experience in Japan","You have a deep understanding of the marketing landscape and expertise in account planning, strategic planning, and media buying within Direct & Programmatic environments","Extensive trading experience and understanding of local deal requirements.","You have experience working with Data/Insights to drive the direction of the business","You have strong agency holding company & brand direct relationships","A highly motivated, entrepreneurial, energetic, and willing to thrive in a high growth organization","You are able to hit and exceed annual partner revenue expectations","You have excellent problem solving and negotiating skills"]},{"title":"Where You'll Be","content":["This position will be based in Tokyo"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/2a607406-5639-494b-86d4-dc35df9831b6"
            }