            {
                "id": 40,
                "companyId": 4,
                "title": "Associate Director, SMB Retention Marketing",
                "location": ["New York, NY"],
                "type": ["Permanent"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["SMB Retention Marketing","Revenue Growth","Go-To-Market Strategies","Product-Led Growth","Programs","Cross-Functional Teams","Data-Driven Decision-Making"],
                "skills": ["SMB Retention Marketing","retention revenue","go-to-market strategies","product-led growth","customer treatments","performance metrics","customer retention initiatives"],
                "overview": "The Associate Director of SMB Retention Marketing will lead the global launch of programs to grow client retention and position Spotify as a crucial partner for SMB advertisers.",
                "description": "As the Associate Director of SMB Retention Marketing, you will lead the charge in launching global programs tailored to serve our SMB (small and medium-sized business) advertising audience. Your mission will be to develop and run initiatives to grow client retention and position Spotify as a crucial partner for businesses' growth. Taking the helm of our retention strategy within these key segments, you'll be accountable for retention targets and will ensure the success of SMB advertisers, maximising Spotify to drive their business expansion.

Our ideal candidate has experience in steering retention revenue targets and leading go-to-market strategies, with a focus on driving product-led growth. They should have a consistent track record in solving complex problems, scaling initiatives, and leading growth endeavors. You will craft, deploy, and expand global programs that cater to the needs of SMBs within key segments, using a test-and-iterate approach. Your role will involve setting and driving strategic go-to-market roadmaps, backed by strong support and collaboration from cross-functional teams (Advertiser Growth & Marketing, Operations, Product, Engineering, Advertiser Support, and Data Science).
",
                "extras": [{"title":"What You'll Do","content":["Take ownership of retentive revenue growth for SMB on a global scale.","Lead global revenue retention programs, from inception to goal achievement.","Develop customer treatments, gathering insights into customers and the market, and assess program effectiveness.","Establish performance metrics and KPIs to track progress toward business growth objectives.","Lead global, cross-functional marketing retention initiatives in collaboration with sales, operations, insights, and product to execute customer retention initiatives.","Present results and recommendations based on program performance.","Drive communication and influence a wide array of collaborators, including executives."]},{"title":"Who You Are","content":["BS/BA degree or equivalent experience.","8+ years of experience with a minimum of 4 years of experience in revenue accountability, preferably within SMB or consumer-based businesses and 6+ years of experience in building, scaling, and leading teams within a high-performance environment.","Consistent track record in problem-solving, analytical thinking, and implementing data-driven and people-informed strategies.","Experience in developing, phasing and optimizing retention revenue-driving products or programs, particularly within the SMB sectors.","Demonstrated success in driving customer retention and revenue growth through multi-geography and sophisticated programs.","Expertise in identifying and resolving challenging trade-offs, often spanning multiple quarters.","Comfort with and passion for data-driven decision-making.","Ability to simplify complexity and effectively communicate insights to both business and technical executives, as well as external collaborators.","Well versed in the media or digital advertising industry","Capacity to influence and inspire change across partner teams and leadership, in order to establish innovative approaches and shift team behaviors.","Proficiency in presenting to and communicating with senior leadership."]},{"title":"Where You'll Be","content":["We offer you the flexibility to work where you work best! For this role, you can be within the EST time zone as long as we have a work location."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/05951f0f-26f1-45f7-ba11-ebdc662355f6"
            }