            {
                "id": 41,
                "companyId": 4,
                "title": "AV Engineer",
                "location": ["London"],
                "type": ["Permanent"],
                "attendance": ["Onsite"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["AV Engineer","Workplace Experiences","Support team","Global Workplace Services","AV experience","AV initiatives","Technical solutions","AV systems","IT and Networking","AV Infrastructure and Operations","Global AV team","Internal partners","External vendors","Meeting rooms","Common areas","Labs","Lounges","Digital signage","AV integrated spaces","AV assets","Asset management system","Forecasting","Budgeting","Technical documentation","Training materials","Equipment","Workflows","AV infrastructure","Incident manager","Problem manager","Change manager","Mentor","AV sector","AV projects","AV project management","AV system","Manufacturers","Video conferencing solutions","IT-support skills","Ticketing system","AV technology","Distributed-first environment","Self-motivated","Team player","Communication skills","Customer support skills","Problem solver","London Office"],
                "skills": ["AV Engineer","AV experience","AV initiatives","technical solutions","AV systems","AV Technicians","AV assets"],
                "overview": "The AV Engineer is responsible for creating and maintaining the AV experience for Spotifiers across the globe, leading AV initiatives and projects, designing technical solutions, and collaborating with other disciplines to ensure the best AV experience at Spotify.",
                "description": "We are looking for an AV Engineer to join our Workplace Experiences and Support team that is a part of the Global Workplace Services (GWS) team. GWS focuses on supporting the global expansion of our rapidly growing business and becoming a Distributed First company. We create spaces and services that bring Spotify’s culture and values to life – from designing thoughtful workplaces for our employees to thrive, to delivering innovative services that make Spotify a phenomenal place to work. 

The AV Engineer is a key player in creating and maintaining the AV experience for Spotifiers across the globe. Responsibilities include leading AV initiatives and projects, designing technical solutions and guidelines as well as being responsible for the delivery of robust and innovative AV systems. AV Engineers work in close collaboration with technicians and engineers of other disciplines, including IT and Networking, to build and maintain the best AV experience possible at Spotify. This role reports to the Manager of AV Infrastructure and Operations.

",
                "extras": [{"title":"What You'll Do:","content":["Work closely with the rest of the Global AV team to deliver the best AV experience to Spotifiers everywhere.","Lead AV initiatives and projects with internal partners and external vendors.","Design, document and maintain global technical solutions for meeting rooms, common areas, labs, lounges, digital signage and other AV integrated spaces.","Find and test new solutions that enhance the AV experience to Spotifiers.","Contribute to the coordination and planning of the AV team’s workload and serve as an escalation point and backup for the AV Technicians.","Establish and maintain relationships with external partners, vendors, and third parties.","Be responsible for keeping AV assets updated in our asset management system.","Contribute to forecasting and budgeting.","Build and maintain comprehensive technical documentation, support training materials and conduct training sessions for use of equipment to Spotifiers.","Drive new improved workflows to better processes and efficiencies.","Monitor and maintain the AV infrastructure, providing assessments for continual improvements to keep the technology relevant and up to date.","Act as the incident, problem and change manager when needed.","Mentor colleagues within the AV team including onboarding of new hires.","Be responsible for driving your own development in cooperation with the AV manager."]},{"title":"Who You Are:","content":["You have 3+ years of experience in the AV sector with a proven record of successfully delivering AV projects.","You have knowledge and experience of AV project management ranging from design, integration and commissioning.","You have in-depth knowledge of the functionality of each piece of hardware within a sophisticated AV system (DSP, DMC, Control Processor, Amplifier etc.) and knowledge of the industry leading manufacturers (Crestron, QSC, Dante etc.)","You have in-depth experience of using, managing, and monitoring video conferencing solutions (Google Meet, Zoom etc.) and are comfortable installing & repairing all components in an AV integrated system.","You have basic IT-support skills and basic knowledge in working with a ticketing system (such as JIRA).","You actively follow the latest developments in AV technology and strive to learn new things to continuously improve and challenge your knowledge.","You are passionate about experimenting with new technology and solutions and constantly challenge the status quo.","You are comfortable working both synchronously and asynchronously in a distributed-first environment with teams that span multiple time zones.","You are self-motivated; able to work independently and as part of a team.","You are highly dependable, have a sense of urgency and are able to meet deadlines.","You have excellent communication and customer support skills, maintaining a professional demeanor at all levels of the business.","You are a problem solver, with a flexible mentality and enjoy working in a fast-paced, dynamic environment."]},{"title":"Where You'll Be:","content":["This role will be based in Spotify's London Office."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/0058a47b-96e2-48d0-b104-92dbd42f8ef7"
            }