            {
                "id": 49,
                "companyId": 4,
                "title": "Client Partner, Financial Services",
                "location": ["London"],
                "type": ["Permanent"],
                "attendance": ["Hybrid"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Client Partner","Financial Services","Revenue Generation","Digital Media","Advertising Solutions","Relationship Building","Campaign Management"],
                "skills": ["Salesforce","advertising","audio formats","video formats","display advertising","Programmatic","brand","performance sell"],
                "overview": "The Client Partner, Financial Services position at Spotify requires developing and maintaining relationships with key clients in the Financial Services vertical, selling audio and video formats, coordinating with marketing and agency departments, meeting advertising revenue goals, and representing Spotify at events.",
                "description": "Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.

Spotify is looking for an outstanding Client Partner to join our Vertical team! We are looking for someone with a proven track record of revenue generation within the Financial Services vertical and a deep interest and passion for digital media and innovation. 

We want someone who loves our product and knows how to sell advertising solutions for clients and partners. You should be confident while staying humble, you work hard, and know how to have fun. Above all, your work will impact the way the world experiences music and podcasts on Spotify!
",
                "extras": [{"title":"What You'll Do","content":["Develop and maintain excellent relationships with our key named clients across the Financial Services vertical, allowing us to better understand their businesses and position Spotify as an invaluable partner in overcoming their strategic challenges","Sell audio formats, video formats, display advertising and other ad space in order to grow advertising revenues by creating, maintaining, and sustaining relationships with clients directly, their media agencies and their creative agencies (including Programmatic)","Work across multiple marketing and agency departments, i.e. brand, buying, strategy, comms planning, radio, digital, programmatic, branded content and innovation teams, to deliver successful campaigns","Coordinate with the communications planning team and strategic planners, client partners, and buyers to create successful ad campaigns","Focus on both a brand and performance sell, educating and inspiring our clients to use Spotify to enhance their business goals","Meet and exceed advertising revenue goals","Maintain a high volume of in person client engagement with brands and agencies","Represent Spotify at events and serve as a brand ambassador","Manage activity using Salesforce"]},{"title":"Who You Are","content":["You have 6+ years of commercial advertising experience at a brand, agency or in a media/online sales role","Knowledge of online and offline media and have the ability to be creative with audio and digital client solutions","Excellent communications skills and are a networking superstar with the confidence to build relationships at all levels, from c-level to junior.","Strong negotiation skills and the ability to present effectively and close the deal","Ability to build a pipeline and proven track record of exceeding goals","You have dexterity in creating reports and presentations using Excel, PowerPoint, Keynote, etc.","Deep understanding of the digital ecosystem","Team player, smart, adapt well with change and have a positive attitude","Able to work in a fast-paced, exciting environment and across external and internal teams to deliver creative, fresh campaigns"]},{"title":"Where You'll Be","content":["This role will be based out of our London office"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/3458ad38-e3c9-440b-b599-ae0cb9d74484"
            }