            {
                "id": 48,
                "companyId": 4,
                "title": "Client Partner Japan",
                "location": ["Tokyo"],
                "type": ["Permanent"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Sales","Digital Media","Revenue Generation","Client Relationships","Advertising","Brand Partnerships","Media Sales"],
                "skills": ["Salesforce","Slack","G-Suite","Tableau","audio formats","video formats","Programmatic"],
                "overview": "A growth-minded and collaborative Sales Manager with a proven track record of scaling business and achieving revenue targets, with a minimum of 5-10 years of successful professional sales experience in the area of media sales, advertising, marketing, and/or branding, and strong relationships with various brands in the Japan market.",
                "description": "Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.

Spotify is looking for an outstanding Client Partner (Account Director) to join our team in Japan. We are looking for someone with a proven record of revenue generation and a deep interest and passion for digital media and innovation. We are looking for someone who loves our product and knows how to sell creative solutions for clients and partners. You should be confident while staying humble, you work hard, and know how to have fun. Above all, your work will impact the way the world experiences music and podcasts on Spotify.
",
                "extras": [{"title":"What You'll Do","content":["The storyteller of Spotify Advertising and its services in crafting deeper and wider engagements with clients looking to grow and deepen their reach in the Japan market","Focus on brand sell, educating and inspiring our clients to use Spotify to enhance their business","An indispensable partner for clients across industries in the market to grow digital media sales of Spotify Advertising","Sell display advertising, audio formats, video formats and other ad space in order to grow advertising revenue by creating, maintaining and sustaining relationships with media agencies and clients directly (including Programmatic)","Lead information sharing and strategic alignment with partners and clients","Lead constant and disruptive growth of revenue, guided with ambitious quarterly targets","Partner with internal marketing, brand partnerships, and label relations teams to maximize revenue for Spotify and our partners","Attend weekly and monthly sales meetings/trainings as required","Forecast accurately, reporting daily and weekly and timely insights about your business and customers is vital. Use of Salesforce is required as a primary method of managing your day-to-day"]},{"title":"Who You Are","content":["A growth-minded and collaborative Sales Manager with proven track record of scaling business and achieving revenue targets","With a minimum of 5-10 years of successful professional sales experience in the area of media sales, advertising, marketing and/or branding","You have strong relationships with various brands in the Japan market and have the ability to open doors for Spotify with these potential clients","You love our product and know how to sell creative solutions for clients and partners","A passionate, sincere, and playful relationship builder with wide spectrum of counterpart","Always curious and open to learn knowledge and skills in modern digital marketing and its innovation, particularly in the area of Audio","You know how to deliver effective meetings and tell an inspiring and compelling story with facts and data","You have the ability to build a pipeline and proven track record of exceeding goals","You know how to better engage with clients and grow business with the team even in the remote working environment","Ability to thrive and enjoy the fast-paced growth environment","Strong negotiation skills to define the best solution for both ends","Language proficiency required in both Japanese and EnglishOther skills that would be an added advantage - Salesforce, Slack, G-Suite, Tableau"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/af773d31-f504-4b2b-8d17-72bcf5c0a529"
            }