            {
                "id": 47,
                "companyId": 4,
                "title": "Client Partner AdSales India, Media & Entertainment",
                "location": ["Mumbai"],
                "type": ["Permanent"],
                "attendance": ["Onsite"],
                "experience": 8,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Sales strategy","Client relationship management","Revenue optimization","Customer service","Pipeline management","Communication","Digital advertising"],
                "skills": ["Salesforce.com","marketing","digital advertising","Media & Entertainment","account planning","strategic planning","media buying"],
                "overview": "In this role, the Client Partner AdSales India, Media & Entertainment will build relationships with key clients in the media vertical, drive sales strategy, optimize revenue, deliver customer service, and represent Spotify at industry events. The ideal candidate has a deep understanding of the marketing landscape, strong agency and brand direct relationships in the financial services vertical, and at least 8+ years of digital advertising/marketing sales experience.",
                "description": "Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.

We are looking for a Client Partner, Media & Entertainment for the Mumbai region with an established record of sales leadership and revenue generation as well as a deep interest and passion for online media, audio, and innovation. 

In this role, you will oversee Spotify Advertising’s relationships with key clients in our Media vertical. We want someone who loves our product, knows the India advertising and media market, and has strong existing client and agency relationships. You have worked closely with Media & Entertainment companies in India on building their marketing strategy, and growing their investments on advertising. You have built creative, long-term consultative solutions and managed senior client relationships.

You should be confident without being arrogant and hard working while still knowing how to have fun. 

",
                "extras": [{"title":"What You'll Do","content":["Help define the sales strategy and drive execution for some of the India’s top Media & Entertainment companies and their agencies","Proactively identify and seek out client and industry relationships to optimize revenue","Drive partnership performance, engage with key partners, and deliver excellent customer service","Represent Spotify in the advertising community by seeking out and participating at industry events","Manage pipeline, revenue forecasts, sales activity using Salesforce.com for maximum efficiency and visibility","Maintain high levels of communication and transparency with management, cross-functional teams and business partners"]},{"title":"Who You Are","content":["You have at least 8+ years of digital advertising/marketing sales experience, with a major focus on Media & Entertainment advertisers","You are an experienced sales leader in Mumbai","You have a deep understanding of the marketing landscape and expertise in account planning, strategic planning and media buying within Direct, Re-Seller & Programmatic environments","You have experience running a business where Data/Insights drive the direction of the business","You have strong agency holding company & brand direct relationships in the financial services vertical","You are highly motivated, entrepreneurial, energetic, and willing to thrive in a high growth organization","You are able to hit and exceed quarterly revenue expectations","You have excellent problem solving and negotiating skills"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/2fda4069-cd3e-4a98-907e-7b67f7176af8"
            }