            {
                "id": 54,
                "companyId": 4,
                "title": "Data Scientist I, Finance Data & Insights",
                "location": ["New York, NY"],
                "type": ["Permanent"],
                "attendance": ["Onsite"],
                "experience": 2,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Data Analysis","Financial Reporting","SQL","Python","Data Pipelines","Automation","Business Decisions"],
                "skills": ["data analytics","Python","SQL","Pandas","R","SPSS","Tableau"],
                "overview": "The Data Scientist I, Finance Data & Insights position at Spotify is responsible for providing data insights and support to the Finance & Accounting teams, specifically focusing on music, audiobooks, licensing, and premium revenue analytics.",
                "description": "The Finance Data & Insights (FiDi) team at Spotify provides support to Finance & Accounting teams through data insights, automation solutions, and ad-hoc reporting. We help to communicate technical and business requirements between internal and external stakeholders and serve as subject matter experts for Finance data. This position specifically supports music, audiobooks, licensing, and premium revenue analytics. 
",
                "extras": [{"title":"What You'll Do:","content":["Work with a cross-functional team of data analysts, engineers, and finance partners to maintain and develop systems and processes supporting accurate financial reporting and enabling Spotify’s strategic business decisions","Develop subject matter expertise in the Spotify royalty calculation, data pipelines, and accounting systems","Work with large data sets, solving complex problems in a fast-paced and dynamic environment","Partner with Finance team members to define requirements for ad-hoc data analysis and tests of new implementations","Drive process efficiencies through automation and delivery of data pipelines to enable self-service reporting and analytics for different teams within Finance","Work in an environment with a group of highly motivated individuals who are passionate about Spotify’s success"]},{"title":"Who You Are:","content":["You have at least 2+ years of experience working in data analytics","You have a passion for solving sophisticated problems through data analysis combined with a strong business and financial acumen.","You have the ability to communicate with both technical and non-technical teams to understand and define problems, and articulate proposed solutions","You have an eye for trends and the ability to reach meaningful conclusions that inform strategic business decisions","You have a degree in mathematics, statistics, computer science, economics or another quantitative field","You have the technical competence to perform advanced analytics over large data sets with experience in Python, SQL and/or other analytic tools (e.g. Pandas, R, SPSS, Bigquery, SAS) and visualization packages (e.g. Tableau, Streamlit, D3)"]},{"title":"Where You'll Be:","content":["This role will be based in the New York Office."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/0c0cabbb-96d7-4d20-9696-6df0f62e1ab1"
            }