            {
                "id": 56,
                "companyId": 4,
                "title": "Director of Global Music Policy",
                "location": ["New York, NY"],
                "type": ["Permanent"],
                "attendance": ["Hybrid"],
                "experience": 12,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Global Music Policy","Strategic Advice","External Advocacy","Music Policy","IP Regulatory","Policy Engagement Strategy","Digital Music Licensing"],
                "skills": ["music policy issues","global digital music licensing regimes","regulatory challenges and developments","legislative and policy proposals","technology and innovation","technical and legal concepts","public speaking and writing about music policy issues"],
                "overview": "The Director of Global Music Policy will provide strategic advice and external advocacy on music policy-related matters that have an impact on Spotify in key markets around the globe, working in a global context and reporting to the VP, Head of Global Government Affairs and Public Policy.",
                "description": "The Government Affairs team is charged with understanding the global and local policy landscape in relation to Spotify’s business objectives and advocating on the company’s behalf on critical public policy issues. We represent the company before legislators and regulators, see around corners, and mitigate potential risks.

We are seeking to recruit an exceptional candidate to join our Government Affairs team as Director of Music Policy. In this role you will provide strategic advice and external advocacy on music policy-related matters that have an impact on Spotify in key markets around the globe. The position can be based in several locations and will work in a global context. You will report to the VP, Head of Global Government Affairs and Public Policy.
",
                "extras": [{"title":"What You'll Do","content":["Spotify’s objective is to give a million creative artists the opportunity to live off their art and billions of fans the opportunity to enjoy and be inspired by it. In this role, you will advance that objective by:","Setting the course for the company’s policy engagement strategy across a range of music and IP regulatory and policy areas in jurisdictions worldwide","Working with business, legal, academic and other public policy experts to help craft the company’s position on changes in the fields of music and intellectual property","Engaging with policymakers, legislators, and other external partners on relevant regulatory areas"]},{"title":"Who You Are","content":["12+ years experience dealing with music policy issues as well as related regulatory proceedings and law-making processes","Strong knowledge of global digital music licensing regimes","Relevant private or public sector experience (country-level intellectual property office or other Government) advising on relevant policy issues","Demonstrated ability to develop innovative, pragmatic approaches and business-focused solutions to regulatory challenges and developments, as well as proactive legislative and policy proposals","A history of effective advocacy before a wide range of government officials","Possess an understanding of the rapidly developing fields in technology and innovation, and a demonstrated ability to translate technical and legal concepts for different audiences","A propensity for thinking strategically and a track record of achieving effective results","Public speaking and writing about music policy issues a strong plus","Excellent interpersonal skills with an absolute commitment to professionalism and collegiality"]},{"title":"Where You'll Be","content":["This role may be based in our New York, Washington D.C., Los Angeles, or London offices","Hybrid Office Mix (2-3x a week required)"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/264175b1-b7b4-4cb5-b531-fa19c46baee5"
            }