            {
                "id": 58,
                "companyId": 4,
                "title": "Editor, Music Editorial - Finland",
                "location": ["Stockholm"],
                "type": ["Full Time Contractor"],
                "attendance": ["Onsite"],
                "experience": 6,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Editor","Music Editorial","Finland","Spotify","playlist listening","editorial voice","performance-oriented analytics"],
                "skills": ["music playlist listening","editorial voice","performance-oriented analytics","music insights","music programming","consumer behaviors","global editorial team"],
                "overview": "The Editor, Music Editorial - Finland position is responsible for curating and programming music playlists with an unbiased editorial voice, staying informed about music trends in the Finnish music community, and utilizing data and analytics to create engaging music experiences for listeners.",
                "description": "We are looking for an experienced Editor for Finland, to join Spotify's Music Editorial team! 

Based in Stockholm, this 6 month contract will work as part of the Nordic Music team.

You will identify and execute first rate music playlist listening and will ensure an unbiased editorial voice for a multitude of moods, moments and genres. You will also demonstrate a passion for performance-oriented analytics and will have your ear to the ground in the Finnish music community. As a music editor, you're encouraged to make data informed decisions, and bring deep cultural and music insights to craft highly engaging music experiences for listeners. 

Above all, your work will impact the way the world experiences music! 
",
                "extras": [{"title":"What You'll Do:","content":["Be the culture guide and proactively identify music trends and opportunities for Spotify.","Focus on the daily music programming and editorial strategy for Finland and support the Editorial team across the Nordic region.","Listen to music from a wide range of genres and identify appropriate programming opportunities.","Identify content gaps and consequently substantiate playlists hypothesis.","Understand and gain insight of consumer behaviors by analyzing data and analytics.","Collaborate with a global editorial team on a variety of projects and programming initiatives.","Work cross-functionally with other teams to fulfil company strategic goals and projects."]},{"title":"Who You Are:","content":["Experience within the Finnish music industry, programming/curating music for TV, radio, digital or other media outlets, where connecting and serving audiences with music experiences, artists and/or creators in today’s music landscapes have been an integral part of your job and missions.","You possess a perfect level of written and spoken Finnish and English.","You live and breathe music every day and have a deep knowledge of Finnish music and culture","You have a broad understanding of music from across all genres and styles and a keen sense of what makes music appropriate for different situations and an ability to identify great songs to fit.","You are numerate and adept at analyzing and interpreting data and using it to set goals.","You have great attention to detail, are organised, have a strong work ethic and a friendly, warm, positive attitude.","You’re able to demonstrate a strong understanding of, and experience with, Spotify as a user and fan.","Finally, you're a brilliant teammate and can adapt well to change"]},{"title":"Where You'll Be:","content":["This role will be based out of our office in Stockholm."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/cf1161e2-e115-4325-a74e-702755cfe81b"
            }