            {
                "id": 60,
                "companyId": 4,
                "title": "General Manager - Backstage Commercialization EMEA",
                "location": ["London"],
                "type": ["Permanent"],
                "attendance": ["Hybrid"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["General Manager","Backstage Commercialization","EMEA","developer experience","B2B","product management","business development"],
                "skills": ["Backstage","Open Source","Commercialization","developer experience","B2B","software products","technology industry leadership"],
                "overview": "The General Manager - Backstage Commercialization EMEA position is responsible for guiding Spotify's Backstage Open Source and Commercialization team to create the next trusted platform for delivering B2B developer experience software, amplifying productivity, quality, and innovation across Spotify and the developer community.",
                "description": "The Platform team creates the technology that enables Spotify to learn quickly and scale easily, enabling rapid growth in our users and our business around the globe. Spanning many disciplines, we work to make the business work; creating the frameworks, capabilities and tools needed to welcome a billion customers. Join us and help to amplify productivity, quality and innovation across Spotify.

The team continues to strive to be a leading force in the developer experience space with products such as Backstage and other developer tools, and to become a top regarded technology industry leader.

We are looking for an experienced leader  to guide Spotify’s Backstage Open Source and Commercialization team - working on the opportunity to create the next trusted platform for delivering B2B developer experience software. This is an outstanding chance to build a scaled business on one of the industry-leading developer experiences and open source platforms. Join us and lead the path forward to amplify productivity, quality and innovation across Spotify and the developer community.

",
                "extras": [{"title":"What You'll Do","content":["Scale, a fledgling developer experience focused B2B business line up to hundreds of millions in ARR.","Lead a cross-functional, high-paced team of product managers, engineers, marketers, sales, and business development professionals.","Refine and continuously iterate on the product and portfolio vision for an expanding set of software products that capitalize on Spotify’s technology industry leadership and tech pipeline.","Refine and execute on the initial go-to-market strategy and develop additional GTM expansions.","Continue to build external partnerships that enable the business model and improve Spotify's gross margins.","Partner with engineering and product teams across Spotify’s Platform organization, with particular focus with our Open Source Program Office and the Backstage core development teams.","Leadership and people management, with the ability to rapidly build and scale teams, lead and inspire others to navigate gaps and ambiguity, supported by a strong internal circle of sponsors."]},{"title":"Who You Are","content":["An Experienced B2B business leader, with extensive experience leading product and company bets within the developer tooling and open source ecosystem.","Experience overseeing marketing, sales and customer success functions.","Demonstrated knowledge within the developer tooling space with a thorough understanding of open source, open core architecture and commercializing products.","Solid eye for business, with deep understanding of the nuances of different business models (B2B, SaaS, cloud marketplaces), business life cycles, and how to measure those.","Authentic and empathetic storyteller, particularly with external partners, but you also love to lead from behind and/or to share the spotlight broadly with the team.","Entrepreneurial experience, an MBA, or equivalent experience. Experience scaling up from a startup environment to a robust business.","Clear understanding across all aspects of the software development lifecycle, with deep familiarity with the types of tools, practices and infrastructure that support it.","Natural collaborator, excelling at bringing people together outside of your core team, navigating the dependencies and requirements across the Platform organization and Spotify."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/37dddb63-4933-4731-a31e-b456239f950a"
            }