            {
                "id": 63,
                "companyId": 4,
                "title": "Group Product Manager - Ad Technology",
                "location": ["New York, NY"],
                "type": ["Permanent"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Group Product Manager","Ad Technology","Advertising Product","Project Management","Agile Methodology","Jira","Conflict Resolution"],
                "skills": ["Product management","Advertising platform","Self-serve account","Business management","Billing and payments","Reporting","Measurement solutions"],
                "overview": "The Group Product Manager - Ad Technology position is responsible for leading and managing a team of product managers in developing an outstanding self-serve advertising ecosystem, driving the strategy, vision, roadmap, and execution of Spotify’s self-serve account capabilities, and collaborating with internal Spotify platform teams to align roadmaps in service of delivering impactful features for customers and the business.",
                "description": "Our mission on the Advertising Product & Technology team is to build a next generation advertising platform that aligns with our unique value proposition for audio and video. We work to scale the user experience for hundreds of millions of fans and hundreds of thousands of advertisers. This scale brings unique challenges as well as tremendous opportunities for our artists and creators.

We are looking for a passionate and experienced Group Product Manager to join Spotify’s Self-Serve Advertising team in building an industry-leading ad platform. Your team will be responsible for ensuring our advertisers have a seamless experience partnering with Spotify advertising, leading business management, billing and payments, measurement solutions, and reporting. This team is essential to the future success of our business, and we seek a collaborative and innovative leader to help drive our vision forward.

At Spotify Advertising, our mission is to connect millions of brands and marketers to billions of fans — supporting a sustainable and scaled global Spotify business, allowing even more creators to make a living off of their art. We are building a next generation advertising platform to power that vision.
",
                "extras": [{"title":"What You’ll Do","content":["Lead and manage a team of product managers in developing an outstanding self-serve advertising ecosystem.","Drive the strategy, vision, roadmap, and execution of Spotify’s self-serve account capabilities. This includes business and account management, billing and payments, reporting and measurement solutions, notification inbox, and brand safety controls.","Work with development teams across R&D as well as with business partners to identify and drive opportunities for self-serve advertising revenue growth and user experience improvements.","Partner effectively with Engineering, Design, Product Insights and User Research to drive work forward.","Collaborate with internal Spotify platform teams to align roadmaps in service of delivering the most impactful features for our customers and for our business.","Work relentlessly to ensure your team is focused on delivering against measurable goals which support the success of our customers and business. A healthy balance of innovation, support and maintenance is key for all successful teams at Spotify."]},{"title":"Who You Are","content":["You are a highly collaborative leader that is capable of crafting a product vision, designing a supporting execution strategy, and working cross-functionally to deliver.","You can prioritize and sequence a complex portfolio of work.","You understand how different services and features weave together to create a unified advertising platform experience and can build a roadmap with that complexity in mind.","You have experience leading a diverse and impactful team of product managers, including senior product managers. You are an accountable leader who cares deeply about their personal growth and development.","You are an effective presenter and writer, and use these skills to influence large groups with conflicting priorities.","You know how to build platforms that scale. You have experience with data driven product development and knowledge of agile methodologies.","You are able to quickly shift between responsibilities that demand longer term strategic vision and immediate tactical decisions/work."]},{"title":"Where You’ll Be","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them!","Where in the world? For this role, it can be anywhere in the Americas region in which we have a work location","Prefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here.","Working hours? We operate within the Eastern Standard time zone for collaboration."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/9bfdb393-6b69-4d4f-91cc-56b8ca126ea7"
            }