            {
                "id": 65,
                "companyId": 4,
                "title": "Legal Counsel - Advertising",
                "location": ["New York, NY"],
                "type": ["Permanent"],
                "attendance": ["Hybrid"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Legal Counsel","Advertising","Agreements","Regulatory Compliance","Advertising Technology","Product Counseling","Consumer Protection"],
                "skills": ["legal counsel","advertising","agreements","compliance","advertising technology","regulatory issues","product counseling"],
                "overview": "The Legal Counsel - Advertising position at Spotify involves providing legal guidance and support to Spotify's advertising team, including advising on agreements with advertisers and publishers, ensuring compliance with regulatory requirements, and supporting the expansion of Spotify's advertising business across different markets. This role requires a strong understanding of legal principles in the advertising sector, as well as experience in product counseling, intellectual property, and digital advertising. The position is based in either New York or Los Angeles.",
                "description": "At Spotify, we’ve connected millions of people to their favorite songs and created a service that people use to discover and enjoy the music and podcasts they love. We’ve launched in 170 markets…and counting! We aim to revolutionize the way people consume music and podcasts, and we’ll need some very talented people to help us to achieve our mission.

The Products and Services Legal Group supports a broad range of functions and teams within the company, including our R&D, Premium, Payments, Ad Sales, and Marketing organizations. As a lawyer within the Products and Services Legal Group at Spotify, you will partner with and provide guidance to our advertising team and support the expansion of Spotify’s advertising business across various markets around the world..

Our work is groundbreaking, progressive and always evolving, so it will be up to you to continuously assess and advise the teams on legal issues using a creative and pragmatic approach.

",
                "extras": [{"title":"What You'll Do:","content":["You will primarily partner with and provide legal guidance to the advertising business at Spotify. You will advise colleagues on agreements with advertisers, publishers, third party vendors. You will also support compliance with regulatory requirements, and expansion of Spotify’s advertising technology platforms (including the Spotify Audience Network and Ad Studio).","Partner with our advertising business to understand their priorities and help them to achieve their objectives.","Collaborate with key internal partners to draft and negotiate commercial agreements with external partners.","Identify the regulatory and legal implications of Spotify’s evolving advertising technology stack.","Synthesize regulatory issues that may impact the digital advertising ecosystem and provide compliance guidance to business partners and others within the legal team.","Provide effective and commercially focused product counseling in relation to new product features, and UX copy.","Act as a subject matter expert within the legal team for international advertising matters, working alongside other legal team members supporting the advertising business to prepare guidance materials and deliver training sessions aimed at achieving scalability and greater efficiencies.","Work closely with other key partners in the Finance, Product and Engineering teams to provide comprehensive support to Spotify’s advertising business."]},{"title":"Who You Are:","content":["You are qualified to practice law or act as a Registered In House Counsel in either California or New York. You have at least 5+ years of post-qualification experience working in a law firm and/or in-house legal department. Existing in-house experience is preferable but not essential.","You have experience of working in the advertising ecosystem as an external counsel advising advertisers, publishers, and technology platforms; and/or in the legal department of a large, scaled business with a focus on advertising matters.","You have a robust understanding of the legal principles in the advertising sector, including the privacy requirements, regulatory developments and consumer protection laws.","Strong working knowledge and experience working with product counseling, intellectual property and legal issues relating to digital products, technology, privacy, consumer protection, and media. Experience in a consumer-facing technology organization with a significant digital advertising business is a plus.","You consistently deliver clear, concise, practical and pragmatic advice, and a proven track record to make risk-based decisions and to develop innovative and business-focused solutions to regulatory challenges and developments.","You are comfortable working at pace and in areas where there is no perfect answer and might be highly ambiguous, have a proven willingness to dig in on the details of projects and work well as part of a team — both with other lawyers and with non-legal partners.","You have excellent interpersonal skills with a dedication to professionalism and collegiality."]},{"title":"Where you'll be","content":["You will be based in either New York or Los Angeles"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/21bf652a-9300-48fe-8051-b08c5c226aca"
            }