            {
                "id": 70,
                "companyId": 4,
                "title": "Markets, Strategy & Operations Lead - Mexico",
                "location": ["Mexico City"],
                "type": ["Permanent"],
                "attendance": ["Hybrid"],
                "experience": 8,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Business Planning","Performance Analysis","Budget Management","Project Management","Strategic Analysis","Market Insights","Cross-functional Collaboration"],
                "skills": ["Business Planning and Reviews","Operating Processes","Strategic Projects & Growth Opportunities","strategy and operations","technology","audio","early or growth stage internet company"],
                "overview": "The Markets, Strategy & Operations Lead - Mexico position requires an analytical, content-savvy, and open-minded individual to scale, consolidate, and support Spotify's efforts in Mexico by managing business analysis and insights, coordinating local operations, and managing cross-functional projects in collaboration with functional leadership in Mexico and across the Latin American region.",
                "description": "The Spotify business team is responsible for managing Spotify’s regions and their performance across all business-relevant metrics. As we further expand and seek to better align across multiple markets and functions in Latin America, we’re looking for a Market Strategy & Operations (MSO) Lead with an analytical, content savvy and open-minded character to scale, consolidate, and support our efforts in Mexico!

As the MSO Lead for Mexico, you will be responsible for business analysis and insights, coordinating local operations and managing cross-functional projects by building strong relationships with the functional leadership in Mexico and across the Latin American region. In this position, you will work closely with local functional leadership and report to the GM for Latin America.
",
                "extras": [{"title":"What you'll do","content":["Business Planning and Reviews:","Develop and manage the business planning process and performance follow-up on both annual and quarterly cadences","Manage the Quarterly Business Review process, including the reporting for the Mexico business but also facilitating a cross-functional assessment across other business units","Contribute to and review quarterly forecasts for business metrics including but not limited to Monthly Active Users and Subscribers","Monitor and gather insight on ongoing business performance, including business metrics but also market trends, competitor insights, etc.","Operating Processes:","Manage the budget for the Mexico team activities, ensuring compliance with forecasts","Drive the operating rhythm for Mexico by building efficiency, removing obstacles and improving processes","Provide the functions with the insights and knowledge needed to drive decisions and define strategy","Ensure communication and alignment between all functions, including Podcast, Music, Marketing, PR, Business Development, Ad Sales, and the Growth team.","Strategic Projects & Growth Opportunities:","Evaluate and execute on strategic market opportunities","Identify and solve operational problems","Step in and execute alongside or in place of functions when needed"]},{"title":"Who you are","content":["8 + years experience in strategy and operations, or related work","You are passionate and have a deep understanding of the technology and audio spaces","You have a profound experience in an early or growth stage internet company and/or top-tier business management organization, and experience working with an international team","In-depth generalist skill-set that is equally comfortable analyzing data, coordinating internal events, speaking to partners, or negotiating a deal","You are an organized, vision-driven strategic thinker with an understanding of planning and budgeting","You have proven results demonstrating thought leadership and business judgment, developing and interpreting deep data analysis and presenting rigorous analysis and insights with simplicity, clarity, and confidence","Collaborating with executive team members (locally and regionally) to determine and prioritize business strategies","Providing functional leaders with recommendations and consultation to improve teamwork","Rapid and effective decision-making skills","Ability to learn new concepts, technologies, and businesses quickly and to produce quality work in short time-frames","Exceptionally strong interpersonal skills with demonstrated ability to work effectively cross-functionally","Expert in data analysis, data modeling, Keynote/Powerpoint, Excel","Outstanding presentation skills and ability to build concise and illustrative presentations","Genuine, confident, flexible, and fun attitude","You thrive from working in a constantly-changing but always-exciting environment!"]},{"title":"Where you'll be","content":["This role is located in Mexico City, Mexico (CDMX)"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/238096e1-9725-4f7b-bcd3-957af3a1f075"
            }