            {
                "id": 72,
                "companyId": 4,
                "title": "Product Director - Image Artwork Performance - Design Platform",
                "location": ["London"],
                "type": ["Permanent"],
                "attendance": ["Remote"],
                "experience": 3,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Product Director","Image Artwork Performance","Design Platform","Visual Merchandising","Art Directors","Image Sourcers","Art Buyers"],
                "skills": ["Visual Merchandising","Image Artwork","Art Directors","Image Sourcers","Art Buyers","DAM managers","Product Managers"],
                "overview": "This is a Product Director position for the Image Artwork Performance - Design Platform team, responsible for the global artwork creation, localization, and automation of image artwork at scale for Spotify's Visual Merchandising Product Area.",
                "description": "The Platform team creates the technology that enables Spotify to learn quickly and scale easily, enabling rapid growth in our users and our business around the globe. Spanning many disciplines, we work to make the business work; creating the frameworks, capabilities and tools needed to welcome a billion customers. Join us and help to amplify productivity, quality and innovation across Spotify.

We call Image Artwork Performance Visual Merchandising. The team specializes in how we represent content within the consumer experience. They are responsible for global artwork creation, helping us to promote Spotify Playlists and Cultural Moments. Visual Merchandising also looks after localizing Image Artwork. The team consists of Art Directors, Image Sourcers, Art Buyers, DAM managers, Product Managers, Engineers and Operations team members who connect with a global set of external agencies and freelancers, helping us to build outstanding artwork at scale. We are looking for an experienced Product or Product Marketing leader who will take on a GM role for the Visual Merchandising Product Area. 
",
                "extras": [{"title":"What You'll Do","content":["You understand the marketing opportunities within the Visual Merchandising space and are able to explain image artwork impact in growth and consumption numbers.","You can guide Visual Merchandising helping Spotify become the most visually engaging experience within the Audio Space.","You are familiar how teams achieve excellence in design","You understand the associated technology choices and asset management aspects","You can develop a business strategy on how to create image artwork automation to effectively scale.","You will identify and grow leaders within your team, setting them up for success through mentorship and coaching","You will provide context, support, and mentorship as the team works toward our business objectives — you will inspire, not merely direct","You will collaborate closely with your cross-functional peers in other business units such as Global Marketing, Music or Personalization to achieve broader business goals","You will be accountable for the breadth of our Visual Merchandising experience across many contexts and platforms","You will report to our Design Platform Lead"]},{"title":"Who You Are","content":["You are an exceptional leader and have 10+ years of experience and at least 3+ experience of leading a product area in a global consumer-focused company","You have experience in working autonomously and driving team growth and vision","You have experience in working in multiple markets/regions and are humble towards the complexity and sensitivity of what that means.","You are passionate about branding, in product marketing and design and what it can do for the audio, content, and technology industries","You’re a great communicator. You have the communication and influencing skills to help you work cross-functionally with internal stakeholders.","You thrive when developing great people and see others succeed","You are well-versed in data-informed decision making","You want to make an impact and take on complex issues"]},{"title":"Where You'll Be","content":["You will work out of the UK.","Find more information about our Work From Anywhere options here."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/aafc268f-f290-40de-a0d9-265b4f03a0fa"
            }