            {
                "id": 81,
                "companyId": 4,
                "title": "Senior Manager Partnerships and Business Development, India",
                "location": ["Mumbai"],
                "type": ["Permanent"],
                "attendance": ["Onsite"],
                "experience": 8,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Partnerships and Business Development","India","Spotify","Product Portfolio","Deal Management","Activation Opportunities","Data Reporting"],
                "skills": ["business development","strategic partnerships","telcos","OEM's","DSP's","financial modelling","strategic analysis"],
                "overview": "The Senior Manager Partnerships and Business Development, India at Spotify is responsible for identifying, negotiating, and managing strategic partnerships with local market partners in India, while driving cross-functional teams towards deal objectives and unlocking additional value for both Spotify and its partners.",
                "description": "At Spotify, we’re focused on providing the right music for every moment. We’ve connected millions of people to their favorite songs and built a service that people use to discover and share music they love! We’re currently in over 184 markets and growing fast!
We’re building a world-class business development team and are looking for a multi-talented self-starter with ambition and an undeniable appetite for progress that will help grow Spotify’s product and commercial partnerships worldwide. This role is based in our Mumbai office, and you will report to the Head of Business Development for SAMEA region (Southern Asia Middle East and Africa). Above all, your work will impact the way the world experiences audio.
",
                "extras": [{"title":"WHAT YOU’LL DO","content":["You will identify, structure, negotiate, amend, close and manage strategic deals with local market partners that are relevant to Spotify’s growth and vision in India","This will be done in collaboration with our Premium, Product, Engineering and Marketing teams to develop a product portfolio crafted to deliver value for partners","The ‘go to‘ person for the partners’ needs, defining and executing on the long-term partner relationship","You will be responsible to seek and secure activation opportunities, and carry out detailed partner analysis","Ensure that Spotify’s commitments in a partner relationship are delivered (e.g., marketing, data reporting, etc.) as well as follow-up on the partner’s dedications","Identify new opportunities to grow partnership and unlock additional value for both Spotify and our Partners","Manage internal approvals including interacting with senior internal executives from relevant functions (e.g., Product, Engineering, Legal, Finance)","Drive cross-functional teams towards deal objectives","Identify key partners and build relationships and credibility within partner organizations","Lead a pipeline of prospective partnerships","Relay partner feedback and market intelligence to internal teams"]},{"title":"WHO YOU ARE","content":["Maximum of 8 years of experience of business development and/or strategic partnerships experience with a digital service company in India","You have successfully led partnerships with large companies and demonstrate an ability to think strategically about complex business issues and recommend and execute strategic action plans. Experience with Telcos / OEM’s / DSP’s a plus","You are comfortable working with product, design and engineering teams while also being skilled at communicating complex technical concepts to non-technical partners","Experience working in a dynamic, ever-changing environment with a track record of results and a collaborative approach, working with all levels of management (externally and internally) and communicating cross-functionally in a structured and clear manner to influence outcomes","Previous experience with financial modelling and strategic analysis","A great teammate who recognizes that we are scaling fast and can listen to and voice viewpoints internally","An articulate professional with exceptional communication skills, problem-solving approach and analytical skills with strong influencing abilities","Attention to detail and the ability to see the end game of each business opportunity","Product savvy with a deep understanding of technology, trends, and the ability to articulate value points with partners and internal teams","Strong propensity to take initiative and grow with change","Strong facility for negotiating contracts, interpreting legal documents, and working with attorneys to complete agreements","BA/BS degree with outstanding academic performance; MBA a plus"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/54bf2252-23c7-49d0-a8d5-cce5585efd66"
            }