            {
                "id": 77,
                "companyId": 4,
                "title": "Senior Machine Learning Engineer",
                "location": ["London"],
                "type": ["Permanent"],
                "attendance": ["Hybrid"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Machine Learning","Advertisement Algorithms","Content Promotion","Recommendation Systems","Python","Scala","Java"],
                "skills": ["Python","Scala","Java","Tensorflow","Apache Beam","Spark","GCP","AWS"],
                "overview": "The Senior Machine Learning Engineer position focuses on developing and applying state-of-the-art machine learning techniques for guiding every user to a satisfying listening experience and making great recommendations to each user.",
                "description": "The Personalization team makes deciding what to play next easier and more enjoyable for every listener. From Blend to Discover Weekly, we’re behind some of Spotify’s most-loved features. We built them by understanding the world of music and podcasts better than anyone else. Join us and you’ll keep millions of users listening by making great recommendations to each and every one of them. We ask that our team members be physically located in Central European time or Eastern Standard/Daylight time zones for the purposes of our collaboration hours.

We are looking for a Senior Machine Learning Engineer with a focus on advertisement and content promotion algorithms to join our team that is working on applying and experimenting with state of the art machine learning techniques for guiding every user to a satisfying listening experience every time. By leveraging both human and machine learning intelligence we empower content professionals to efficiently combine their expertise in technology and culture to help connect listeners to content and artists they’ll love. 

You will be working with a cross-functional team based all across Europe who’s driving the application of machine learning to make Spotify’s beloved playlists and strategic content promotion even better. As a senior engineer in the team, you will not only coordinate and influence the direction within the team but also work with multiple stakeholders to power different personalization projects across Spotify. This is a unique opportunity to revolutionize audio recommendation with machine-learning and reinforcement-learning based approaches by collaborating with multiple teams to reshape Spotify’s existing products and develop new products.

Join us and you’ll keep millions of users listening to phenomenal recommendations every day. We’re a team of technologists, product insight specialists, designers, and product managers in Stockholm, Boston, New York, and London.
",
                "extras": [{"title":"Who You Are","content":["You have an MSc or PhD in Computer Science, Machine Learning, Engineering, Mathematics, Physics, or equivalent.","You have a strong background in machine learning, enjoy applying theory to develop real-world applications, with experience and expertise in machine learning algorithms for recommender systems and/or computational advertising.","You have hands-on experience implementing production machine learning systems at scale in Python, Scala, Java or similar languages. Previous proven experience with frameworks such as Tensorflow and the Tensorflow ecosystem (TFX) is also a plus.","You have experience with data pipeline tools like Apache Beam, Spark, etc., and cloud platforms like GCP or AWS.","Experience in computational advertisement or native advertisement is a plus.","Familiarity or a hands-on experience with reinforcement learning approaches is a plus.","You care and are able to execute on agile software processes, data-driven development, reliability, and disciplined experimentation.","You enjoy to survey research publications in the machine learning and software engineering communities.","You love your customers even more than your code."]},{"title":"What You'll Do","content":["Work from our London office or remotely within the EMEA country of your choice as a part of an outstanding team of engineers.","Contribute to crafting, building, evaluating, shipping, and refining Spotify’s personalization products by hands-on ML development","Collaborate with a multi-functional agile team spanning user research, design, data science, product management, and engineering to build new product features that advance our mission to connect artists and fans in personalized and relevant ways","Prototype new approaches and productionize solutions at scale for our hundreds of millions of active users","Drive optimization, testing, and tooling to improve product quality","Be part of an active group of machine learning practitioners across Spotify"]},{"title":"Where You'll Be","content":["This position will be based in London"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/79ca562b-ada8-460f-bb3e-c28f076e8096"
            }