            {
                "id": 86,
                "companyId": 4,
                "title": "Staff iOS Engineer, AdTech",
                "location": ["New York, NY"],
                "type": ["Permanent"],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["iOS","Objective-C","Swift","C++","Software Engineer","Agile environment","User-friendly applications"],
                "skills": ["iOS","Objective-C","Swift","C++","Software Engineer","Agile","backend servers"],
                "overview": "Staff iOS Engineer, AdTech: Architect, design, develop, deploy, and operate features for a next generation advertising platform, working on technical projects, driving development, and mentoring engineers.",
                "description": "Our mission on the Advertising Product & Technology team is to build a next generation advertising platform that aligns with our unique value proposition for audio and video. We work to scale the user experience for hundreds of millions of fans and hundreds of thousands of advertisers. This scale brings unique challenges as well as tremendous opportunities for our artists and creators.

As a Staff Engineer, you will architect, design, develop, deploy and operate features that are used by millions of users. You‘ll be the technical leader for our on surface ad experiences , contributing hands-on , while leading technical projects spanning multiple teams. We are looking for someone who can drive development and delivery, build sound architecture and foster best practices when it comes to development, as well as mentor other engineers to grow.
",
                "extras": [{"title":"What You'll Do","content":["Be a leader of the Spotify engineering community, driving and influencing our architecture across the company.","Drive best engineering practices within your team(s) by defining and teaching them.","Acquire broad knowledge about our topology, in particular, our numerous platforms and partner integrations to be able to effectively represent them in conversations internally and externally.","Work hands-on in a team solving technical problems to deliver great value to users.","Work efficiently with legacy code and suggest incremental improvements.","Contribute to the vision and long-term strategy in your domain of expertise.","Be a technical thought partner to department leadership and build trust with our strategic partners.","Facilitate collaboration between teams, departments, engineers, product managers, designers, and product insights specialists."]},{"title":"Who You Are","content":["Have proven experience of leading technical projects spanning multiple teams.","Have strong mobile skills (iOS) with a mastery in Objective-C and Swift. C++ is a plus.","Have several years of working experience in building user-friendly, data-rich, scalable applications.","Comfortable navigating ambiguity and have the ability to exercise sound judgment and decision-making abilities.","A strong communicator and can easily explain a complex technical architecture to different audiences.","Have extensive experience working hands-on as a Software Engineer in an Agile environment.","Have a detailed understanding of software development at scale, constraints and challenges, and apply them to systems and software development.","Show a deep knowledge of how to write robust, maintainable applications, and a reasonable understanding of how to build and work with distributed high-volume backend servers.","Experienced in identifying, debugging and resolving complex production issues.","Professional in mentoring engineering teams and encouraging best methodologies."]},{"title":"Where You'll Be","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them!","Where in the world? For this role, it can be within the Americas region in which we have a work location and is within working hours","Working hours? We operate within the Eastern Standard time zone for collaboration and ask that all be located in that time zone","Prefer an office to work from instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/spotify/422c3ca9-3cd3-420c-8148-b48b975c03f0"
            }