{"title":"Account Manager","location":["Tokyo"],"attendance":["Onsite"],"type":["Permanent"],"experience":"4","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Account Management","Consultative Selling","Project Management","Data-led Storytelling","Client Service","Client Relationships","Campaign Activation"],"skills":["Sales","Account Management","Customer Service","Digital Media","Planning and Buying","Industry Knowledge","Data Analysis"],"overview":"The Account Manager position at Spotify in Tokyo, Japan involves selling creative solutions, providing consultative client service, strategic planning, consultative selling, project management, data-led storytelling, delivering outstanding customer service, leading the RFP response and media plan creation processes, preparing key data points for client meetings and recommendations for media plans, facilitating campaign activation and creative production processes, partnering with cross-functional internal teams, providing ongoing campaign insights and key takeaways to clients, leading brand measurement initiatives and closing incremental and renewal opportunities.","description":"Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.\n\nWe are looking for a highly motivated individual to join our Account Management team. In this role, you will support the sales cycle from RFP submission to wrap, with a focus on providing consultative client service. This role includes strategic planning, consultative selling, project management and data-led storytelling. You will be a reliable and key team member who can anticipate client needs. Above all, your work will change the way the world experiences music.\n\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Deliver outstanding customer service to Spotify’s advertiser and agency partners","Field client questions all through the sales process across all buying channels","Lead the RFP response and media plan creation processes across all channels","Prepare key data points for client meetings and recommendations for media plans","Regularly participate in client meetings to deepen client relationships","Partner with cross-functional internal teams to deliver campaign results","Facilitate campaign activation and the creative production processes","Partner with the Campaign Manager to handle campaign performance and ensure success","Provide ongoing, comprehensive campaign insights and key takeaways to clients","Lead brand measurement initiatives and present findings to clients","Proactively identify and close incremental and renewal opportunities","Own the post-campaign analysis with findings and recommendations to drive repeat business","Adhere to internal best practice guidelines, processes and operating cadences"]},{"title":"Who You Are","content":["You have a minimum of 4+ years experience in digital media, planning and/or buying","You have strong industry knowledge and a desire to grow within the digital media industry","You come with a reputation of providing extraordinary customer service","You can translate client requests into recommendations that meet business objectives","You have the ability to craft impactful sales rationale stories by using data and research","You are a highly organized and focused multi-tasker with strong attention to detail who can work independently within a team-focused organization","You thrive in a fast-paced, deadline oriented environment and have excellent verbal, written and presentation skills","You have excellent dexterity in excel and powerpoint and have experience working within CRMs, OMSs, ad servers and other digital media tech systems"]},{"title":"Where You'll Be","content":["This role is based in Tokyo, Japan"]}],"location_emoji":"🇯🇵"}