{"title":"Artist & Label Partnerships Account Manager - Argentina & Chile","location":["Buenos Aires"],"attendance":["Onsite"],"type":["Full Time Contractor"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Account Manager","Artist and Label Partnerships","Argentina","Chile","Marketing","Distribution","Presentations"],"skills":["Spotify","marketing","distribution","content offering","label relations","artist relations","music industry"],"overview":"The Artist & Label Partnerships Account Manager for Argentina & Chile is responsible for developing relationships with key artists, managers, and labels in order to position Spotify as the top partner for artist development and monetization in the region.","description":"We are looking for a passionate and energized Account Manager for the Latin America South Cone region to join our Artist and Label Partnerships team in Argentina. This role is responsible for ensuring that key artists, managers and labels see Spotify as the #1 partner for artist development and monetization.\n\nFocusing on the Argentine and Chilean music landscape, you will work closely with the team to execute on local strategic initiatives as well as your international counterparts on multi-territory campaigns.  You will also use this relationship to further Spotify’s marketing and distribution initiatives to the mutual benefit of Spotify and its industry partners. \n\nAbove all, you have a desire to be creative and make a positive impact on the music industry as a whole.\n","requirements":[],"extras":[{"title":"What you'll do","content":["Support and educate our key partners across the artist and label community on Spotify tools and resources to inspire them and maximize their daily business.","Ensure priority releases are available on Spotify from day 1.","Work cross-functionally with other internal teams (i.e., marketing, public relations, editorial, social media, etc.) to fulfill company strategic goals and cross-functional projects.","Advocate for Spotify’s interests and initiatives externally within the creator community.","Build and share presentations and documents that communicate team and project performance","Ensure Spotify has the best possible content offering in your territory and use this to further Spotify’s appeal to existing and new users.","Develop methodologies and efficiencies to be the best in class partner to our artist and label partners.","Attend events, conferences, and shows - as needed"]},{"title":"Who you are","content":["You have a minimum of 5 years experience with label and artist relations in an established digital music service, record label or at a media company","You have a strong understanding of the music industry in Argentina, Chile, Uruguay and Paraguay and have built relevant contacts with labels and artists","You have a strong music and technology background. You also have a deep understanding and a consistent background in music marketing and operations","You have excellent negotiation, presentation and communication skills","You are well organized, dedicated, with the ability to plan and deliver on tight deadlines and pay exceptional attention to detail","You are fluent in written and spoken English","Finally, you’re a great teammate, adapt well to change, and a fan of music"]},{"title":"Where you'll be","content":["This role is located in Buenos Aires, Argentina"]}],"location_emoji":"🇦🇷"}