{"title":"Associate Director, SMB Growth Marketing","location":["New York, NY"],"attendance":["Remote"],"type":["Permanent"],"experience":"8","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Growth Marketing","Advertising Business","Marketing Programs","Advertiser Acquisition","Activation","Retention","Growth Opportunities"],"skills":["growth marketing","advertising business","key advertiser segments","growth opportunities","marketing programs","cross-functional teams","advertiser acquisition","activation","retention goals","customer insights","product and performance data","market trends","growth standard processes","business solutions","programs","campaigns","in-product experiences","program strategies","business plans","customer and market insights","program efficiency","performance measurement criteria","KPIs","test-and-learn approach","communication","executives","consulting","corporate strategy","marketing","product management","problem-solving","analytical thinking","data-driven strategies","media","digital advertising industry","growth marketing initiatives","SMB","paid media","virtual events","partnerships","multi-geography programs","data-driven decision-making","simplifying complexity","communication with executives","self-starter","collaboration skills","multitasking","working with media","familiarity with digital advertising industry","influencing and driving change","presentation skills","senior leadership","EST time zone","work location"],"overview":"The Associate Director, SMB Growth Marketing will be responsible for driving the growth of Spotify's advertising business by developing and implementing growth-focused programs tailored to key advertiser segments globally.","description":"As the head of SMB growth marketing at Spotify, you will play a pivotal role in driving the growth of our advertising business by developing and implementing growth-focused programs tailored to key advertiser segments globally. You will be responsible for identifying new growth opportunities, planning and scaling marketing programs, and working closely with cross-functional teams to achieve our advertiser acquisition, activation, and retention goals.\n\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Build and implement growth marketing programs for key advertiser segment(s) globally to achieve advertiser acquisition, activation, and retention goals.","Identify new growth marketing opportunities to acquire and retain advertisers, using customer insights, product and performance data, market trends, and growth standard processes.","Plan, test, and scale programs to grow adoption of business solutions, driving optimization across programs, campaigns, and in-product experiences.","Own cross-segment program strategies from ideation to goal attainment, developing business plans, customer and market insights, and analyzing program efficiency.","Establish performance measurement criteria and KPIs to track against business growth goals and present results and recommendations based on program performance.","Coordinate with functions like Data Science, Operations, Product Marketing, and Customer Insights to analyze program efficiency, design experimentation frameworks, adopt a test-and-learn approach into programs, and build customer-centricity.","Drive communication and influence a broad range of partners, including executives."]},{"title":"Who You Are","content":["8+ years of experience in growth, consulting, corporate strategy, marketing, or product management.","Experience leading marketing teams to launch new programs and optimize existing programs to drive results, in a rigorous KPI-driven setting.","Proven track record in problem-solving, analytical thinking, and driving strategies that are data-driven and people-informed.","Proficient in the media or digital advertising industry","Experience developing and building growth marketing initiatives for SMB","This should include paid media, virtual events, partnerships and other tactics.","Proven track record in driving programs that are multi-geography and complex in nature.","High comfort with and passion for data-driven decision-making.","Experience simplifying complexity and optimally communicating with business and technical executives, as well as external partners.","Self-starter with strong collaboration skills and the ability to multitask. Ability to adapt to changing priorities and is comfortable with ambiguity.","Experience or familiarity in working with the media or digital advertising industry.","Ability to influence and drive change among partner teams and leadership, in service of building innovative approaches and shifting the daily behaviors of a team.","Proficiency in presentation skills and comfort presenting to and communicating with senior leadership."]},{"title":"Where You'll Be","content":["We offer you the flexibility to work where you work best! For this role, you can be within the EST time zone as long as we have a work location."]}],"location_emoji":"🇺🇸"}