{"title":"Associate Strategy & Business Development Manager","location":["Los Angeles, CA"],"attendance":["Onsite"],"type":["Permanent"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Content Acquisition","Market Mapping","Deal Structuring","Negotiations","Execution","Performance KPIs","Operational Workflow"],"skills":["acquisition","video","value hypothesis building","market mapping","evaluation","underwriting","deal structuring"],"overview":"The Associate Strategy & Business Development Manager position focuses on content acquisition, including video, to differentiate the content catalog and drive consumption and monetization at scale on Spotify through partnership with creators, publishers, and service providers in the creator economy.","description":"The Partner Strategy and Business Development team builds commercial arrangements that drive consumption and monetization at scale on Spotify through partnership with creators, publishers, and service providers in the creator economy.  We are seeking an Associate Strategy and Business Development Manager to join our team to focus on content acquisition.\n\nThe Associate Strategy and Business Development Manager will differentiate our content catalog including acquisition of video.  The ideal candidate is highly organized, enjoys working in a fast-paced environment, and has strong analytical skills as well as project management skills.\n","requirements":[],"extras":[{"title":"What You'll Do:","content":["Support acquisition of strategic video content, including value hypothesis building and market mapping, evaluation and underwriting, deal structuring, negotiations and execution","Establish explicit performance KPIs pursuant to organizational priorities and OKRs for each partnership and rigorously analyze results to optimize for successes and to surface key lessons learned","Establish effective operational workflow to ensure outstanding experience for onboarded creators through seamless transitions across the Content Partnerships team","Support best-in-class cross-functional relationships in service of broad strategic alignment"]},{"title":"Who You Are:","content":["You have 3+ years of business development, management consulting, partnerships, corporate strategy, project management, and/or related media or client services experience","You are comfortable using quantitative and qualitative data to build and drive strategy","You are deeply intellectually curious","You are energized by big, complex projects and working closely with multiple cross-functional teams","You thrive in a fast-paced environment and high stakes situations and are comfortable taking accountability for KPIs","You have outstanding written communications skills with strong attention to detail, which includes generating written deliverables for both day-to-day working groups and executive audiences (i.e., presentations, briefs, working docs, etc.)","You ideally have professional experience in digital media, though it’s not required"]},{"title":"Where You'll Be:","content":["You will be based in our Los Angeles office."]}],"location_emoji":"🇺🇸"}