{"title":"Business Protection Manager","location":["Los Angeles, CA"],"attendance":["Onsite"],"type":["Permanent"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Protective Security Risk Management","Global Workspace Services","Standard Operating Procedures","Financial Forecasting","Office Security Assessments","Security Officer Team Leadership","Crisis Management"],"skills":["security risk management","security support","Standard Operating Procedures (SOP)","financial forecasts","office security assessments","security operations","access control systems"],"overview":"The Business Protection Manager is responsible for promoting a relaxed but vigilant business protection culture closely aligned with Spotify’s business objectives, establishing and implementing security strategies, maintaining relationships with vendors, conducting security assessments, and supporting security operations for onsite and offsite events.","description":"The Business Protection Team is Spotify’s corporate security team, providing security services to protect its staff and offices. \n\nThis team consists of operational teams as well as global specialist support functions. This role requires a protective security risk management practitioner who has experience working within a diverse, fast-paced tech/media organization and can demonstrate the ability to work independently and within a Global team!\n","requirements":[],"extras":[{"title":"What You'll Do:","content":["Promote a relaxed, but vigilant business protection culture closely aligned with Spotify’s business objectives that help to protect people, offices, assets and business processes","Establish and maintain a close and collaborative working relationship with multiple teams within Global Workspace Services (GWS) along with internal and external stakeholders","Set, drive and implement security strategy for operations throughout the region ensuring alignment with global policies and business needs","Ensure effective deployment of the strategy, working with site leadership and security teams to offer security support and solutions","Develop and operationalize Standard Operating Procedures (SOP) to continuously improve and refine security management in line with Business Protection’s policies","Maintain relationships with vendors including contracts to ensure effective delivery of technical and physical security services","Lead financial forecasts, budget and purchase orders for all security-related items","Conduct office security assessments and customize critical incident plans for offices","Support security operations for onsite and offsite events and activations","Support production safety requirements for Spotify Studios operations in LA","Provide safety and security briefings and training for employees","Drive the work and performance of security officer team leaders and the fleet of security officers with the provider based on service level agreement and key performance indicators","Handle the execution of security upgrade projects for offices","Work with the Technical Security Specialist and security systems vendors to manage and maintain access control systems.","Manage incidents independently, participate in crisis management with other stakeholders, manage and support the wider teams with incidents and support the other Business Protection Managers when required","Support global Business Protection strategy and initiatives through service ownership and project management","Keep up to date with current security issues and security industry trends relating to security risk management and physical security technology/systems"]},{"title":"Who You Are:","content":["3+ years experience in fields, like intelligence, incident management, crisis management, and/or risk management","Minimum bachelor's degree in intelligence analysis, political science, international relations or other subject areas deemed relevant","Demonstrate alignment to Spotify’s values of Innovative, Collaborative, Sincere, Playful and Passionate","Ability to speak and write in English fluently, proficiency in other language skills is preferable","Ability to work independently, prioritize and plan short- and long-term objectives","Ability to balance multiple challenging priorities in a fast-paced and changing environment with ability to quickly assess situations, prioritize issues, and make good decisions under pressure","Comfortable conducting security operations in a less and unnoticed way"]},{"title":"Where You'll Be:","content":["The role is an ‘in-office only’ role* based in Los Angeles, USA, primarily covering the LA office and supporting other smaller offices in the USA as required. The role reports to the Head of Operations."]}],"location_emoji":"🌍"}