{"title":"C++ Engineer, AdTech","location":["New York, NY"],"attendance":["Remote"],"type":["Permanent"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["C++","Testing","Metadata Fetching","Mobile Development","Networking","Automated Testing","User Experience"],"skills":["C++","testing","libraries","metadata fetching","caching","querying","automated testing"],"overview":"The C++ Engineer, AdTech position involves building a next generation advertising platform for audio and video, maintaining C++ tools and libraries for testing, and collaborating with data scientists to improve the user experience.","description":"Our mission on the Advertising Product & Technology team is to build a next generation advertising platform that aligns with our unique value proposition for audio and video. We work to scale the user experience for hundreds of millions of fans and hundreds of thousands of advertisers. This scale brings unique challenges as well as tremendous opportunities for our artists and creators.\n\nWe seek a C++ engineer to join the ad timing and delivery team for music and podcasts. Our team supports Spotify Engineers by providing the libraries and environments required to enable good testing practices. \n","requirements":[],"extras":[{"title":"What You'll Do","content":["Help our squad own and maintain the C++ tools and libraries required to enable teams to test the C++ code they write","Become a subject matter expert with regard to testing C++ code, and be able to assist others in testing their code effectively and efficiently","Support features with robust and flexible metadata fetching from backend, caching, and querying in the Spotify client","Contribute to the shared C++ library powering our mobile and desktop clients","Partner with Data Scientists to understand and improve user experience","Enable low latency playback even in the most ambitious network conditions","Make sure off lining content works optimally and intuitively","Ensure quality through automated testing"]},{"title":"Who You Are","content":["You have experience writing C++ code, including some experience testing","You are an advocate for code quality and want to enable people to produce high-quality, well-tested code.","You are interested in learning new things, always interested in expanding your breadth of knowledge as well as depth.","You may have some experience in other related domains, like mobile development, embedded programming, or even build infrastructure or testing infrastructure support","You have an interest in networking and data synchronization","Cooperation with others while solving sophisticated problems is natural for you and you really want to make a difference","End-user experience, high quality, agile values and modern engineering practices are what drives you"]},{"title":"Where You'll Be","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them!","Where in the world? For this role, it can be within the Americas region in which we have a work location","Prefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here.","Working hours? We operate within the Eastern Standard time zone for collaboration."]}],"location_emoji":"🇺🇸"}