{"title":"Campaign Manager Japan","location":["Tokyo"],"attendance":["Onsite"],"type":["Permanent"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Campaign Manager","Japan","Campaign Management","Advertising","Performance","Optimization","Client Needs"],"skills":["Ad Operations","Account Management","Campaign Management","digital media industry","technical foundations of digital media","programmatic media","digital strategy"],"overview":"A highly motivated individual is sought for the Campaign Manager Japan position based in Tokyo, Japan, responsible for the setup and execution of advertising campaigns across all channels, ensuring accurate performance and identifying optimization opportunities.","description":"Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.\n\nWe are looking for a highly motivated individual to join our Campaign Management team in Japan. In this role, you will be instrumental in the set up and execution of all advertising campaigns across all channels in the Japan market. You will ensure accurate pacing and performance throughout the campaign life cycle while identifying upsell and optimization opportunities. You will also be responsible for running all in-flight and post-campaign needs for clients. Above all, your work will impact the way the world experiences music!\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Partner with Account Management, Sales and all internal cross-functional teams to launch, run and fully deliver deals across all buying channels (Direct IO, PG, PMP and Podcasts)","Set up, lead and optimize direct and programmatic ad campaigns across multiple clients, platforms and technology partners","QA all creative prior to launching live campaigns, to ensure they are to spec, adhere to our policies and will work on the platform.","Support Deal ID, Programmatic Guaranteed management, deal health assessment and recommendations","Lead the daily management of all campaigns across direct and programmatic channels including but not limited to ongoing, comprehensive in-flight reporting, proactively identifying problem areas that might require a campaign revision","Proactively determine solutions to ensure revenue flow and incremental spend","Participate in campaign kick-offs to understand campaign objectives and critical metrics, ensuring effective and timely campaign execution","Daily monitoring of campaign pacing and performance","Serve as a partner for frontline sales support, across Direct and Programmatic","Provide technical expertise to troubleshoot all technical issues across measurement, targeting, DSPs or other identified areas, and raise to the appropriate internal cross-functional teams","Assist with billing needs and questions; lead invoice revision process when needed","Adhere to internal standard methodology guidelines, processes and an operating cadence as established by Spotify’s sales strategy","Fluent in 3rd party tracking vendors, including brand studies, viewability and other relevant industry technology players"]},{"title":"Who You Are","content":["You have a minimum of 2-3 years' proven experience in Ad Operations, Account Management or Campaign Management while also having solid digital media industry knowledge and a desire to learn more about the digital media industry","Previous knowledge in Ad Operations and the programmatic landscape especially with Google Ad Manager and/or another ad-serving platform, such as AdX, Rubicon, The Trade Desk is preferred but not required.","You understand the technical foundations of digital media, podcasts and programmatic media and have the ability to proactively determine solutions to problems","You are passionate about digital strategy and growing within the business operations or sales organizations","You have strong verbal, written, and presentation skills in both Japanese and English","You are a highly organized and focused multi-tasker with strong attention to detail, analytical and project management skills and can work independently within a team focused organization","You thrive in a fast-paced, deadline and detailed oriented environment","You believe in the power of teamwork and are a great teammate","You have excellent dexterity with Google and Microsoft suite of products including excel and powerpoint and have experience working within CRMs, Order Management Systems, Ad Servers and other digital media tech systems"]},{"title":"Where You'll Be","content":["This role is based in Tokyo, Japan"]}],"location_emoji":"🇯🇵"}