{"title":"Client Partner","location":["Brussels"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"6","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Ad Sales","Client Partner","Revenue Generation","Online Media","Product Knowledge","Relationship Building","Advertising","Campaign Execution","Brand Partnerships","Salesforce.com","Digital Media","Negotiation Skills","Presentation Skills","Pipeline Building","Goal Achievement","Reporting","French Language","Flemish Language","English Language"],"skills":["Salesforce.com","Sales","Media marketplace","Online sales","Negotiation skills","Presenting","Excel"],"overview":"The Client Partner position at Spotify's Sales team in Brussels involves selling creative solutions to clients and partners to shape the way the world experiences music and podcasts, with a focus on brand sell and revenue generation from various advertising formats, while maintaining relationships with media agencies and clients.","description":"Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.\n\nWe are looking for an outstanding Ad Sales Client Partner to join our launch team in Brussels. We’re looking for someone with a proven record of revenue generation and a deep interest and passion for online media and innovation. We want someone who loves our product and knows how to sell creative solutions for clients and partners. You should be confident without ever being arrogant and you work hard, but know how to have fun. Above all, your work will impact the way the world experiences music.\n","requirements":[],"extras":[{"title":"What you'll do","content":["Sell display advertising (video, mobile, programmatic), audio formats, and other ad space in order to grow advertising revenues by creating, maintaining, and sustaining relationships with media agencies, creative agencies, and clients directly","Work across multiple agency departments, i.e. radio, digital, branded content and innovation teams, to deliver successful campaigns","Coordinate with the communications planning team and strategic planners, account directors, and buyers to create successful ad campaigns","Partner with internal marketing, brand partnerships, and label relations teams to maximize revenue for Spotify and our partners","Focus on brand sell, educating and inspiring our clients to use Spotify to enhance their business","Meet and exceed advertising revenue goals","Attend weekly and monthly sales meetings as required","Represent Spotify at events and serve as a brand ambassador","Manage activity using salesforce.com"]},{"title":"Who you are","content":["You have strong knowledge of the Belgium digital media marketplace","You have 6+ years of experience in a media agency/online sales role","You have knowledge of online and offline media and have the ability to be creative with audio and digital client solutions","You have strong negotiation skills and the ability to present effectively and close the deal","You have the ability to build a pipeline and a proven track record of exceeding goals","You have dexterity in creating reports and presentations using Excel, PowerPoint, Keynote, etc.","You have a deep understanding of the digital ecosystem","You are a team player, smart, adapt well to change and have a positive attitude","You are able to work in a fast-paced, exciting environment and across external and internal teams to deliver creative, fresh campaigns","Fluent French, Flemish and English language, spoken and written is required","Please apply to this role with a cv/resume in English"]},{"title":"Where you'll be","content":["This role will be based out of the co-working office in Brussels."]}],"location_emoji":"🇧🇪"}