{"title":"Data Science Manager - Marketing","location":["New York, NY"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Marketing Analytics","Brand Marketing","Measurement","Data Analysis","Campaign Optimization","Data Visualization","Leadership"],"skills":["SQL","Python","R","A/B testing","Tableau","data visualizations","experimental design"],"overview":"The Data Science Manager - Marketing position at Spotify involves leading the Marketing Analytics team, providing analytical support to the global Brand Marketing team, and leading analytics engineering projects for the Marketing and Consumer Insights (MCI) team.","description":"Spotify is looking for a rockstar candidate to join the Marketing and Consumer Insights (MCI) team!  \n\nYou will support Spotify’s Marketing organization goal of building a globally loved brand and bringing the next generation of fans to Spotify. The primary duties of this role will be to lead the Marketing Analytics team in providing analytical support for our global Brand Marketing team. This means owning measurement of marketing’s ability to drive brand health and making recommendations to improve the effectiveness of marketing investments. \n\nYou will be a trusted partner to our Brand Marketers, ensure the Marketing Analytics team focuses their efforts on the most impactful initiatives, and manage the technical and professional development of 3 direct reports. \n\nYou will also lead analytics engineering projects that help the rest of the MCI team get the data they need to deliver their work\n","requirements":[],"extras":[{"title":"What you'll do","content":["Partner with Marketing leadership in strategy development, goal setting and budget planning","Perform analyses on large sets of data to extract actionable insights that will drive decisions around our global marketing investments","Provide end-to-end campaign support, from goal setting and measurement plan development, to in-campaign performance insights and optimization recommendations, and post-campaign evaluation and recommendations","Define experimentation roadmap to identify new growth opportunities for our marketing investments","Communicate data-driven insights and recommendations to non-technical audiences, through clear visualizations and presentations","Lead a small team of Data Scientists and Analytics Engineers in MCI’s pursuit of becoming a world leading insights team for our marketing partners","Partner with the other MCI leads and their teams on projects supporting Spotify’s broader marketing organization","Lead cross-functional groups of insights professionals (think market researchers, analysts, product insights) to triangulate information across various sources"]},{"title":"Who you are","content":["Intellectually curious, open-minded, and enjoy working in a fast changing environment","A natural communicator, who focuses just as much on the delivery and the “so what” of your insights, as you do on the technical craft of extracting them","Effective at building strong, influential relationships with colleagues and partners, with demonstrated success in delivering impactful insights to executives","10+ years of experience in an analytics and/or data science role, with 2+ years as a direct people manager","Strong analytical skills, including analysis and modeling of big data using SQL, Python and/or R, statistics, A/B testing, and experimental design required","Experience building data visualizations and dashboards (e.g., Tableau or similar BI solution)","Comfortable working on a globally distributed team"]},{"title":"Where you'll be","content":["This role is located in the New York Tri-state area or east coast of the United States"]}],"location_emoji":"🇺🇸"}