{"title":"Director of SMB Growth & Revenue Programs","location":["New York, NY"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["SMB Growth","Revenue Programs","Advertising Business","Client Acquisition","Retention","Customer Success","Growth Programs"],"skills":["SMB","growth","revenue","programs","advertising","business","client","acquisition","retention","outsourcing","team","analysts","customer success managers","advertiser segments","activation","new growth opportunities","customer insights","product and performance data","market trends","optimal business solutions","platforms","experimentation","optimization","cross-segment program strategies","business plans","measurement criteria","KPIs","data science","operations","marketing","ABI","communication","influence","executives","10+ years of experience","consulting","corporate strategy","marketing","product management","development","phasing out","high-growth consumer sectors","data-driven decision-making","simplifying complexity","communicating effectively","external partners","cross-functional teams","KPI-driven setting","data-driven strategies","New York","Los Angeles"],"overview":"The Director of SMB Growth & Revenue Programs at Spotify will oversee the development and implementation of tailored growth programs and revenue strategies for key advertiser segments globally, with a focus on achieving advertiser acquisition and retention goals.","description":"Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.\n\nAs the Director of SMB Growth & Revenue Programs at Spotify, you will oversee a multifaceted role aimed at driving the growth of our advertising business within the SMB (small and medium-sized business) sector. Your mission is to develop and implement tailored growth programs and revenue strategies for key advertiser segments globally, ensuring both client acquisition and retention.\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Take full ownership of unmanaged revenue for SMB on a global scale.","Lead our Global SMB outsourcing operations.","Build and lead a team of Program Analysts and Customer Success Managers.","Develop and implement growth programs for key advertiser segments globally, with a focus on achieving advertiser acquisition, activation, and retention goals.","Identify new growth opportunities by using customer insights, product and performance data, market trends, and growth best practices.","Plan, test, and scale programs to drive the adoption of business solutions across Spotify's platforms, emphasizing experimentation and optimization.","Lead cross-segment program strategies from ideation to goal attainment, including the development of business plans, customer and market insights, and program effectiveness analysis.","Establish performance measurement criteria and KPIs to track progress toward business growth objectives, presenting results and recommendations based on program performance.","Lead and collaborate with functions like Data Science, Operations, Marketing, and ABI to analyze program effectiveness, design experimentation frameworks, and promote customer-centricity.","Drive effective communication and influence a broad range of cross-functional partners, including executives."]},{"title":"Who You Are","content":["10+ years of experience in growth, consulting, corporate strategy, marketing, or product management.","Experience in developing, growing, and phasing out growth marketing or initiatives, especially within the SMB or high-growth consumer sectors.","Proven track record in driving complex, multi-geography programs that emphasize data-driven decision-making.","Strong ability to simplify complexity and communicate effectively with both business and technical executives, as well as external partners.","Experience leading cross-functional teams in a KPI-driven setting, with a focus on data-driven and people-informed strategies."]},{"title":"Where You Will Be","content":["This position will be based in New York or Los Angeles"]}],"location_emoji":"🌍"}