{"title":"Global Head of Sales - Backstage Commercialization","location":["New York, NY"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Sales Leadership","B2B Sales","Developer Tooling","Open Source","Product Vision","Business Development","Team Leadership"],"skills":["Backstage","developer experience","B2B","software products","open source","B2B business","sales"],"overview":"This role is seeking an experienced sales leader to guide Spotify’s Backstage Commercialization team in building a scaled business on one of the industry-leading developer experiences and open source platforms.","description":"The Platform team builds the technology that enables Spotify Product Development teams to learn quickly and scale easily, enabling rapid growth in our users and our business around the globe. Spanning many fields, we work to make the business work; creating the frameworks, capabilities and tools needed to welcome a billion customers.\nThe team continues to strive to be a leading force in the developer experience space with products such as Backstage and other developer tools, and to become a top regarded technology industry leader.  In 2022, we successfully embarked on our journey to share that technology and experience commercially beyond Spotify’s internal business lines.  \nWe are looking for an experienced sales leader to guide Spotify’s Backstage Commercialization team - working on the opportunity to create the next trusted platform for delivering B2B developer experience software. This is an outstanding chance to build a scaled business on one of the industry-leading developer experiences and open source platforms. Join us and lead the path forward to amplify productivity, quality and innovation across Spotify and the developer.\n\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Scale a fledgling developer experience focused B2B business line up to hundreds of millions of dollars in ARR.","Lead and grow a high-paced team of sales, partnerships, customer service and business development professionals.","Refine and continuously iterate on the product and portfolio vision for an expanding set of software products that capitalize on Spotify’s technology industry leadership and tech pipeline.","Refine and execute on the initial go-to-market strategy and develop additional GTM expansions.","Continue to build external partnerships that enable the business model and improve Spotify's gross margins.","Leadership and people management, with the ability to rapidly build and scale teams, lead and inspire others to navigate gaps and ambiguity, supported by a strong internal circle of sponsors."]},{"title":"Who You Are","content":["An Experienced B2B business sales leader, with extensive experience leading product and company initiatives within the developer tooling and open source ecosystem.","Passionate about solving customer needs.","Visionary leader able to lead and inspire a sales team to deliver exceptional results.","Experience overseeing sales and customer success functions.","Demonstrated knowledge within the developer tooling space with a thorough understanding of open source, open core architecture and commercializing products.","Solid eye for business, with deep understanding of the nuances of different business models (B2B, SaaS, cloud marketplaces), business life cycles, and how to measure those.","Entrepreneurial experience, an MBA, or equivalent experience.","Clear understanding across all aspects of the software development lifecycle, with deep familiarity with the types of tools, practices and infrastructure that support it.","Natural collaborator, excelling at bringing people together outside of your core team, navigating the dependencies and requirements across the Platform organization and Spotify."]},{"title":"Where You'll Be","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them","Where in the world? For this role, it can be within the Americas region in which we have a work location and is within working hours.","Working hours? We operate within the Eastern Standard Time zone for collaboration and ask that all team members be located in that time zone.","Prefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here."]}],"location_emoji":"🇺🇸"}