{"title":"Government Affairs Lead, Latin America","location":["São Paulo"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Government Affairs","Latin America","Policy Landscape","Advocacy","Public Policy","Advocacy Strategies","Consultants"],"skills":["Brazil","Latin America","Portuguese","Spanish","English","public policy","advocacy strategies"],"overview":"The Government Affairs Lead, Latin America position at Spotify in São Paulo is responsible for advocating on the company's behalf on critical policy issues, representing the company before legislators and regulators, and developing effective advocacy strategies for the Latin America market.","description":"We are seeking a dynamic, hard-working, strategic candidate to join Spotify’s Global Government Affairs team in São Paulo as a Government Affairs Lead, Latin America.\n\nThe Government Affairs team is charged with understanding the global and local policy landscape in relation to Spotify’s business objectives and advocating on the company’s behalf on critical issues. One of our key roles is to promote Spotify’s ability to compete fairly and grow as a business by informing public policies. We represent the company before legislators and regulators, see around corners, and mitigate potential risks.\n\nThe Manager of Latin America Government Affairs will work as part of the global government affairs team, coordinating closely with subject matter experts on the team, as well as other groups throughout Spotify in order to develop thoughtful, effective, consistent positions on the issues of greatest importance to our company. \n\nThis position will report to the Head of Global Government Affairs and will be located in our São Paulo, Brazil office.\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Engage regularly with policymakers with a focus on Brazil, including the National Congress and relevant executive agencies, and in other key Latin America markets","Work on the priority public policy issues affecting Spotify in Latin America – including music, competition, content moderation and more – and develop and implement effective advocacy strategies","Work closely with other groups and departments inside Spotify -- including legal, communications, social impact, product teams, compliance and trust and safety -- to understand the priorities of internal partners, and create approaches to key policy issues that advance the interests of Spotify","Direct the work of consultants to advance Spotify’s goals","Drive engagement, partnerships, and thought leadership on key public policy issues with external organizations such as trade associations and civil society organizations"]},{"title":"Who You Are","content":["Fluency in Portuguese, Spanish, and English","7+ years of direct experience developing and implementing public policy strategies and interacting professionally in a public policy environment","Bachelor's degree or higher","Experience working in government, for a company, and/or a trade association","Experience developing and implementing public policy strategies in the technology sector","Experience dealing with music policy issues is advantageous","Experience working with senior government officials, private sector leaders, and other public policy professionals","Outstanding existing relationships and the ability to build new ones with Congress, relevant executive agencies, peers at Spotify and in other companies, and more","Demonstrated ability to develop innovative and pragmatic approaches and business-focused solutions to regulatory and legislative challenges and developments","A track record of effective advocacy before government officials","A readiness to dive in to solve problems and think strategically","Ability to build diverse, cross-functional, and multi-level relationships and experience advising and interacting with senior policymakers and business executives","Able to travel to Brasília, Miami, and elsewhere as needed","Ability to work across time zones and cultures","Excellent interpersonal skills, with an absolute commitment to professionalism and collegiality, and a high degree of integrity","Outstanding written and oral communications skills"]},{"title":"Where You'll Be","content":["This is a hybrid role based in our São Paulo, Brazil offices"]}],"location_emoji":"🌍"}