{"title":"Head of Market Strategy & Operations South Korea","location":["Seoul"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"12","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Strategy Formulation","Operational Planning","Cross-Functional Projects","Market Insights","Relationship Building","Budget Management","Operating Systems"],"skills":["strategy formulation","operational planning","market analysis","business reviews","data analysis","data modeling","Keynote/Powerpoint"],"overview":"The Head of Market Strategy & Operations South Korea position at Spotify is responsible for formulating strategy and operational planning, coordinating local operations, managing cross-functional projects, and providing market insights and building relationships in South Korea and across the Asia Pacific region.","description":"The Spotify Business team is responsible for running Spotify’s performance across all business-relevant metrics. As we further expand in South Korea and seek to better innovate and align across multiple functions, we are seeking a highly strategic and operational leader to join our business leadership team who will scale, consolidate and support our business efforts in South Korea. \n\nBased in Seoul, as the Head of MSO for South Korea, you will be responsible for strategy formulation and operational planning, coordinating local operations and managing cross-functional projects by providing deep market and cultural insights and building strong relationships with the functional leadership in South Korea and across the Asia Pacific region. In this position, you will work closely with local functional leadership and directly report to the Managing Director for the region.  \nThe role is an outstanding opportunity to build a market business and drive the next wave of growth at Spotify, the world's most popular audio streaming subscription service.  \n","requirements":[],"extras":[{"title":"What You'll Do","content":["Develop the long term strategy and annual business plans","Evaluate and execute on strategic market opportunitiesIdentify and coordinate “bets” for growth and differentiation","Identify and solve operational problems with practical and creative approaches","Collaborate closely with local business leadership and regional and global teams","Step in and implement alongside or in place of functions when needed","Manage the budget for the Korea team activities, ensuring compliance with forecasts","Drive operating rhythm by building efficiencies and removing obstacles Set up and improve operating systems and processes","Provide functions with insights and knowledge needed to drive progress and decisions Ensure communication and collaboration between all functions, including Podcast, Music, Marketing, PR, Business Development and the Growth team","Coach and mentor team members and help develop talent from good to great","Provide Seoul office leadership to ensure clarity of purpose, speed of delivery and empowerment to execute on opportunities and deliverables","Manage the business planning process and performance follow-up on both annual and quarterly cadences","Manage the Quarterly Business Review process, including the reporting for the Korea business but also facilitating a cross-functional assessment across other business units","Contribute to and review quarterly forecasts for business metrics including but not limited to Monthly Active Users and Subscribers","Monitor and gather insight on ongoing business performance, including business metrics but also market trends, competitor insights, etc.","Own the process, framework, and output of market analysis and business reviews, tracking of regional budgets and initiatives as part of the business plan overall."]},{"title":"Who You Are","content":["You bring a minimum of 12 years experience in proven strategy and operations or direct consulting related work","Deep experience in growth stage internet or a media company","Passionate and have a deep understanding of the technology, music and audio spaces","Experience working in a multinational company with diverse functions and cultures","Equally comfortable analyzing data, coordinating internal events, speaking to partners, or negotiating a deal","Ability to craft vision, strategy and problem solving, able to transform goals into meaningful plans and coordinating multiple teams towards achieving a common goal","Rapid and effective decision-making skills in a fast paced cross cultural environment","Ability to learn new concepts, technologies, and businesses quickly","Maintain balance between attention to detail and swift execution","Strong interpersonal skills with demonstrated ability to work effectively cross-functionally","Experience in coaching and leading teams and inspiring high performance units","Excellent communicator who is able to network and develop relationships across the org, expert in data analysis, data modeling, Keynote/Powerpoint, Excel","Sound presentation skills and ability to build concise and illustrative presentations","Ability to persuade and influence internal and external stakeholders","Genuine, confident, flexible and fun attitude","You thrive from working in a constantly-changing but always-exciting environment!","Bilingual in English and Korean"]},{"title":"Where You'll Be","content":["You will be based in Seoul, South Korea"]}],"location_emoji":"🇰🇷"}