{"title":"Machine Learning Engineering Manager - Amplify","location":["New York, NY"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Machine Learning","Engineering Manager","Amplify","Team Leadership","Project Management","Technical Guidance","Machine Learning Systems"],"skills":["Machine Learning","Engineering Manager","Amplify","Machine Learning Engineers","Eastern Standard/Daylight time zones","Product counterparts","technical vision","machine learning systems","PhD level expertise","quantitative field","management experience","mentoring","collaborative teams","data-driven development","reliability","responsible experimentation","industry trends","Ad domain expertise","distributed workforce","US region","working hours","office","Work From Anywhere options"],"overview":"The Machine Learning Engineering Manager - Amplify position is responsible for leading a team of Machine Learning Engineers to predict advertiser outcomes, collaborating with Product counterparts, and contributing to the development of machine learning systems.","description":"Our mission on the Advertising Product & Technology team is to build a next generation advertising platform that aligns with our unique value proposition for audio and video. We work to scale the user experience for hundreds of millions of fans and hundreds of thousands of advertisers. This scale brings unique challenges as well as tremendous opportunities for our artists and creators.\n\nWe are seeking a passionate Engineering Manager with deep machine learning expertise and strong leadership skills to lead a team that predicts advertiser outcomes – a central piece of Spotify’s ad strategy. We ask that our team members are both capable and willing to work within the Eastern Standard/Daylight time zones during our collaborative hours.\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Lead, mentor, and nurture a team of highly skilled Machine Learning Engineers, fostering a positive and productive work environment.","Provide technical guidance in machine learning, helping each engineer find the best direction for their work, spotting lurking problems, highlighting promising directions, and focusing the team’s efforts where they are most likely to succeed","Collaborate closely with Product counterparts to drive effective leadership and align our efforts with the broader group's goals.","Learn and use knowledge of the ad industry to expand your influence and vision beyond our immediate team","Contribute to the development of the technical vision and strategy for the machine learning systems powering our free product, which boasts over 300 million monthly active users.","Inspire, manage and lead the engineering culture of our group, so we can achieve our mission"]},{"title":"Who You Are","content":["You have PhD level expertise in a quantitative field and excitement about machine learning","You can draw on substantial depth and breadth of management experience to lead and grow a machine learning team","You have experience and passion for mentoring and encouraging collaborative teams and drawing out contributions from a variety of team members","You are continuously curious and learning as a leader","You care about data-driven development, reliability, and responsible experimentation","You’re familiar with the industry trends and can understand trade-offs of existing solutions","Ad domain expertise is a plus"]},{"title":"Where You'll Be","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them!","Where in the world? For this role, it can be within the US region in which we have a work location and is within working hours.","Working hours? We operate within the Eastern US time zones for collaboration and ask that all be located in that time zone.","Prefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here."]}],"location_emoji":"🇺🇸"}