{"title":"Manager - Ads Strategy & Business Development","location":["New York, NY"],"attendance":["Onsite"],"type":["Permanent"],"experience":"4","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Manager","Ads Strategy","Business Development","Advertising","Strategic Planning","Data Analysis","Presentations"],"skills":["strategic planning","business development","market analysis","presentation design","competitive analysis","strategic alignment","business models"],"overview":"The Manager - Ads Strategy & Business Development role in New York supports the senior executive team, identifies and evaluates business growth opportunities, and helps with strategic planning projects and processes.","description":"We're looking for a Manager to join the Advertising Strategy and Business Development team!\n\nThis role will serve as a key resource to the senior executive team for the Ads Business Unit. The role spans across Spotify’s Music, Podcasts and Ads functions and will help identify, evaluate and support operationalizing business growth opportunities. The role is an outstanding opportunity to deeply immerse oneself in the advertising side of the music and audio streaming industry!\n\nThe position will be based in New York and will report into the Associate Director for Ads Strategy and Business Development. \n","requirements":[],"extras":[{"title":"What you'll do","content":["Support strategic planning projects and processes by developing multi-year strategic plans to grow our existing businesses","Identify and develop plans for new business opportunities","Build data-driven, scenario-based models to evaluate business impact of all types of strategic and business development initiatives (e.g., new business models, partnerships, etc.)","Design succinct and impactful presentations and memos for Global Head of Advertising Business and Platform, Head of Podcast Business and more","Identify and assess key market and competitive trends","Work closely with cross-functional teams to ensure strategic alignment"]},{"title":"Who you are","content":["4+ years of experience in top management consulting firm or corporate strategy or business development role","Experience in tech, media or advertising industries, preferably in strategy, business ops or corporate/business development role","Passionate and knowledgeable about media and entertainment business and relevant business models","A strategic and creative problem solver with ability to transform goals into useful plans","Experience supporting strategy projects and developing implementation plans","Comfortable maintaining balance between attention to detail and swift execution","Excel in getting into the details and solving complex problems","Bring knowledge of building sophisticated, multi-year business plan models","You are an excellent written and verbal communicator","Passionate about networking and developing deep relationships across the organization"]},{"title":"Where you'll be","content":["This role is based in New York, NY"]}],"location_emoji":"🇺🇸"}