{"title":"Market Development Manager MENA","location":["Dubai"],"attendance":["Hybrid"],"type":["Full Time Contractor"],"experience":"12","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Market Development Manager MENA","Go-To-Market Planning","Saudi Arabia","Strategic Partnerships","Data Analysis","Cross-Functional Projects","Brand Growth"],"skills":["Market Development Manager MENA","Saudi Arabia","go-to-market planning","strategic partnerships","networking","performance monitoring","data analysis"],"overview":"The Market Development Manager MENA position is responsible for leading the go-to-market planning for Spotify in Saudi Arabia, managing cross-functional projects, and expanding the company's market presence in the region.","description":"The Spotify Saudi Arabia team is looking for an expert Market Development Manager to support growth objectives in the market. Working closely with regional leadership, you will be responsible for owning the go-to-market planning for Saudi Arabia. In this role you will be the Saudi Arabia market expert, managing cross-functional projects and using your network and experience to expand Spotify’s market presence in this key market. In this position, you will work closely with local functional leadership and report to the Head of Market Strategy Operations (MSO), MENASAS who will lead regional strategy. The role is based in Saudi Arabia. \n","requirements":[],"extras":[{"title":"What You'll Do","content":["Lead the initiative of growing Spotify’s presence in Saudi Arabia","Stay updated on industry trends, competitor activities, and market developments to identify new opportunities. Understand, articulate & action on industry movements & opportunities","Be the focal point for regional strategic partnerships with the goal to accelerate Spotify’s brand & commercial growth in the region","Through your existing network, introduce relevant partners to Spotify that align with company brand values and business goals","Monitor performance, analyze data, and provide regular reports and insights to internal partners","Act as a strategic partner of the managing & leadership team, working closely to align workstreams, and to optimize plans towards market growth priorities. Ensure communication and alignment between all key functions (local & global), including Human R, Content Operations, Payments, Finance, Advertisements, Marketing, Public Relation etc","Be the central contact for global teams on new market initiatives, leveraging experienced knowledge of Saudi Arabia to increase the impact —and assure local relevance—of planning, prioritization & implementation","Identify and solve internal operational challenges and opportunities-for- improvement. Ensure the efficiency of the market's business operations & processes, across functions. Establish frameworks that promote Spotify’s mission, culture & values in the market","Elaborate learning agenda for key critical initiatives, interpret results, prepare presentations and communicate findings to local leadership and the broader organization","Support or, at times, step in to lead key strategic or operational initiatives critical to the local market’s growth","Be a senior leader disseminating the Spotify culture, crafting an environment to encourage and empower cross functional teams locally"]},{"title":"Who You Are","content":["You have at least 12 years of experience in digital and/or TMT (Tech-Media-Telecom) industries. Preferably having worked with, both, established global players and early-stage startups","Partnerships, business development and or strategy consulting experience preferred","Extensive Saudi Arabia experience is a must as well as a strong professional network within the relevant industry bodies","Shown experience in Go-To-Market (GTM) planning and working with an international team","Generalist abilities that is equally comfortable analyzing data, orchestrating events, leading sophisticated projects or negotiating a deal with C-Level decision makers","Shown results demonstrating thought leadership and business judgment, developing and interpreting deep data analysis and communicating detailed analysis and insights with simplicity, clarity, and confidence","Organized, process-driven strategic problem solver","Media Trained; experience communicating with press, media in both English & Arabic","Ability to learn new concepts, technologies, and businesses quickly and produce quality work in short time-frames","Proficient in English and Arabic","Genuine, confident, flexible and thrive in a constantly changing environment"]},{"title":"Where You'll Be","content":["This position is available through a third party and you will be based in Saudi Arabia"]}],"location_emoji":"🇦🇪"}