{"title":"Partnerships & Business Development Manager, India","location":["Mumbai"],"attendance":["Onsite"],"type":["Permanent"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Partnerships & Business Development","India","Ad Tech","Business Development","Ad Sales","Online Media","Data"],"skills":["ad tech ecosystem","business development","online media","data","ad tech vendors","DSPs","SSPs"],"overview":"The Partnerships & Business Development Manager, India will be responsible for local partnership development, executing partnerships and deals, collaborating with teams and partners, and traveling to meet with stakeholders. They should have at least 10 years of experience in ad tech and/or digital media sales, a deep understanding of the digital ecosystem, and the ability to nurture senior relationships and think creatively.","description":"Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.\n\nAt Spotify, we’re passionate about providing the right audio content for every moment. We’ve connected millions of people to their favorite songs and podcasts, and built a service that people use to discover and share the content they love. This is a phenomenal opportunity to join Spotify’s International Partnerships & Business Development team! We are looking for an outstanding Partnerships Account Manager to support the growing Ad Sales team. This role will own local partnership development in India.\n\nWe’re looking for someone with understanding of the ad tech ecosystem and a proven track record in business development with the ability to work cross functionally, a passion for online media, data and loves our product!\n\n","requirements":[],"extras":[{"title":"What You'll Do","content":["This person will be responsible for local partnership development.","Working with ad tech vendors such as DSPs, SSPs, measurement etc, new partner ventures and supporting the Senior Manager, Business Development, JAPAC strategic partnerships in the region, as part of the wider International Business Development Strategy","Delivering from start to finish on partnerships and deal execution","Collaborate with teams and partners to establish effective Ways of Working","Some travel will be required to meet with Partners & stakeholders (20% of the time)"]},{"title":"Who You Are","content":["Have at least +10 years experience in ad tech and/or digital media sales role.","Have a deep understanding of the digital ecosystem and trends around publishers and podcasts, best practices, opportunities, and challenges","Nurture and grow senior relationships with partners and clients","You have the ability to think outside of the box with a solutions oriented mindset","A great teammate, smart, adapt well with change and have a positive attitude","Able to work in a fast-paced, exciting environment and across external and internal teams to deliver","English language, spoken and written is required"]}],"location_emoji":"🇮🇳"}