{"title":"Producer, Audiobook Production","location":["New York, NY"],"attendance":["Remote"],"type":["Permanent"],"experience":"5-7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Audiobook Production","Leadership","Project Management","Data Management","Budget Management","Vendor Management","Brand Guidelines"],"skills":["audiobook production","project management software","vendor management","SOWs","creative agency","integrated brand campaigns","audiobook production process"],"overview":"The Producer, Audiobook Production position at Spotify Publishing Partnership Team is looking for an experienced and organized individual to manage audiobook production projects, coordinate internal and external parties, and deliver work adhering to Spotify brand guidelines.","description":"Spotify Publishing Partnership Team is looking for a collaborative, organized, and experienced audiobook producer with proven leadership skills to join our team. This individual should have a clear understanding of the efforts required to produce a high quality audiobook. This position requires significant experience managing audiobook production project through the various stages of the production (pre-production, casting, recording, QC, and engineering). \n\nThis candidate is an expert in coordinating internal and external parties, capable of managing multiple productions simultaneously, updating data within project management software, and the ability to adapt to unexpected changes during the production process \nThis candidate should have thorough experience in working with external vendors, crafting SOWs with a clearly defined scope, budget and schedule. The Producer must deliver work that is on strategy and adheres to Spotify brand guidelines. This includes following Spotify’s processes and policies throughout the production lifespan, from scoping to wrap and financial tracking.\n\nSuccess in this role will come from someone who is an inspirational leader in making content that can move our collective mission forward; and is creative, adaptive, entrepreneurial and enterprising. \n","requirements":[],"extras":[{"title":"What you'll do","content":["Briefing, leading, and organizing teams – both internal and external","Adhering to Spotify’s production process, project management and trafficking of assets","Defining project scopes, milestones and deliverables","Leading contract negotiations and ensure that all appropriate paperwork is in place","Managing budgets and internal and external resources effectively"]},{"title":"Who you are","content":["5-7+ years in a production role within a brand or creative agency","Experience producing multi-channel integrated brand campaigns","Ability to work efficiently in a high-pressure, deadline driven environment.","Superior experience and understanding of the audiobook production process.","Must be an intuitive, entrepreneurial, flexible self-starter."]},{"title":"Where you'll be","content":["We’ve introduced Work From Anywhere to give you more options!","While we will ask you to pop into the office from time to time, we are giving you the flexibility to work from home should you choose to do so.","Working hours? We operate within the EST time zone for collaboration."]}],"location_emoji":"🇺🇸"}