{"title":"Regional Client Partner, Singapore","location":["Singapore"],"attendance":["Onsite"],"type":["Permanent"],"experience":"8 - 10 ","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Regional Client Partner","Singapore","Sales","Advertising Sales","Revenue","Brands","Clients"],"skills":["Salesforce","digital media","programmatic advertising","Excel","PowerPoint","Keynote","Salesforce"],"overview":"The Regional Client Partner, Singapore position involves driving revenue through engaging with regional clients and agencies, selling Spotify ad products, and delivering successful campaigns.","description":"Sell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts.\n\n\nWe are looking for a Regional Client Partner to join our Advertising Sales team, to manage our sales initiatives in the Southeast Asia region.\n\nWe want someone who loves our product and wakes up every morning happy to interact with our clients. You should be confident without ever being arrogant. You work hard, but know how to have fun. You should also exhibit a growth mindset that can rise above any challenges. \n\nMost importantly, your work will impact the way Brands connect with the Spotify users!\n\nThis position will be based in Singapore and reporting to the Director of Sales SEA.\n\n","requirements":[],"extras":[{"title":"What You'll Do","content":["As a regional client partner, you will focus on SG based regionally headquarters of large multinational companies. The primary responsibility will be to drive in market local revenue by engaging with regional client and agency stakeholders based in Singapore","As a regional client partner, you will be responsible to drive revenue from brands by educating and inspiring our clients to use Spotify to enhance their business","Sell Spotify ad products including audio, video and branded partnerships in order to grow advertising revenue","Work across multiple agency departments, i.e. programmatic, offline and digital, branded content and innovation teams, to deliver successful and effective campaigns","Monitor and execute potential upsell opportunities. Meet and exceed advertising revenue goals","Partner with internal marketing, brand partnerships, and label relations teams to maximize revenue for Spotify and our partners","Conduct industry analysis and preparing sales and customers materials","Translate audience data into insights and unique selling points using a broad range of 3rd party data sources (GWI, ComScore, or similar) in close collaboration with Business Marketing and other functions","Respond to RFPs and deliver world class media proposals","Work with Account and Campaign Management team to monitor campaign performance, recommend optimisations, and ensure campaign delivery","Provide customers with 1st and 3rd party post-campaign reporting","Represent Spotify at events and serve as a brand ambassador at all times.","Diligent in managing all sales activity using salesforce.com on a regular basis and reporting your patch of business"]},{"title":"Who You Are","content":["A minimum of 8 - 10+ years of experience in either media agency, media owner/publisher, client management or sales role","You have a strong knowledge of the SEA digital media marketplace and the existing relationship with all levels of the agencies; direct brands will be a major plus point","Knowledge of online and offline media planning and buying ecosystem including programmatic advertising and have the ability to be creative with audio and digital client solutions","You are obsessed with customer satisfaction with a proven track record to build internal and external relationships","Ability to deliver on multiple priorities with attention to detail despite tight deadlines","Analytical with a consistent record to think strategically and creatively","You have dexterity in creating reports and presentations using Excel, PowerPoint and Keynote; experience of Salesforce, DSM and DFP is a plus","A strong team player, smart, adapts well with change and has a positive attitude","You have strong negotiation skills and are able present effectively and close the deal","You are able to work in a fast-paced, exciting environment and across external and internal teams to deliver creative, fresh campaigns"]},{"title":"Where You'll Be","content":["You will work out of Singapore office"]}],"location_emoji":"🇸🇬"}