{"title":"Senior Product Manager - Personalization - Talk Audio","location":["New York, NY"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Manager","Personalization","Talk Audio","Recommendations","Data Products","Roadmap","Metrics"],"skills":["Product Manager","Talk Audio","building capabilities","understand talk audio content","deliver relevant podcast","audiobook recommendations","models and data products","represent talk content","users","relationships","relevant and delightful personalized experience","vision","roadmap","audience","strategic needs","user needs","alignment","company’s short- and long-term goals","technical platform scalability","metrics","KPIs","success","team builds","5+ years of experience","ML-driven products","teams of designers","engineers","data scientists","proven impact","hard data-informed decisions","A/B testing","experimentation","data analysis","metrics","intuitions","deep analytical thinking","systems-level thinking","building products","rapidly changing landscape","sorting out ambiguity","inspire","motivate","support a team","working hours","Americas region","work location","Eastern Standard time zone","office","Work From Anywhere options"],"overview":"The Senior Product Manager - Personalization - Talk Audio position at Spotify is responsible for building capabilities to understand talk audio content in order to deliver relevant podcast and audiobook recommendations to millions of users.","description":"The Personalization team makes deciding what to play next easier and more enjoyable for every listener. From Blend to Discover Weekly, we’re behind some of Spotify’s most-loved features. We built them by understanding the world of music and podcasts better than anyone else. Join us and you’ll keep millions of users listening by making great recommendations to each and every one of them. We ask that our team members be physically located in Central European time or Eastern Standard/Daylight time zones for the purposes of our collaboration hours.\n\nWe are looking for a passionate Product Manager to join Spotify’s Personalization, Talk Audio team. In this role, you’ll be responsible for building capabilities that allow us to understand talk audio content to deliver relevant podcast and audiobook recommendations to hundreds of millions of users. This includes models and data products that can represent talk content and users as well as their relationships to ensure a relevant and delightful personalized experience.\n","requirements":[],"extras":[{"title":"What you'll do","content":["Define and drive the vision for the talk audio personalization.","Build a roadmap for the team by understanding our audience and the strategic needs for talk audio recommendations, using data insights and working closely with stakeholders.","Prioritize new features based on user needs, alignment with the company’s short- and long-term goals, and technical platform scalability.","Define metrics and KPIs we will use to measure the success of the features your team builds."]},{"title":"Who you are","content":["You have 5+ years of experience in building and shipping ML-driven products at scale together with teams of designers, engineers and data scientists.","You have delivered projects that have shown proven impact for your business.","You are experienced in making hard data-informed decisions (A/B testing and experimentation, data analysis, defining metrics).","You have developed intuitions but match that with deep analytical thinking and systems-level thinking to focus on the things that matter most and build long-lasting platform products.","You are passionate about building products in a rapidly changing landscape and good at sorting out ambiguity","You know how to inspire, motivate and support a team to get things done.","Nice to have: Past experience working with audio content product recommendations or language technologies would be a huge plus."]},{"title":"Where you'll be","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them!","Where in the world? For this role, it can be within the Americas region in which we have a work location and is within working hours: https://lifeatspotify.com/locations","Working hours? We operate within the Eastern Standard time zone for collaboration and ask that all be located in that time zone.","Prefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here."]}],"location_emoji":"🌍"}