{"title":"Senior Manager - Cloud FinOps and Cost Engineering","location":["London"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"4","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Cloud FinOps","Cost Engineering","Cloud Cost Optimization","Team Leadership","Cloud Economics","Cloud Financial Engineering","Cost Transparency"],"skills":["Cloud FinOps","Cost Engineering","Cloud Cost Optimization","Cloud Economics","Cost allocation model","Google Compute Platform","Public cloud"],"overview":"This role requires a Senior Manager with Cloud FinOps experience to lead the Cost Engineering team at Spotify's Technology Procurement function, partnering with engineering, finance, and vendors to provide insights and advice on infrastructure and managed services to optimize streaming delivery costs and drive cost savings.","description":"The Platform team creates the technology that enables Spotify to learn quickly and scale easily, enabling rapid growth in our users and our business around the globe. Spanning many disciplines, we work to make the business work; creating the frameworks, capabilities and tools needed to welcome a billion customers. Join us and help to amplify productivity, quality and innovation across Spotify.\n\nSpotify's Technology Procurement function, part of our Platform Mission, is hiring a Senior Manager with Cloud FinOps experience to lead the Cost Engineering team. This team enables us to constructively support hyper-scale usage and growth in close collaboration with engineering, bridging the world of finance and tech. The mission enables our R&D, procurement, financial functions and vendors to make well-informed decisions about infrastructure and managed services by providing insights and advice regarding how to use and develop our partnerships.\n\nCost Engineering is our newest product area under Technology Procurement. The team is expected to:\n\nDeliver cultural change across Spotify to optimize Streaming Delivery Costs Advocate for Cloud Cost practices in the organization through education, standardization, and cultural growth and support\n\nReinforce confidence around budgets, spend predictability and forecasts across R&D\n\nQuickly bring new, high-quality cost & climate tooling products and features to our users, promoting and increasing adoption \n\nProvide guidance to engineering teams to have a cost-effective application/service by identifying anomalies and best practices.\n\nWork together with engineering teams to identify rate reductions and possible cost avoidance\nAccurately budget, forecast, and report cloud costs to Finance and the BoD\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Lead a team of analysts, data scientists and engineers specialized in Cloud FinOps, Cloud Economics, Cloud Financial Engineering, or Cloud Cost Optimization concepts.","Be a valued technical leader in an agile environment, within our Platform division, and Spotify in general.","Lead and enable the vision and long-term strategy for Cost Engineering at Spotify.","You will partner closely with Engineering across R&D and beyond to build a strong strategy for balanced cost across the organization.","You will partner with Finance, Engineering, and Product leaders across Platform and Spotify to enable large-scale collaboration on cost infrastructure projects.","Drive accountability to engineering teams that are responsible for the application/services/infrastructure.","Enable learning and knowledge sharing across the organization, leveling up our engineering and insights practices and mentoring other leads.","Create an industry-leading cost allocation model to drive and advise product and market-based decisions","Develop and mentor product management disciplines within the team to create value to our internal and external customers."]},{"title":"Who You Are","content":["You have been a leader of a cost engineering organization driving significant impact for cloud cost optimization.","Proven experience as a people manager who has led and built an effective team with members working remotely across different countries and time zones.","You know how to partner with Technology Sourcing/Procurement, Vendor Management, and how to find opportunities to collaborate and extract value from our public cloud partners","You have experience of partnering closely with FP&A to ensure cost transparency and accurate cost allocation","You have experience collaborating with engineers on cloud cost-reduction programs; and promoting a persistent culture of cost savings and optimization","Experience with public cloud is a must and knowing Google Compute Platform is a plus."]},{"title":"Where You'll Be","content":["Where in the world? This role will be located in the UK","Working hours? We operate within Central Europe for collaboration and ask that all be located in that time zone."]}],"location_emoji":"🇬🇧"}