{"title":"Senior Product Designer - Spotify Advertising","location":["New York, NY"],"attendance":["Remote"],"type":["Permanent"],"experience":"7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["UX Design","Digital Marketing","Website Design","User Research","Competitive Analysis","Presentation Skills","Collaboration"],"skills":["UX design","front-end development","competitive analysis","user research","web design efficiency","B2B","ecommerce websites"],"overview":"The Senior Product Designer - Spotify Advertising position involves designing outstanding user experiences for core digital marketing products, collaborating with cross-functional teams, and leveraging user data for design decisions.","description":"Our mission on the Advertising Product & Technology team is to build a next generation advertising platform that aligns with our unique value proposition for audio and video. We work to scale the user experience for hundreds of millions of fans and hundreds of thousands of advertisers. This scale brings unique challenges as well as tremendous opportunities for our artists and creators.\n\nSpotify Advertising is looking for a UX-driven Senior Product Designer to support our growing digital scaled marketing team. The Senior Product Designer will work closely with our Content Strategy team to build engaging and interactive user experiences across our Spotify Advertising digital marketing products, primarily our website, academy, and partner network.\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Design outstanding front-end user experiences across our core digital marketing products with the goal of captivating and converting potential customers","Use the Spotify Advertising design system to build new components and propose strategic design updates to our existing component library","Partner with a cross-functional team of brand creatives, content strategists and engineers to bring concepts to life","Make design decisions based on competitive analysis, user research, and testing","Synthesize user data and research to inform design concepts and decisions","Help track and report on the efficiency of our web design"]},{"title":"Who You Are","content":["7+ years of experience building customer facing, websites and digital marketing products with a focus on driving high value events and performance","Experience with B2B, advertising, or ecommerce websites preferred","Experience with a learning management system (LMS) is a plus","Able to present confidently and influence senior stakeholders","Open to constructive design feedback from stakeholders at every level — able to iterate quickly and pivot if needed","Highly collaborative, especially with people who might sit on different teams or functions","Expertise in modern design and prototyping tools like Figma, Adobe, Mural, etc.","Motion design is a plus but not required","Creative problem solver who views change as an opportunity"]},{"title":"Where You'll Work","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them!","Where in the world? For this role, it can be anywhere in the Americas region in which we have a work location","Prefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here.","Working hours? We operate within the Eastern Standard time zone for collaboration."]}],"location_emoji":"🌍"}