{"title":"Senior Data Engineer - AdTech","location":["New York, NY"],"attendance":["Remote"],"type":["Permanent"],"experience":"2","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Data Engineer","AdTech","data engineering","monetization","data pipelines","Java","distributed data pipelines"],"skills":["Java","Python","SQL","Apache Beam","GCP","AWS","Hadoop"],"overview":"The Senior Data Engineer - AdTech position involves building and driving data engineering initiatives within advertising and podcast monetization teams, streamlining data ingested from multiple sources, creating personalized ad experiences, and developing software solutions in a fast-paced podcast and ad services technology environment.","description":"Our mission on the Advertising Product & Technology team is to build a next generation advertising platform that aligns with our unique value proposition for audio and video. We work to scale the user experience for hundreds of millions of fans and hundreds of thousands of advertisers. This scale brings unique challenges as well as tremendous opportunities for our artists and creators.\n\nWe are looking for Data Engineers to build and drive data engineering initiatives within our advertising and podcast monetization teams. In this role, you will be instrumental in streamlining data ingested from multiple sources to not only recognize value and insights, but to also set standards along the way. You will help us to create a user-first ad experience that's personalized and relevant, and develop and own software solutions on our fast-paced podcast and ad services technology. You will help us grow to billions of fans, increase engagement with our listeners, and provide better value to our advertisers. Above all, your work will impact the way the world experiences music and podcasts.\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Work closely with key partners across the ads organization, contributing to the improvement of many different pipelines and services","Build new distributed data pipelines across ad experience","Use best practices in continuous integration and delivery","Help drive optimization, testing and tooling to improve reliability and data quality","Apply a Data centric approach to all the platforms, pipelines and engineering activities","Jump into data pipelines, identify issues, and propose solutions across teams","Design, develop, and maintain Java services","Work in cross-functional agile teams to continuously experiment, iterate and deliver on new product objectives"]},{"title":"Who You Are","content":["You have a strong understanding of data systems","You are knowledgeable and passionate about improving and building new distributed data pipelines","You are knowledgeable about data modeling, data access, and data storage techniques","You are familiar with current engineering practices such as distributed architecture, and are curious about new technologies that help derive insights and value from data","You have experience working on and building distributed data pipelines that ingest huge amounts of data across multiple sources and brands","You are very comfortable working with datasets in SQL (we also use Scio!)","You are comfortable in at least one core language like Python, Java or Scala","You have experience working with Apache Beam, Hadoop or a similar streaming data technology","You have experience with GCP (preferred) or AWS","You enjoy close collaboration with backend and ML engineers, and are passionate about software architecture across the stack","Ad Tech and/or Podcast Monetization experience is a plus"]},{"title":"Where You'll Be","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them!","Where in the world? For this role, it can be within the Americas region in which we have a work location and is within working hours: https://lifeatspotify.com/locations","Working hours? We operate within the Eastern Standard time zone for collaboration and ask that all be located in that time zone.","Prefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here."]}],"location_emoji":"🇺🇸"}