{"title":"Senior Manager - Payroll, Americas","location":["New York, NY"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Payroll Operations","Workday Payroll","Team Management","SOX Compliance","Payroll Tax","Equity Management","System Improvement"],"skills":["WorkDay Payroll","ADP SmartCompliance","NetSuite","Payroll","Workflow","System efficiencies","ERP systems"],"overview":"The Senior Manager - Payroll, Americas position involves leading the strategy and execution of North American day-to-day payroll operations, optimizing Workday Payroll processes, managing a team, and collaborating with other teams to ensure payroll efficiency and compliance.","description":"We are seeking an outstanding Senior Manager - Payroll to join our growing Finance team in New York.\n\nIn this dynamic & highly visible role, you'll lead the strategy and execution of our North American day-to-day payroll operational team. You’ll partner cross-functionally with Spotify leaders to improve business performance, ensure efficiency through Workday Payroll, manage a small team, and lead strategic projects as we continue to scale. \n\nThis role is located in our New York City offices and will report directly to the Director of Payroll, Americas.\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Payroll Operations & Projects:","Ensure accurate and timely paycheck productions by overseeing the preparation, review and approval of the full cycle payroll process; as well as off-cycle payments for NA payroll using Workday; optimize current Workday processes and procedures","Supervise and mentor the NA payroll team, including assigning tasks, providing training, conducting performance evaluations, and fostering a collaborative work environment.","Establish strong partnership with Compensation & Benefits, HRIS, HRS, Equity, and Accounting teams to form a healthy eco system for payroll operation","Ensure SOX compliance by adhering to internal policies and controls, as well as compliance with external laws and regulatory guidance, while maintaining documentation for payroll processes and implementing improvements","Collaborate with accounting/general ledger functions as it relates to payroll and compensation (journal entries, payroll accruals, account reconciliations, etc.)","Manage external relationships with 3rd party vendors, government audits, and support analysis for procedures to validate and reconcile payroll data","Other responsibilities include but are not limited to participating in special projects or ad hoc analyses as assigned. In particular, the experience of onboarding employees from acquired companies is a strong plus","Payroll Tax/Equity:","Process daily stock option exercises, RSU and NSO and ISO’s releases and settlements using E*Trade","Review and maintain compliance with all appropriate local, state and federal income tax laws","System Improvement:","Drive improvement of workflow and system efficiencies","Prioritize projects to ensure payroll completion and project progress"]},{"title":"Who You Are","content":["10+ years of payroll experience at a global organization","Bachelor's degree in accounting, finance, human resources, business administration, or a related field","Master's degree is a plus","In-depth knowledge of payroll laws, regulations, and standard methodologies","Payroll experience at a high tech company","WorkDay Payroll expertise is a must","Experience with other major Payroll and ERP systems (e.g. ADP SmartCompliance, NetSuite)","Multi-state payroll expertise and knowledge of state and federal wage & tax laws","Excellent project management skills and the ability to effectively collaborate cross-functionally","Strong organizational, analytical, communication skills, and attention to detail","Prior people management experience","Global stock plan administration/management experience is a plus","CPP or FPC"]},{"title":"Where You'll Be","content":["Hybrid role based in our New York offices (2 to 3 days a week required)","Working hours? We operate within the Eastern time zone for collaboration"]}],"location_emoji":"🌍"}