{"title":"Senior Data Scientist - Content Safety Analysis","location":["Dublin"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Senior Data Scientist","Content Safety Analysis","Spotify","Content Platform Insights","Knowledge Graph","Moderate and Control","Data Scientist","Mentor","Insights","Signal Development","Tool User Behaviour","Measurement","Prompt Application","Large Language Models","NLP","Python","R","SQL","Pandas","Spark","Data Visualization","Tableau","Qlik Sense","Matplotlib","ggplot2","Large Datasets","Ambitious","Communication","Mentoring","Fast-paced Environment","Dynamic Environment","High Energy Environment","Work From Anywhere","Dublin","Ireland"],"skills":["Python","SQL","R","NLP","Large Language Model","SQL","Pandas"],"overview":"The Senior Data Scientist - Content Safety Analysis will join the Content Safety Analysis team in Spotify, working on insights and data analysis to ensure a safe and trusted experience for consumers and to keep the platform free of infringement.","description":"Delivering the best Spotify experience possible. To as many people as possible. In as many moments as possible. That’s what the Experience team is all about. We use our deep understanding of consumer expectations to enrich the lives of millions of our users all over the world, bringing the music and audio they love to the devices, apps and platforms they use every day.\n\nWe are looking for a Senior Data Scientist to join the Content Platform Insights team. Content Platform is a central enabler for the Spotify business. We deliver a complete, available and enriched catalog of music, podcasts, videos and more. We provide the knowledge graph that accumulates differentiated understandings of creators, content, their attributes and their relationships. We ensure we can readily moderate and control the catalog to ensure a safe and trusted experience for consumers and to keep our platform free of infringement.\n\nThe successful candidate will join The Content Safety Analysis team (formerly known as Kinzen), which joined in October 2022 after our acquisition by Spotify! On joining Spotify, we renamed as Content Safety Analysis with a shared mission to scale our understanding of the global content that flows through the Spotify platform. So that experts can deliver the high quality leads and signals we need to make decisions which protect both safety AND expression. The CSA team consists of two data scientists today. They are looking to hire a senior data scientist to act as a mentor to the others as well as being able to drive the work of insights in an ambiguous space. \n","requirements":[],"extras":[{"title":"What You’ll Do","content":["Work with Insights peers in other parts of the business to guide strategy, product, and process development","Collaborate with Product Management, Engineering, and Insights colleagues to optimise signal development, understand tool user behaviour and drive measurement as a first class citizen in our product development and decision-making","Support insight development for CSA's operational teams to help improve processes and ensure capacity is invested wisely","Optimise the application of prompts and large language models in automating the assessment of harmful content"]},{"title":"Who You Are","content":["You have 5+ years of experience building data science solutions","Degree in data science, computer science, statistics, economics, mathematics, or a similar quantitative field","You have the technical competence to perform more advanced analytics","Prior experience working on NLP (or ideally Large Language Model) based projects and problems","Coding skills (such as Python, R or similar)","Analytics tools experience (such as SQL, Pandas, R, Spark or similar)","Data visualisation tools (such as Tableau, Qlik Sense, matplotlib, ggplot2 or similar)","You have extensive experience performing analysis with large datasets","You are an ambitious person who’s capable of tackling loosely defined problems and driving strategic impact","You are a communicative person that values building positive relationships with colleagues and stakeholders and have the ability to explain complex topics in simple terms","You have experience mentoring more junior data scientists to set them up for success","You thrive in a fast-paced, dynamic and high energy environment and are comfortable with ambiguity"]},{"title":"Where You’ll Be","content":["We’ve introducedWork From Anywhere to give you more options!","We are giving you the flexibility to choose to work from our office in Dublin or from home in Ireland depending on your preference"]}],"location_emoji":"🌍"}