{"title":"Senior Machine Learning Engineer, Personalization","location":["New York, NY"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Machine Learning","Personalization","Recommendation Systems","Python","Java","Scikit-learn","TensorFlow"],"skills":["Python","Java","Scala","TensorFlow","PyTorch","Scikit-learn","XGBoost"],"overview":"The job involves improving the quality of Spotify's recommendation system, contributing to the development and evaluation of personalized machine learning algorithms, and executing a long-term ML strategy for the team.","description":"The Personalization team makes deciding what to play next easier and more enjoyable for every listener. From Blend to Discover Weekly, we’re behind some of Spotify’s most-loved features. We built them by understanding the world of music and podcasts better than anyone else. Join us and you’ll keep millions of users listening by making great recommendations to each and every one of them. We ask that our team members be physically located in Central European time or Eastern Standard/Daylight time zones for the purposes of our collaboration hours.","requirements":[],"extras":[{"title":"What You'll Do","content":["Improve the quality of Spotify’s candidate pools (the top of the recommendation funnel) for our huge number of listeners, around the globe","Contribute to designing, building, evaluating, shipping, and refining Spotify’s personalization products with hands-on ML development","Develop and help execute a long-term ML strategy and roadmap for the team","Promote and role-model best practices of ML systems development, testing, evaluation, etc., both inside the team as well as throughout the organization","Be part of an active group of machine learning practitioners across Spotify collaborating with one another"]},{"title":"Who You Are","content":["You have a passion for delivering amazing user experiences","You have a strong background in machine learning, with experience and expertise in personalized machine learning algorithms, especially recommender systems","You have hands-on experience implementing production machine learning systems at scale in Python, Java, Scala, or similar languages","Experience with TensorFlow, PyTorch, Scikit-learn, XGBoost, etc is a strong plus","You preferably have experience with data pipeline tools like Apache Beam or Scio, and cloud platforms like GCP or AWS","You are comfortable exploring data to deeply understand the problems and products you are working on","You care about agile software processes, data-driven development, reliability, and disciplined experimentation"]},{"title":"Where You'll Be","content":["Location is flexible. You will join a team that spans Boston, New York and Remote employees, so you need to be based in Eastern Standard Time zone"]}],"location_emoji":"🇺🇸"}