{"title":"Senior Technical Product Manager - Ads Data Platform - Reporting","location":["New York, NY"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"4","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Strategy","Roadmap","Reporting Platform","Ad-Tech","Data Management","SQL","Tableau"],"skills":["SQL","Tableau","QlikSense","data processing","data warehousing","SQL-like interfaces","ad-tech"],"overview":"The Senior Technical Product Manager - Ads Data Platform - Reporting will help shape the future of Spotify's advertising business by improving data management and building reporting tools for advertisers and internal partners.","description":"Our mission on the Advertising Product & Technology team is to build a next generation advertising platform that aligns with our unique value proposition for audio and video. We work to scale the user experience for hundreds of millions of fans and hundreds of thousands of advertisers. This scale brings unique challenges as well as tremendous opportunities for our artists and creators.\n\nAs a senior product manager, you will help shape the future of our advertising business by improving the way Spotify manages data and how advertisers use it for managing campaigns. Your teams will be responsible for building the best reporting tools and products for our advertisers and internal partners.\n","requirements":[],"extras":[{"title":"What you'll do","content":["Define and drive product strategy and roadmap for a scalable and unified Reporting platform to meet the needs of the advertising business at Spotify.","Partner with external and internal team members, engineering, and design to develop and drive Spotify’s reporting product roadmap.","Deep-dive with engineering counterparts on the design and architecture of our reporting platform.","Work cross-functionally across insights teams, R&D engineering, product teams, finance teams, and ops teams among others to successfully define, design, and launch new reporting products that meet the needs of the advertising business.","Meet regularly with internal partners to ensure we are building the right products, tracking success metrics, and communicating developments.","Be responsible for the reporting platform that supports our growing 1.5B+ business that handles xxB data.","Own and implement all reporting testing, including alphas and betas to help inform product decisions and strategy.","Focus on Spotify’s self-service platform to help increase the value of Spotify Advertising.","Partner with measurement teams and product marketing to bring new capabilities to market."]},{"title":"Who you are","content":["You have 4+ years of experience working as a product manager for an ad-tech or mar-tech company, data management platform, or large-scale publisher.","Experienced with SQL-like interfaces, Tableau, QlikSense, and data processing/data warehousing.","A strong technical background - you should have experience working with developers, engineers, and other technical team members, and be able to communicate effectively with them.","You understand how products work “under the hood” and are comfortable collaborating and discussing technical approaches and challenges with engineers.","Organized and results-driven, can manage multiple projects extending across many teams, stick to realistic deadlines, and push back when vital.","An exceptional communicator, comfortable with both writing and presenting technical concepts to get your ideas heard and get consensus from a variety of collaborators.","Collaborative, and able to both give and receive direct feedback to help things progress efficiently.","All about execution. You have a proven ability to effectively implement, deliver, and quickly iterate without a lot of direct supervision."]},{"title":"Where you'll be","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them!","Where in the world? For this role, it can be within the Americas region in which we have a work location and is within working hours: https://lifeatspotify.com/locations","Working hours? We operate within the Eastern Standard time zone for collaboration and ask that all be located in that time zone.","Prefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here."]}],"location_emoji":"🌍"}