{"title":"Senior Research Scientist","location":["Boston, MA"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Artificial Intelligence","Large Language Models","Reinforcement Learning","Machine Learning","Natural Language Processing","Information Retrieval","Language Technologies"],"skills":["Artificial Intelligence","Large Language Models","Reinforcement Learning","Machine Learning","Natural Language Processing","Information Retrieval","Language Technologies"],"overview":"The Senior Research Scientist position at Spotify's Personalization team involves conducting cutting-edge research in Artificial Intelligence, Large Language Models, Reinforcement Learning, Machine Learning, Natural Language Processing, Information Retrieval, and Language Technologies, with a focus on reshaping the audio content experience and making innovative solutions that impact Spotify's mission.","description":"The Personalization team makes deciding what to play next easier and more enjoyable for every listener. From Blend to Discover Weekly, we’re behind some of Spotify’s most-loved features. We built them by understanding the world of music and podcasts better than anyone else. Join us and you’ll keep millions of users listening by making great recommendations to each and every one of them. We ask that our team members be physically located in Central European time or Eastern Standard/Daylight time zones for the purposes of our collaboration hours.\n\nThe Personalization team makes deciding what to play next easier and more enjoyable for every listener. From Blend to Discover Weekly, we’re behind some of Spotify’s most-loved features. Personalization is a high impact team that is building the next generation technologies aimed at making every user interaction with Spotify outstanding through personalization and discovery!\n\nJoin our collaborative, interdisciplinary team as we work together to ensure the foundations of Spotify technologies are state-of-the-art and redefine the state-of-the-art by contributing to the wider research community through top-tier paper publications. Our team has strong ties internally to product groups as well as externally to the research community. We are especially looking for scientists interested in creating impact by developing and applying large foundational models that reshape the listening experience.\n\nAt Spotify, we give our people the freedom to work where they work best. Some of us work better in the office. Some of us are more productive at home. Some of us prefer to blend the two. We simply ask that our team members be physically located between Central European time and Eastern Standard/Daylight time zones for the purposes of our collaboration hours. We also have physical lab locations throughout these time zones.\n\nWe are considering candidates at multiple levels for this role and eventual title will be commensurate with experience and expected impact, which we evaluate throughout the interview process. \n\n","requirements":[],"extras":[{"title":"What You'll Do","content":["You will participate in cutting edge research in one of Artificial Intelligence, Large Language Models, Reinforcement Learning, Machine Learning, Natural Language Processing, Information Retrieval, Language Technologies","You will work in collaboration with other scientists, engineers, product managers, designers, user researchers, and analysts across Spotify to design innovative solutions to challenging problems that impact Spotify’s mission","You will advance research on the application, alignment, augmentation, understanding, and building of large foundational models with the goal of reshaping how audio content is created, discovered, and experienced","You will apply your scientific knowledge to analyze and collect data, perform analyses, identify problems, devise solutions and construct methodologies, including metrics and best practices, and conduct experiments to validate these hypotheses","You will directly impact key applications such as recommendation, search, voice and language understanding, and areas related to audio streaming such as music and podcasts","You will have product impact, while working on and further developing a long-term collaborative research roadmap","You will maintain a research profile through external engagement such as publishing, giving talks, and being an active community member at top conferences"]},{"title":"Who You Are","content":["You have a PhD or the equivalent in one of computer science, machine learning, information retrieval, natural language processing, data science, speech or related areas","You are a creative problem-solver who is passionate about digging into complex problems and devising new approaches to reach results.","You have experience in all phases of visualizing and modeling of real data at scale – including problem definition, data set construction, implementation, experimentation, and analysis.","You have a passion for making sense of user behavior and impacting how technology impacts audio content creation and the listening experience of every person, especially for podcast and music content.","You have a strong foundational knowledge in artificial intelligence, large-language-models, machine learning, information retrieval or recommender systems with a demonstrated desire to continue to learn more.","You have a record of advancing the state-of-the-art demonstrated by publications in top-tier research communities such as NeurIPS, ICLR, ICML, ACL, EMNLP, SIGIR, WSDM, WWW, RecSys, KDD, AAAI, or related venues."]},{"title":"Where You'll Be","content":["We’ve introduced Work From Anywhere to give you more options!","While we will ask you to pop into the office from time to time, we are giving you the flexibility to work from home should you choose to do so.","Working hours? We operate within the EST time zone for collaboration."]}],"location_emoji":"🌍"}