{"title":"Senior UX Writer - Global Narration","location":["New York, NY"],"attendance":["Hybrid"],"type":["Permanent"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Senior UX Writer","Global Narration","Personalization","Spotify","UX Designer","Spanish-speaking listeners","AI/LLMs","Content Design","Content Strategy","Various audiences","Written and verbal communication skills","Technology","Music and music culture","Operational management","Teams and vendors","Spanish","English","Creative writing","Data analysis"],"skills":["Content Design","Content Strategy","Writing","Software","Operational Management","Spanish","English"],"overview":"The Senior UX Writer - Global Narration position involves leading the development and scaling of narration strategy for Spotify's Personalization team, aiming to make every listening session more enriching through personalization and discovery.","description":"The Personalization team makes deciding what to play next easier and more enjoyable for every listener. From Blend to Discover Weekly, we’re behind some of Spotify’s most-loved features. We built them by understanding the world of music and podcasts better than anyone else. Join us and you’ll keep millions of users listening by making great recommendations to each and every one of them. We ask that our team members be physically located in Central European time or Eastern Standard/Daylight time zones for the purposes of our collaboration hours.\n\nWe are looking for an experienced Senior UX Writer, Narration to join Spotify’s Personalization team. Our goal is to make every listening session more enriching through personalization and discovery. You will be leading the charge of developing and scaling our narration strategy throughout the experience. The content is why people come to Spotify—to be entertained, inspired, and informed. You'll help find innovative ways to combine our understanding of the world of music and podcasts with our ~500M users’ unique tastes, bringing fans an experience tailored uniquely to them, and helping them find new artists they love.\n","requirements":[],"extras":[{"title":"What you'll do","content":["Work closely with writers and UX designers to scale your writing to Spanish-speaking listeners around the world.","Write weekly commentaries for our Spotify recommendations for products and experiences.","Explore working with new technologies such as AI/LLMs and contribute to building new products and software.","Work and collaborate with engineers to implement your writing at scale to millions of listeners.","Responsible for creative decisions regarding the global Latin American diaspora."]},{"title":"Who you are","content":["Experienced in Content Design or Content Strategy.","Experienced bringing new experiences to new markets.","Experienced writing for various audiences with diverse sets of needs and wants.","Excellent written and verbal communication skills.","Technology excites you.","Have an active interest in music and music culture, and are passionate about helping Spotify listeners find the right music for the moment.","Comfortable with operational management of teams and vendors toward international scaling.","Diving into the tone of voice and cultural nuance is something you’re passionate about.","Fluent in Spanish and English – spoken and written, including creative writing.","Comfortable using data to influence content and UX."]},{"title":"Where you'll be","content":["We are a distributed workforce enabling our band members to find a work mode that is best for them","Where in the world? For this role, it can be within the Americas region in which we have a work location and is within working hours.","Working hours? We operate within the Eastern/NY time zones for collaboration and ask that all be located in that time zone.","Prefer an office to work from home instead? Not a problem! We have plenty of options for your working preferences. Find more information about our Work From Anywhere options here."]}],"location_emoji":"🇺🇸"}