{"title":"Administrative Assistant, Creative Production - APAC","location":["Seoul, South Korea"],"attendance":["Onsite"],"type":["Full-time"],"experience":"7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Administrative Assistant","Creative Production","APAC","Directors","Calendar Management","Travel Coordination","Event Planning"],"skills":["Maintain complex calendars","Coordinate travel arrangements","Manage a large volume of various internal meetings","Event planning","Support team-building initiatives","Liaise with our corporate workplace team","Maintain distribution lists"],"overview":"The Administrative Assistant, Creative Production - APAC supports Directors in the Creative Production department at Netflix's APAC offices, coordinating calendars, travel arrangements, meetings, events, team-building initiatives, office space planning, internal communication, and some external communication. The candidate should have 7+ years of experience as an administrative or executive assistant supporting multiple leaders with global teams, fluency in English, strong communication skills, ability to maintain confidentiality, and proficiency in Google Suite.","description":"Netflix’s business in APAC is constantly evolving and our teams across the region (located in Singapore, Mumbai, Seoul, Tokyo & Sydney) are expanding to support our growing business in the regions. With that, we’re seeking a Seoul-based Administrative Assistant to support Directors in the Creative Production department. Millions of people around the world are entertained and moved by the stories they discover on Netflix. In Creative Production, we work together on a world-class platform that gives every title – no matter the language, scope or origin – the potential to inspire an individual or become a global phenomenon. Our team thrives on the balance between different worlds: technology and art, left brain and right, creativity and scale.\n\nThe successful candidate will be self-motivated, proactive, quick-thinking, flexible, and able to juggle multiple and diverse responsibilities with unwavering attention to detail. Creative problem-solving is a must and we need someone who can not only be great in their day-to-day work, but identify opportunities to make the overall team more organized and efficient. Someone who is curious, demonstrates significant initiative, and inherently exercises good judgment will be most successful both in the role and at Netflix.\n","requirements":[],"extras":[{"title":"Specific responsibilities include, but are not limited to:","content":["Maintain complex calendars for multiple executives based in different APAC offices.","Coordinate travel arrangements, both regionally and internationally including expense reports.","Manage a large volume of various internal meetings such as all teams and large cross-functional meetings, often across multiple time zones (i.e. scheduling, soliciting agenda items, time management, delegation of action items.)","Event planning (team events such as offsites and bonding experiences like off-property meals). Responsibilities include sourcing hotels and meeting venues, arranging F&B, liaising with external vendors, coordinating prep meetings, agendas, presentations, and AV needs.","Support team-building initiatives in the realms of onboarding, Inclusion & Diversity, Q&A sessions, etc.","Liaise with our corporate workplace team to be a point of contact for office space planning.","Maintain distribution lists, Google Groups, Slack channels and the like for APAC Creative Production organization.","This role is heavy with internal communication and some external comms."]},{"title":"Qualifications:","content":["7+ yrs of experiences as an administrative or executive assistant supporting multiple leaders with large, global teams across many time zones and cultures.","Extensive experience within technology, entertainment, or other similar fast-growing company","Fluency in English is necessary","Strong written and verbal communication skills","Ability to be discrete and maintain confidential information","Understanding of how to prioritize and respond accordingly in a professional manner","Interest in entertainment, media and innovation","Proficiency in Google Suite"]}],"location_emoji":"🇰🇷"}