{"title":"Analytics Engineer (L5), Financial Data","location":["Los Gatos, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Analytics Engineer","Financial Data","Java","SQL","Distributed Data Processing","Data Modeling","Big Data Technologies"],"skills":["Java","Python","SQL","Spark","Flink","dimensional data modeling","data quality"],"overview":"The Analytics Engineer (L5), Financial Data position at Netflix involves creating reliable data pipelines and building intuitive data models for the financial data universe, enabling well-informed decision-making and self-service access to business insights at scale, while collaborating with engineering teams, analysts, and business partners.","description":"At Netflix, we want to entertain the world and are constantly innovating on how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 220 million paid subscribers and are expanding into new forms of entertainment such as gaming. Engineering teams within Netflix work hard every day to scale and innovate this content production and member experience in an ever-growing complex software landscape.\n\n As part of the Enterprise Product Engineering team, we're responsible for enabling the business to make smart decisions about how we account, spend, and plan for all of the money that's related to our content. We have embarked on a journey to create a financial data universe for our business users. This helps enable well-informed decision-making by unifying financially relevant data across systems and supports efficient, self-service access to business insights at scale. As a senior analytics engineer focused on Netflix’s financial data universe, you will have huge ownership and responsibility for enabling the business' critical decisions. You will be responsible for creating reliable, distributed data pipelines and building intuitive data models that allow our stakeholders to easily leverage data in a self-service manner. You will be expected to show thought leadership and partner effectively with our engineering teams, analysts, and business partners to push the company forward.\n","requirements":[],"extras":[{"title":"What will you do?","content":["Completely define, own, and maintain business-critical data pipelines.","Work closely with engineers, analysts, and business partners to deeply understand the data, what it means in our context, and how to elegantly model it appropriately","Contribute to and maintain a unified financial semantic model that enables self-service reporting capabilities for our users","Power some of the most important and insightful dashboards and insights for our finances","Learn the ins and outs of our business and how Netflix manages money","Understand and explain how data ties together and relates to the rest of our ecosystem","Design dimensional tables to enable analysts and drive critical business decisions in an efficient and scalable manner"]},{"title":"Who are you?","content":["You strive to write elegant code, and you're comfortable with picking up new technologies independently","You are proficient in at least one major programming language (e.g. Java, Scala, Python) and comfortable working with SQL","You enjoy helping teams push the boundaries of analytical insights, creating new product features using data, and powering machine-learning models","You have a strong background in at least one of the following: distributed data processing or software engineering of data services","You are familiar with dimensional data modeling techniques and best practices","You are familiar with big data technologies like Spark or Flink and comfortable working with web-scale datasets","You have an eye for detail, good data intuition, and a passion for data quality","You appreciate the importance of great documentation and data debugging skills","You relate to and embody many of the aspects of the Netflix Culture. You love working independently while also collaborating and giving/receiving candid feedback","You are comfortable working in a rapidly changing environment with ambiguous requirements. You are nimble and take intelligent risks"]}],"location_emoji":"🇺🇸"}