{"title":"Associate, Finance Strategy and Analysis, Content - APAC","location":["Seoul, South Korea"],"attendance":["Onsite"],"type":["Full-time"],"experience":"2","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Finance Strategy","Analysis","Content","APAC","Valuation","Industry Trends","Financial Metrics"],"skills":["financial modeling skills","MS Excel","PowerPoint","statistics","analysis packages","Korea content and entertainment","English and Korean language fluency"],"overview":"The Associate, Finance Strategy and Analysis, Content - APAC position at Netflix in Seoul involves leading analysis and valuation of new projects, conducting ongoing analysis of key business drivers, and presenting analyses and reports to stakeholders. Candidates should have experience in a strategy/analytics role, be highly analytical and effective communicators, possess superb financial modeling skills, and have fluency in English and Korean.","description":"Netflix is the world's leading streaming entertainment service with over 238+ million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Finance  Strategy & Analysis for Contentis looking for an Associate to join its APAC team based out of Seoul.  Finance Strategy & Analysis is the team in charge of the analytical efforts and strategic thinking  behind our content buying and original content decisions. The team works cross-functionally to translate the incredible amount of data at Netflix into financial and strategic decisions regarding the production and acquisition of series and films. Finance Strategy & Analysis also evaluates the general programming and content strategy, in addition to leading competitive analysis. \n\nThis person will have a high degree of visibility with senior management which uses the team’s analysis and insights to inform important business decisions, such as our content performance analysis and programming strategy.\n\nThis role will reside in Netflix's Seoul office and be involved in projects across Asia. You will report to the Director, Finance Strategy & Analysis for Korea, based in Seoul.\n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Lead the analysis and valuation of new projects (both titles and deals) in partnership with the Content Creative and Acquisition teams.","Conduct ongoing analysis of key business drivers, trends and performance indicators.","Develop a deep understanding of industry trends as well as competitive threats and opportunities.","Regularly present analyses and reports on relevant operating and financial metrics in an easy-to-understand format to business stakeholders.","Compiling thoughtful post-mortem analyses to determine areas for optimization and improvement.","Work on region-wide analytical projects with the global Content Analytics team. Working cross-functionally with other FS&A teams globally as well as Product, Marketing, Consumer Insights, and Data Science team."]},{"title":"Qualifications","content":["2+ years of experience in a top management consulting firm, investment bank, private equity, hedge fund, and/or media/entertainment/tech company in a strategy/business development/analytical role. We are looking for candidates that have worked in a highly-demanding environment in which complex modeling and analysis is performed.","Candidates are required to be highly analytical and be a strong, effective communicator with experience presenting complex analyses to team and stakeholders.","Candidates must thrive in a fast-paced environment, possess a high level of intellectual curiosity, focus on generating results and exhibit the highest personal and professional standards of integrity and ethics. Candidates must be motivated, disciplined, and flexible.","Superb financial modeling skills and extensive experience conducting quantitative and qualitative analysis.","Exceptional proficiency with MS Excel & PowerPoint; working knowledge of statistics and analysis packages.","Passion and familiarity with Korea content and entertainment is a strong plus","Bachelor's degree in finance, economics, mathematics, statistics or other relevant field that demonstrates quantitative orientation. MBA is a plus but not required.","English and Korean language fluency are mandatory."]}],"location_emoji":"🇰🇷"}