{"title":"AV Engineer","location":["Mexico City, Mexico"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["AV Engineer","AV equipment","live events","conference room","teardown","AV team","Google Meet","Chromebox for Meetings","R&D","user experience","optimize","virtual meeting experience","pre-production","post-production","technical expertise","design","build","conference rooms","training spaces","specialty spaces","screening rooms","video conference experience","scalability","rapid deployment","troubleshooting support","equipment issues","support team","Google","troubleshoot","CFM issues","conference room designs","support","team","vendors","partners","inventory management","operating and supporting live events","configuring and troubleshooting audio","video equipment","AV vendors","live streaming technologies","AV integration","video conferencing systems","cloud bridging services","designing and building meeting spaces","acoustics","lighting","technology","networking technology","video transmission","audio/video signal flow","working with Crestron equipment","audio DSP","Dante/AES microphone systems","project management","organizational skills","self-motivated","self-starter","working with vendors","suppliers","integrators","prioritize tasks","forecast upcoming project needs","international travel","domestic travel","inventory management protocols","GSuite tools","Google Meet Video Conferencing support","builds"],"skills":["AV equipment","technology","Google Meet","Chromebox for Meetings","R&D","conference room experience","user experience"],"overview":"A versatile and experienced AV Engineer is sought to manage setup, support, and teardown of AV equipment and other technology for live events, as well as support the design and build of meeting spaces and high-profile events for Netflix.","description":"Netflix is the world's leading streaming entertainment service with over 200 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.\n \nOur Netflix Technology Services team has the mission of optimizing the productivity of Netflix employees by supporting their technology needs, whether that’s fixing a computer/network, troubleshooting a conference room’s camera, or supporting a live event. As we grow, so does the number of high-profile events we host and meeting spaces we support, so we’re looking for a versatile and experienced AV Engineer to join our [region] team.  Located in our office in [city].\n \nFor live events, you’ll manage the setup, support, and teardown of AV equipment and other technology, as well as coordinate with external vendors as needed. This position requires flexible hours as events may take place after normal business hours or on the weekend.\n \nIn addition, the AV team supports the design and build of meeting spaces and high-profile events across our enterprise and studio facilities throughout the [region] region. We rely on Google Meet with Chromebox for Meetings (CFM) hardware for the virtual meeting experience and build solutions to optimize the experience. The team is highly encouraged to leverage R&D to enhance the user experience while maintaining efficient designs. You’ll be empowered to look for ways to optimize the conference room experience for users and partner teams.\n\n","requirements":[],"extras":[{"title":"Strategic Priorities","content":["Provide pre-production through post-production AV support for live events hosted by Netflix, both internal and external facing.","Partner with events, facilities, networking, IT, and AV engineering teams to provide guidance and technical expertise during event planning stages as needed","Assist in the design, build, and management of conference rooms, training spaces, specialty spaces, and screening rooms.","Research and develop the best video conference experience from the ground up with consideration for scalability and rapid deployment.","Provide Tier 2/Tier 3 troubleshooting support when equipment issues are escalated.","Work closely with the support team to determine trends and iterate on designs to improve stability.","Foster the partnership with Google to troubleshoot CFM issues and add features to improve the user experience.","Assist in the development of processes and standards for conference room designs and support across several different environments.","Foster cross-functional partnerships with Netflix teams working in-region alongside the AV team.","Clearly communicate and document processes to team, vendors, and partners.","Quality control of inventory and asset management."]},{"title":"Skills for Success","content":["Experience operating and supporting live events (corporate, hospitality, or other major event venues).","Experience configuring and troubleshooting audio and video equipment for live events or in a corporate environment.","Experience partnering with external AV vendors for live events.","Experience with live streaming technologies for YouTube, Facebook Live and other online distribution methods.","Experience with AV integration on the integrator and/or corporate side, with a focus on the physical installation.","Experience with video conferencing systems and cloud bridging services such as Chromebox For Meetings, Vidyo, and BlueJeans","Experience designing and building meeting spaces from the ground up including acoustics, lighting, and technology is a plus.","Experience with designing around Chromebox for Meetings is a plus.","Understanding of networking technology, video transmission over the network, and audio/video signal flow.","Experience working with Crestron equipment, audio DSP’s and Dante/AES microphone systems.","Demonstrated project management experience with large projects, organizational skills, and an ability to maintain and create standards.","Proven ability to work independently with minimal supervision; must be a self-motivated self-starter who can initiate ideas and take ownership of work.","Experience working with and managing various vendors, suppliers, and integrators.","Proven ability to prioritize tasks and projects, and forecast upcoming project needs.","Open to international and domestic travel.","Organized and familiar with inventory management protocols.","Experience with the GSuite tools, particularly Google Meet Video Conferencing support and builds."]}],"location_emoji":"🇲🇽"}