{"title":"Business & Legal Affairs Manager, Content Legal  - Brazil","location":["Alphaville, Brazil"],"attendance":["Onsite"],"type":["Full-time"],"experience":"8","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Negotiations","Agreements","Legal Research","Communication","Cross-functional collaboration","Project oversight","Concise communication"],"skills":["contracts","negotiations","business affairs","audiovisual industry","SVOD","pay TV","IP matters"],"overview":"The Business & Legal Affairs Manager, Content Legal - Brazil position is responsible for structuring, negotiating, and drafting agreements for projects produced or acquired by Netflix Brasil, conducting legal research, providing strategic guidance, and maintaining alignment with internal and external partners.","description":"Netflix is changing the way more than 230 million subscribers around the world enjoy entertainment. As a company, we challenge industry norms by pushing one another to think creatively about complex questions. Our Content Legal team is no exception. We think critically about the range of business & legal issues our business faces and act consistent with our freedom and responsibility culture, collaborative work, and candid discussions by providing pragmatic and reality-based advice to the business and taking ownership of bold decisions. Our culture is unique, and we live by our values, so we encourage learning more about it.\n\nWe are looking for a Business & Legal Manager to work with our Content Legal Brazil team.  In this role, you will be part of a small but mighty team responsible for handling all negotiations and legal aspects of projects produced or acquired by Netflix Brasil. The successful candidate will structure, negotiate, and draft agreements and should be highly comfortable in making decisions that have both legal and business impacts. The position is based in Alphaville - Barueri.\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Strategic dealmaker, supporting the development, production, acquisition, and licensing of our Brazilian content;","Drafting, reviewing, and negotiating a wide range of agreements, including production service agreements, talent agreements, and/or license agreements under varying deal types;","Be responsible for overseeing matters that arise throughout the production process;","Conducting legal research and providing strategic guidance and analysis on various legal issues, including intellectual property, contract law, etc.;","Communicating and negotiating with external partners;","Maintaining close alignment with multiple internal cross-functional partners, guiding them on legal matters and best practices."]},{"title":"Requirements","content":["8+ years of broader experience in contracts and strong experience in dealing negotiations (Business Affairs) with production companies, talent, and IP owners regarding the development and production of audiovisual projects;","Strong and practical knowledge of the Brazilian audiovisual industry from a business affairs standpoint (including content windowing strategies and the evolving theatrical, VOD, pay TV and syndication landscapes);","Direct experience structuring, negotiating, and drafting SVOD and/or pay or free television acquisition and distribution agreements;","Fluence in drafting and negotiating agreements in Portuguese and English for audiovisual projects of more than one content vertical (e.g., scripted series and films; reality and scripted series);","Experience in IP matters (feat. copyrights) regarding risk assessment in the chain of title and clearance procedures;","Ability to work proactively, independently, and collaboratively within the team and cross-functionally as well as reliably with little guidance but use good judgment to escalate issues when needed;","Ability to maintain a positive and constructive attitude in ambiguous situations and to manage complex issues in a productive manner;","Excellent communication skills (concise and clear), including an ability to explain complex information clearly and effectively to different audiences;","Fluency in Portuguese and English skills are required for this role;","Be proactive, forward-thinking, and have a hands-on attitude;","Adaptable negotiation style;","Change course, be scrappy, and get things done within short time frames."]}],"location_emoji":"🇧🇷"}