{"title":"Business System Analyst - Workday Payroll","location":["Amsterdam, Netherlands"],"attendance":["Onsite"],"type":["Full-time"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Workday Payroll","Requirements Gathering","Configuration","Report Building","Integration Development","Accounting Workflows","Global Payroll"],"skills":["Workday Payroll","Time Tracking","Workday","Data exchange","Integrations","Accounting center workflows","Global payroll"],"overview":"The Business System Analyst - Workday Payroll position involves gathering requirements, implementing and supporting functionalities within Workday Payroll and Time Tracking modules, working with cross-functional teams, configuring and maintaining business process definitions in Workday, building reports and dashboards, developing and supporting integrations, and maintaining accounting center workflows. Desired qualifications include at least 5 years of experience working with payroll systems, functional knowledge of global payroll domain and processes, subject matter expertise in Workday modules, and familiarity with payroll integrations and accounting.","description":"The Netflix Finance Technology team manages and delivers applications for the constantly evolving needs of our finance organization.  As Netflix grows globally, we continue to look for the best and brightest talent to scale with our growth opportunity. Our team is seeking an outgoing, curious Payroll Business System Analyst to work in a rapid development environment with multiple internal business customers throughout the business.\n\nThis position will reside in the company’s Amsterdam office and will report to the Manager, Finance Technology. The ideal candidate for this role is someone with a deep understanding of systems and processes in the payroll space. An ability to think critically and outside the box is a must. The opportunity to participate in requirements definition, development, training and implementation offers tremendous job satisfaction for a highly motivated problem solver.\n\nVisit our culture page and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Gather requirements, implement, and support functionalities within Workday Payroll and Time Tracking modules.","Work with cross-functional teams within Netflix including Global Payroll, People Tech, Employee Services, Accounting, Benefits, and Stock Administration.","Configure, and maintain business process definitions in Workday.","Build reports and dashboards using discovery boards, report writer.","Develop and support integrations (PECI / EIB), for inbound and outbound data exchange between Workday and other internal/external systems.","Build and maintain accounting center workflows."]},{"title":"Desired Qualifications/Skills:","content":["At least 5 years of experience working with payroll systems.","Functional knowledge of global payroll domain and processes.","Subject matter expertise on the following Workday modules on Payroll, and Time Tracking is preferred","SAP and Oracle Payroll knowledge is a plus","Experience working with 3rd party payroll integrations (PICOF/ PECI).","Knowledge of Payroll and Expense accounting.","Thorough knowledge of Software Development Life cycle and QA processes.","Familiarity with Sarbanes-Oxley (SOX) process.","Ability to work well with business users in solutions design, development, and QA.","Established verbal and written communication skills."]}],"location_emoji":"🇳🇱"}