{"title":"CDN Site Reliability Engineer (L5) - Open Connect","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"2","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["CDN Site Reliability Engineer","Open Connect","*nix","Networking","Data Analysis","Large-Scale Service Operations","Content Delivery Network","Server Infrastructure","Netflix","Video Traffic","Resilience","Security","Observability","Quality of Experience","Monitoring","Instrumentation","Automation","Scalable","Reliable","CDN Services","Netflix Big Data","Service Delivery Optimization","System Reliability","Open Connect Appliances","Tier 3 Escalation","Unix/Linux System Administration","Networking Concepts","TCP/IP","BGP","HTTP/S","DNS","Distributed Analytic Processing","Hive","Presto/Trino","Spark SQL","Container Orchestration","Docker","Kubernetes","Collaborative Environment","Internal/External Partners","BS in Computer Science","Electrical Engineering","Computer Engineering"],"skills":["*nix","networking","data analysis","large-scale service operations","CDNs","HTTP cache/proxy technologies","Unix or Linux system administration"],"overview":"The CDN Site Reliability Engineer (L5) - Open Connect position is responsible for designing, scaling, operating, automating, and analyzing Netflix's globally distributed CDN to maintain highly scalable and reliable services worldwide.","description":"How do you spark joy in hundreds of millions of people? It starts with a vision - that technology can give voice to stories around the world. In delivering those much-loved stories, Netflix is responsible for a significant portion of global internet traffic.\nTo steward that responsibility, we work collaboratively with ISPs to deploy Open Connect, Netflix’s Content Delivery Network (CDN), our in-house custom-built network and server infrastructure responsible for delivering 100% of Netflix's video traffic. \nWe strive to deliver a great Netflix viewing experience in over 190 countries so our customers can watch whatever, whenever, interruption free. We are seeking seasoned Reliability Engineer with extensive experience in *nix, networking, data analysis, and large-scale service operations experience to design, scale, operate, automate, and analyze our globally distributed CDN.  Come join us and play a meaningful role in our journey to entertain the world!\n\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Drive continual improvement in resilience, security, observability, quality of experience (QoE), monitoring, instrumentation, and automation with the primary goal to maintain highly scalable and reliable CDN services worldwide","Aggregate, analyze, and correlate large amounts of server and application performance data. Use the innovative Netflix Big Data platform as a highly flexible, specialized and efficient toolset for service delivery optimization and system reliability improvements","Provide technical design, deployment and engineering assistance to ISP partners to integrate our Open Connect Appliances","Handle Tier 3 escalation for service delivery production issues","Have lots of discussions about all the great content and your favorite movies and series"]},{"title":"Qualifications","content":["Service Reliability/Operational experience running large scale, high performance systems & internet services with focus on security and reliability","Proficient in a programming language such as Python or Go","Knowledge of and proven experience with CDNs and HTTP cache/proxy technologies","Expert-level knowledge of Unix or Linux system administration at scale. We happen to use FreeBSD","Knowledge of networking concepts and application protocols, especially TCP/IP, BGP, HTTP/S and DNS","Experience with distributed analytic processing technologies (Hive, Presto/Trino, Spark SQL, etc)","Some experience with container and container orchestration technologies (Docker, Kubernetes)","Ability to work in a highly collaborative environment and to communicate effectively with internal and external partners","Preferred - BS in Computer Science, Electrical Engineering or Computer Engineering (or equivalent professional experience)"]},{"title":"Things that show how we think","content":["FreeBSD optimization used by Netflix to serve 800 Gb/s from a single server","Resiliency Practices in Managing CDN","Measuring Real-Life Latency of the Internet: A Netflix Story","Mastering Near-Real Time Telemetry and Big Data"]}],"location_emoji":"🇺🇸"}