{"title":"(Contract) Coordinator, Production Finance (JET Program)","location":["Tokyo, Japan"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Production Finance","JET Program","Coordinator","Content and Production teams","Tokyo","Japan","Junior Executive Training","rotation","Netflix production","accounting team","Content production process","studio paid costs","bank reconciliations","show fundings","accounts payable","relationship management","production accounting concept","content budget","analytical","self-motivated","disciplined","organized","prioritize tasks","fast-paced environment","intellectual curiosity","generate results","integrity","ethics","financial applications","Excel skills","written communication skills","facilitating","presenting analyses","entertainment industry","English","Japanese","Bachelor's degree","Finance","Accounting","Film","travel"],"skills":["Excel","Financial applications","Accounting","Analytical skills","Written communication skills","Fluency in English and Japanese languages","Content budget management"],"overview":"The (Contract) Coordinator, Production Finance (JET Program) is an entry-level position in Netflix's Junior Executive Training (JET) Program, offering rotations between in-house production headquarters and on-set of original productions, with the opportunity to develop into a full-time Production Finance Coordinator. Primary responsibilities include learning about the content production process, managing studio paid costs and accounts payable, and gaining field experience on Netflix Japan original productions. Strong analytical skills, organization, and a passion for the entertainment industry are required, along with fluency in English and Japanese.","description":"Netflix is developing the industry’s next generation of Production Finance professionals who will work with the Content and Production teams in Tokyo, Japan. The Junior Executive Training (JET) Program is an entry-level production finance position with rotations through our in-house production headquarters as well as on-set of our original productions. JET Program Coordinators will support Netflix Production Finance Leadership and Associates and will also experience working on the set of a Netflix production to work as a member of the production accounting team. JET Program Coordinators will be working with Content teams especially the Live Action content related teams. JET Program Coordinators will also experience working on the set of a Netflix production to work as a member of the production accounting team.\n\nThe Junior Executive Training (JET) Program is an entry-level production finance position with rotations through our in-house production headquarters as well as on-set of our original productions. JET Coordinators will  support Netflix Production Finance Leadership and Associates and will also experience working on the set of a Netflix production to work as a member of the production accounting team.  JET Coordinators will be working with Content teams especially the Live Action content related teams.  \n\nExceptional JET Coordinators will have the opportunity to develop into Full-time Production Finance Coordinators. This is a two-year rotational program composed of hands-on work, educational seminars, and mentorship. This will be a fixed term contract position. \n\n","requirements":[],"extras":[{"title":"Primary Responsibilities:","content":["Learning about the Content production process from initial creative planning, to production management, all the way to competition of the content creation so that it is ready to launch on the Netflix service","Partner with Production Finance Associate to manage studio paid costs, bank reconciliations, show fundings, accounts payable and relationship management with outside production accounting teams.","Field learning opportunity on Netflix Japan original production","Learning production accounting concept and workflow","Using Netflix internal tools to manage content budget"]},{"title":"Requirements","content":["Highly analytical, self-motivated, disciplined, highly organized and able to prioritize multiple tasks.","He/she must thrive in a fast-paced environment, possess a high level of intellectual curiosity, focus on generating results and exhibit the highest personal and professional standards of integrity and ethics.","High aptitude and enthusiasm for complex problem solving and analysis utilizing financial applications, including great Excel skills.","Very strong written communication skills and experience in facilitating and presenting analyses.","Strong passion for entertainment industry.","Fluency in English and Japanese languages is required.","A Bachelor's degree in Finance, Accounting, or Film is preferred.","Must be willing to travel for business if necessary."]}],"location_emoji":"🇯🇵"}