{"title":"Coordinator, Production Finance, Italy","location":["Rome, Italy"],"attendance":["Onsite"],"type":["Full-time"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Production Finance","Coordinator","Italy","Entertainment Industry","Financial Capacity","Film and TV production","Accounting","Italian","English","Fast-paced environment","Intellectual curiosity","Results-driven","Integrity","Ethics","Self-motivated","Highly organized","Problem Solving","Analytical","Written Communication","Verbal Communication","Entertainment","Finance","Excel","Google Sheets"],"skills":["finance","accounting","production finance","Italian","English","problem solving","Excel"],"overview":"The Production Finance Coordinator in Netflix's Rome office will provide comprehensive daily support, process accounts payables, facilitate communication with external partners, and optimize workflows for the Production Finance team in Italy.","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nAbout Production Finance: \nThe Production Finance team at Netflix is responsible for estimating and managing the production costs throughout the lifecycle of each production and provides insight and analytics to inform decision-making.  The team understands the operations of a production and guides each project through its financial workflows required for a successful launch on the service. \n\nWe are looking for a coordinator to join Netflix’s Production Finance team in our Rome office. This position will support the Netflix Production Finance Team on scripted and non-scripted projects shooting in Italy.\n\nThe Production Finance Coordinator will be tasked with supporting our ever-growing slate on a day-to-day basis, and providing consistency for our internal and external partners.\n\nWe are ideally looking for someone with experience working in the entertainment industry in a financial capacity. Knowledge of film and TV production or production finance is a major plus! \n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Comprehensive daily support for the Production Finance Team","Partner with Production Finance Associates and Managers to process accounts payables, track project cash forecasting and funding, maintain multiple internal reporting tools and systems as well as general ad hoc projects","Facilitate communication with external partners","Inform internal cross-functional teams with project updates","Workflow optimization and automation"]},{"title":"Requirements:","content":["A minimum of three years work experience in finance or accounting, preferably in production or entertainment","Fluency in Italian and English","The ideal candidate must thrive in a fast-paced environment, possess a high level of intellectual curiosity, a focus on generating results and exhibit the highest personal and professional standards of integrity and ethics","Candidates must be self-motivated, disciplined and highly organized","Strong multi-tasking ability. High aptitude and enthusiasm for complex problem solving and analysis","Strong written and verbal communication skills","Passion for entertainment and finance is a must","Strong Excel or Google Sheet skills"]}],"location_emoji":"🇮🇹"}