{"title":"Coordinator, Regional Royalties and Residuals - EMEA","location":["Amsterdam, Netherlands"],"attendance":["Onsite"],"type":["Full-time"],"experience":"4+","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Coordinator","Regional Royalties","Residuals","EMEA","Royalty Administration","Financial Principles","Data Integration"],"skills":["Accounting","Finance","Business Administration","Royalties","Residuals","Contract Management","Television/Film"],"overview":"The Coordinator, Regional Royalties and Residuals - EMEA position at Netflix in Amsterdam involves coordinating the collection and integration of data, reviewing title slate, preparing and distributing statements, providing customer service, supporting internal partners, and contributing to system development and innovation projects. The ideal candidate has a background in royalty administration and reporting, solid financial understanding, relevant education, 4+ years of experience, strong analytical and communication skills, adaptability, and alignment with the company's values and goals.","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nWe are looking for a Coordinator to join our Regional Royalties and Residuals team in Amsterdam. The team handles royalties, revenue sharing, profit participations, residuals and other financial and non-financial obligations related to the distribution and exploitation of our content and related rights including merchandise, music, and games. \n\nThis role will focus on Netflix’s regional obligations in EMEA. The ideal candidate will have some experience working in the context of royalty administration / reporting along with a solid understanding of financial principles. You will work cross-functionally to collect and process relevant data to administer royalty obligations, update models/estimates of financial impact, coordinate/confirm deal terms with our Business and Legal teams, calculate and issue royalty statements and provide related customer service to the external recipients.\n\nVisit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team.\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["You coordinate the collection of relevant internal and external data and prepare it for integration in our systems and workflows.","You coordinate the review of the title slate for royalties and residuals obligations, confirm with legal business partners and document / record financial parameters","You compile, format and distribute statements and other communication, related to royalties and residuals obligations.","You provide timely and accurate customer service to external inquiries.","You provide timely and accurate support to our internal cross-functional business partners","You participate in efforts to innovate the way we work, which includes system development and automation projects.","You provide feedback, research industry best practices and implement impactful improvements to your area that demonstrate the capabilities of your team."]},{"title":"Qualifications:","content":["Relevant education in accounting, finance, business administration and/or equivalent combination of education and experience","4+ years experience in a relevant role. Royalties, residuals and/or contract management or background in a finance role in television / film is a plus.","Strong analytical skills to identify issues and problem-solve effectively.","Excellent verbal and written communicator who can build strong working relationships with a diverse group of cross-functional business partners across different cultures and time zones. Able to provide world-class customer service to internal stakeholders and external partners/clients. Proficiency in English is required. Working knowledge of German is a plus.","Self-motivated, quick-thinking and adaptable to change. You thrive in a fast-paced and demanding environment, possess a high level of intellectual curiosity, and demonstrate strong judgment in the face of ambiguity.","Understand, advocate, and embody the company's values and team goals."]}],"location_emoji":"🇳🇱"}