{"title":"Coordinator, Production Finance - Nordics","location":["Stockholm, Sweden"],"attendance":["Onsite"],"type":["Full-time"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Production Finance","Financial Workflows","Accounts Payables","Cash Forecasting","Data Processing","Workflow Optimization","Communication Facilitation"],"skills":["finance","accounting","data processing","workflow optimization","communication","written communication","verbal communication"],"overview":"The Coordinator, Production Finance - Nordics position at Netflix in Stockholm provides comprehensive daily support for the Production Finance team, including processing accounts payables, tracking project cash forecasting and funding, maintaining internal reporting tools, optimizing workflows, facilitating communication with external partners, and informing cross-functional teams with project updates.","description":"It’s an amazing time to be joining Netflix as we continue to transform entertainment globally. Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. In EMEA, Netflix is headquartered in Amsterdam.\n\nAbout Production Finance: \nThe Production Finance team at Netflix is responsible for estimating and managing the production costs throughout the lifecycle of each production and provides insight and analytics to inform decision-making.  The team understands the operations of a production and guides each project through its financial workflows required for a successful launch on the service. \n\nWe are looking for a coordinator to join Netflix’s Production Finance team  in Stockholm. This position will support Netflix Production Finance Managers and Associates on scripted and non-scripted projects shooting throughout the Nordics. \n\nWe are ideally looking for someone with experience working in the entertainment industry in a financial and administrative capacity. Knowledge of film and TV production or production finance is an advantage!\n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Comprehensive daily support for the Production Finance Team","Process accounts payables, track project cash forecasting and funding","Maintain multiple internal reporting tools and systems as well as general ad hoc projects with strong focus on data processing","Workflow optimization","Facilitate communication with external partners","Inform internal cross-functional teams with project updates"]},{"title":"Requirements:","content":["A minimum of three years work experience in finance or accounting","You thrive in a fast-paced environment, possess a high level of intellectual curiosity, are focused on generating results and exhibit the highest personal and professional standards of integrity and ethics","You are self-motivated, disciplined and highly organized.","You have a strong multi-tasking ability and a high aptitude and enthusiasm for complex problem solving and analysis","You have strong written and verbal communication skills","Proficiency in English and one of the Nordics languages is a must","You have a passion for entertainment and finance"]}],"location_emoji":"🇸🇪"}