{"title":"Counsel - Korea","location":["Seoul, South Korea"],"attendance":["Onsite"],"type":["Full-time"],"experience":"4-5 years","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Attorney","Negotiation","Agreement Drafting","Legal Research","Strategic Guidance","Contract Law","Telecommunications Law"],"skills":["contract drafting","contract review","Korean","English","corporate","commercial transaction","in house counsel"],"overview":"The Counsel - Korea position at Netflix involves overseeing and managing diverse transactional aspects of the business in South Korea, including business development, content acquisition, marketing, and PR, through drafting and negotiating agreements, providing legal guidance, and maintaining alignment with internal partners.","description":"Netflix is the world's leading internet entertainment service with over 233 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. With this international expansion and a move into Korean originals, it's a great time to join Netflix.\n\nThe Opportunity \n\nNetflix is looking for an attorney who will be responsible for overseeing and managing diverse transactional aspects of the business with a focus on BD (“business development”), content acquisition (licensing), marketing, and PR. The successful candidate will structure, negotiate and draft agreements to facilitate and support a wide array of business areas within Netflix, and should be extremely comfortable counseling business partners and making decisions that have both legal and business impacts.  \n\nThe position is based in Seoul, South Korea. \n\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Draft, review, and negotiate a wide range of agreements, including: partnership agreements, technology/content license agreements under varying deal types, service agreements, etc","Conduct legal research, provide strategic guidance and analysis on various legal issues including: intellectual property, contract law, telecommunications and advertising laws, etc","Communicate with external partners","Maintain close alignment with multiple internal cross-functional partners","Manage, maintain, and update various templates","Train and educate internal stakeholders on legal matters and best practices"]},{"title":"Qualifications","content":["Minimum of 4-5 years of experience as an attorney, and membership in good standing in at least one jurisdiction","Experience and proficiency in contract drafting and review (in Korean and English) required","Background in corporate or commercial transaction-related teams at a law firm or experience in the technology, media or entertainment industry as an in house counsel preferred","Strong business acumen, analytical capabilities and judgment with the ability to think practically and solution-oriented","Ability to work proactively, independently and reliably under tight timeframes in a fast-paced environment","Excellent organizational, interpersonal and communication skills","Fluency in both Korean and English required"]}],"location_emoji":"🇰🇷"}