{"title":"Creative Production Operations, Launch Manager - Korea","location":["Seoul, South Korea"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Launch Manager","Creative Production Operations","Content Strategy","Product Management","Quality Assurance","Stakeholder Management","Workflow Optimization"],"skills":["Product management","Operations","Workflow evaluation","Troubleshooting","Communication skills","Analytical mindset","Language proficiency"],"overview":"The Launch Manager role at Netflix in Korea requires deep understanding of the product behavior and precise local execution, optimizing content and product strategy, leading cross-functional teams, and innovating new product experiences to ensure high-quality and efficient launches for maximum member joy, with a focus on the Korea content slate.","description":"Netflix is the world's leading internet entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nThe Opportunity \n\nAt Netflix, we launch a high volume of titles regularly to meet the entertainment needs of our growing member base. The scale and quality at which we launch titles is paramount to our success in bringing these stories to the right audience at the right time. The Launch Management team ensures that we launch our regional portfolio of titles at the highest quality and in the most efficient way possible to maximize member joy.\n\nThe Launch Manager role is unique as its scope requires a deep understanding of our product behavior and a mindset that is equally precise on local execution as it is on strategic judgment calls. The LM’s role is to optimize the content and product strategy, and we do this via effective management of our highest impact areas, leading cross-functional and partner teams alignment on a portfolio level, and being part of initiatives on innovating and productizing new product experiences. Thorough knowledge of the local and vertical strategies,connecting  business nuances with content and member experiences, and technical troubleshooting paired with strong partnership investment with stakeholders will be critical to our success.        \n\nYou will be part of a larger Creative Production Operations team that will innovate approaches to tooling, vendors and quality to develop scalable solutions and measurements for the quality of our launches so that we can work smarter and increase efficiency. This role is based in Seoul and focused on supporting the Korea content slate.  \n\nThe Korea content slate plays an important role in Netflix both in terms of members’ experiences and business. You will contribute to launch & travel Korea content slate to the Netflix members around the globe. \n","requirements":[],"extras":[{"title":"In this role, you will:","content":["Own a portfolio of titles within a given region or vertical. While multiple teams (internal or external) get involved at different times along the launch journey for deliverables, you will be overseeing the quality of the launch within your local region or market.","Be an expert of the Netflix product and advise our stakeholders on means to improve how members interact with the title on the Netflix platform.","Maintain the quality of the launch and mitigate risk to launch by being proactive, exercising sound judgment, and informing and influencing stakeholders.","Own E2E launching a portfolio of titles including pre-promotion, preparation, launching, post analysis and troubleshooting where necessary.","Partner with internal and external teams and serve as the primary point of contact on strategic operational matters for the title.","Be a sparring thought partner to the Content team through product & member-focused insights & strategy.","Constantly evaluate our workflows with the intention of improving our efficiency and effectiveness in launching titles.","Troubleshoot urgent issues cross-functionally and jump in operationally as needed, in service of the member experience."]},{"title":"The ideal candidate has:","content":["Korean and English fluency - written and spoken, with one additional language proficiency preferred.","Excellent communication skills - written and verbal.","Mid-to senior-level product management experience in a product-centric environment.","An analytical mindset and a bias towards solving for scale.","A passion for operations and a thirst to do more with less, to work smarter not harder.","Own a portfolio of titles within a given region or vertical. While multiple teams (internal or external) get involved at different times along the launch journey for deliverables, you will be overseeing the quality of the launch within your local region or market.","Be an expert of the Netflix product and advise our stakeholders on means to improve how members interact with the title on the Netflix platform.","Maintain the quality of the launch and mitigate risk to launch by being proactive, exercising sound judgment, and informing and influencing stakeholders.","Partner with internal and external teams and serve as the primary point of contact on strategic operational matters for the title.","Constantly evaluate our workflows with the intention of improving our efficiency and effectiveness in launching titles.","Troubleshoot urgent issues cross-functionally and jump in operationally as needed, in service of the member experience The ability to exemplify the Netflix culture and values."]}],"location_emoji":"🇰🇷"}