{"title":"Data Engineer (L5) - Ads","location":["Los Gatos, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Ads Data Engineering","data ecosystem","ad inventories","forecasting","targeting","advertising data","data pipelines"],"skills":["Spark","Hive","SQL","Python","Data warehousing","Data modeling","Data transformation"],"overview":"The Data Engineer (L5) - Ads position at Netflix is responsible for architecting, strengthening, and expanding the core data models used by the Ads functions to answer business questions, developing data pipelines to ensure the delivery of high-quality data, and partnering with various stakeholders to create intuitive data sets that serve analysis and reporting needs.","description":"Netflix is the world's leading internet entertainment service with over 220+ million memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. And as of November 2022, we added an advertisement branch to our business, making Netflix service accessible to an even broader member base with ad-supported plans!\n\nAds Data Engineering team sits at the core of building a data ecosystem that will power Netflix’s understanding and decision-making about what impact ads have on our business. It is part of a larger data engineering org within Content and Studio Data Engineering horizontal, with a strong sense of engineering community that fosters technical and personal growth. This team’s main focus is to build rich, connected, and easily accessible data about ad inventories, forecasting, targeting, and much more. Core data about ads is used across multiple business areas and functions, from getting informative analytics to feature development for statistical models. The scope of this team’s work is rapidly growing and there are many opportunities for impacting Netflix’s journey into advertisement. We are looking for a passionate, mature, and curious Data Engineer, with ad ecosystem experience, to contribute to the team’s impact in a quickly evolving business.\n","requirements":[],"extras":[{"title":"Who are you?","content":["Beyond talented, you are curious, creative, and tenacious","You have strong beliefs that are weakly held: you can argue, and hear, all sides of a debate and adapt to new perspectives that emerge from it","Sharp communicator who can break down and explain complex data problems in clear and concise language.","You have an extensive background and strong technical expertise working with advertising data and understand how to build for scale, privacy, and business impact","A role model for integrity: you have great judgment and can make tough decisions without agonizing","You have a high tolerance for ambiguity and fast-changing context","Hands-on experience building production data pipelines, ideally using one or more distributed processing frameworks such as Spark or Hive/Hadoop","Deep expertise in data modeling and establishing data architecture across multiple systems","Thrive in a fast-paced environment, and see yourself as a partner with the business with the shared goal of moving the business forward.","Create code that is understandable, simple, and clean, and take pride in its beauty.","Love freedom and hate being micromanaged. Given the context, you're capable of self-direction.","Passionate about data quality and delivering effective data to impact the business."]},{"title":"What will you do?","content":["Architect, strengthen, and expand the core data models that our Ads functions use to answer business questions. You’ll get on a team of talented data engineers and envision how all the data elements from multiple sources should fit together as a whole, and then execute that plan.","Fully own critical portions of Netflix's Ads data model. Collaborate with stakeholders to understand needs, model tables using software engineering and data warehouse best practices, and develop data pipelines to ensure the timely delivery of high-quality data","Partner with Analytics Engineers, Data Scientists, and Software Engineers to create data sets that will serve analysis and reporting needs intuitively","Develop best practices for governance of data sets with sensitive information","Build strong and collaborative partnerships with data scientists, analytics engineers, and Machine Learning practitioners"]},{"title":"What (ideally) do you know?","content":["Domains related to advertising, data privacy, GDPR","Data warehousing, data modeling, and data transformation for both batch and streaming","How to write complex SQL and Python in your sleep","Expert at building performant data pipelines and optimizing existing workflows for new features","Big Data tech - Hadoop, Spark, Pig, Hive, Presto, etc.","Experience with sourcing and modeling data from application APIs","Team-based software development tools and best practices"]}],"location_emoji":"🇺🇸"}