{"title":"Designer, Product Creative Studio","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":["Photoshop","Illustrator","Motion graphics","Digital","Out of home","Project management","Creative"],"overview":"The Designer in the Product Creative Studio at Netflix is responsible for creating visually stunning and effective artwork for titles within the Netflix member experience, balancing creative quality with project management, collaborating with internal and external partners, and contributing innovative ideas for creative workflows and decision-making.","description":"Netflix is one of the world's leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nNetflix Product Creative Studio helps stories find their fans through the creation of world-class imagery, video and motion graphics on the Netflix global platform. We are on a mission to mission is to revolutionize the way promotional content is created and delivered, finding new ways for Netflix members or prospective members to discover new stories or old favorites through creative visual design, video editorial and sound design. \n\nWe are looking for a Designer to join our team. As a Designer, you will be partnering with other internal designers, motion graphics artists, editors and strategists to create visually stunning and effective artwork for titles within the Netflix member experience. The artwork you create will be featured on-service (TV UI, mobile and web) and potentially out of home for off-service use. This unique opportunity blends hands-on design, art direction and project management in a fully autonomous environment.  \n","requirements":[],"extras":[{"title":"The Role","content":["Hands-on creation of artwork and creative assets to represent Netflix titles on service (TV UI, mobile, web and beyond).","Balances quality creative and project management. Innovates and implements personal workflows to optimize creative processes. Manages projects, designers and timelines from kickoff to completion.","Capable of managing title work while contributing to cross-functional initiatives with creative needs.","Leads, collaborates and builds strong relationships with both technical partners, creative partners and stakeholders to provide creative feedback and art direction.","Contributes ideas and concepts for creative innovation within productized canvases and workflows. Can utilize readily available data and tech to make informed creative decisions.","Able to anticipate and proactively address challenges. Manages against expectations in highly ambiguous situations and adjusts effectively to changes in context.","Role is remote friendly"]},{"title":"The Right Stuff:","content":["7+ years working within a creative environment (agency and/or in-house) for a tech/entertainment/consumer brand.","Must be an expert in Photoshop and Illustrator. Motion graphics capabilities are not required but are a plus. Proficiency in traditional mediums like painting, illustration, photography etc. are also additive.","Experience in a fast paced, high volume environment with many moving parts.","Proven ability to create and direct high-quality creative (portfolio required).","Expert in all aspects of developing creative in a digital, out of home, product or user-centric space.","Experienced in all aspects of creative project management from kickoff to completion.","Passionate about producing data-informed, measurably effective artwork.","Excellent communication and collaboration skills.","Self-motivated with the ability to work independently.","Understands, advocates, and embodies the company’s values and team goals.","Is passionate about art, film and television.","Curious about technology and comfortable with adapting to new tools."]}],"location_emoji":"🇺🇸"}