{"title":"Design & Construction Regional Program Manager, APAC","location":["Singapore, Singapore"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"Netflix is the world's leading digital entertainment service. As we expand globally, we continue to look for the best and brightest talent to help us scale. Visit our culture memo and long-term view to learn more about the unique Netflix culture and the opportunity to be part of our team.\n\nIt's an amazing time to join Netflix as we continue shaping the future of global entertainment, bringing new stories to millions of people worldwide. To support our regional expansion, we are looking for a seasoned regional program manager of Design & Construction. This position will be based in Singapore and have a dual reporting structure into the global Design & Construction leader based in Los Angeles and the Regional CREWS leader based in Singapore.\n\nAs part of the Corporate Real Estate team, you will oversee all design and construction activities in an ever-changing APAC estate portfolio that is experiencing explosive growth. You will go beyond simply completing projects on time and within budget because you recognize the value of the physical workplace and its impact on employee engagement & productivity. We don’t want to just be a place to work, we want to be THE place to work.   \n\nThe ideal candidate will bring a programmatic view of project delivery to the region, be skilled at multi-country project delivery and have a strong understanding of storytelling through architecture & brand.  You will lead the team through an end to end process including creative design, budgeting, scheduling and project oversight.  \n \nThis candidate will have a proven track-record of creative problem solving, excellent organizational skills, strong communication skills, deep understanding of various international cultures,  as well as a rigorous attention to detail. noted below. \n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Lead the design and construction process for all APAC locations, including budget & schedule development, design & planning, construction and commissioning.","Drive creative consistency in our environments that foster creativity, innovation and to enable people to do their best work.","Ensure designs are cohesive to the overall project intent and represent Netflix’s culture and brand values.","Review construction & architectural design details, brand-related drawings, FFE & lighting specifications to ensure proper coordination of design intent.","See that the Project Schedule, incorporating dates and times for decisions, availability of design information, procurement of materials and subcontracts, lead times for fabrication, and field installation, is established and maintained.","Ensure that the prescribed quality and financial control measures are implemented and maintained throughout the life of the project.","Partner with planning & occupancy leads to incorporate programming needs into physical space. Assist with workplace assessments (with the support of a space programmer) for the Portfolio and Transaction teams to enable site renewal and/or new selection","Closely align with internal stakeholders and colleagues across Real Estate, Workplace, Employee Technology, and Security.","Coordinate the completion and presentation of design phase milestones from our design partner firm to enable visibly to design progress.","Work effectively with regional developers, landlords, and government agencies.","Establish regional partnerships with architects, engineers, consultants, and contractors.","Provide clear & frequent projects updates to leaders & internal stakeholders that define project status, schedule, & risks.","Prioritize incoming project workload across all markets and ensure resources are assigned to lead in the development & execution.","Manage yearly CAPEX budget, provide accurate & timely forecasting, and create a multi-year CAPEX plan that aligns with overall real estate & workplace objectives.","Leverage our global scale & purchasing power to reduce overall costs on goods and services.","International travel will be required."]},{"title":"Requirements:","content":["10+ years experience in Design/Construction project delivery in a high speed and dynamic environment.","Bachelor's degree in project management, construction management, Architecture, or equivalent practical experience.","Ability to prioritize and high level of organizational skills.","Working ability of Google Suite, Adobe Products: Creative Suite, as well as Bluebeam, CAD or Revit","Strong understanding of the construction and design process; expert knowledge of working drawings, procedures and contracts.","Extraordinary attention to detail, while still working under strict timelines","Have an understanding of project cost analysis.","Google Office Suite."]}],"location_emoji":"🇸🇬"}