{"title":"Director of Business & Legal Affairs - Japan","location":["Tokyo, Japan"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"THE OPPORTUNITY\nNetflix is one of the world's leading entertainment services with over 230 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nTHE ROLE\nWe are seeking a senior and experienced executive to lead our Japan Business & Legal Affairs team supporting the development, production, acquisition, and licensing of our Japanese original content for both live action and anime, as well as Chinese language original content. The successful candidate will be   an expert in business affairs for content, including partner-managed productions, high level talent deals, and acquiring underlying IP. They are a strategic dealmaker who will partner closely with various internal cross-functional teams to develop and execute deal strategies for Japanese content; they will innovate on deal structures to better access IP, talent, and production partners in a highly competitive market. They are both a player and a coach, as they will structure and negotiate deals, and will also be a leader to a multi-disciplinary Business & Legal Affairs team and will coach and develop the next generation of leaders. This curious and innovative leader will be willing to try new deal approaches and to find innovative solutions as we build our growing Japanese business for the future. \n\nThe candidate will also be responsible for overseeing matters that arise throughout the production process. The candidate will likely need to dig into local law and practice in various International territories, and should be extremely comfortable making decisions that have both legal and business impacts, while collaborating with internal and external partners situated around the globe.  Excellent communication skills (spoken and written) are a must. \nThe ideal candidate will welcome the opportunity to be part of a fast‐paced, entrepreneurial organization and thrive in communicating in a global environment.  \n\nREQUIREMENTS\nThe successful candidate will have at least 15+ years of broad-based content licensing, development and production experience working for a production company, studio or law firm, including direct experience structuring, negotiating and drafting SVOD and/or pay or free television acquisition and distribution agreements (international market experience a plus), and practical knowledge of the industry (including content protection and security issues, content windowing strategies, and the evolving theatrical, VOD, pay TV, syndication and home video landscapes). Experience providing inhouse support in an Internet and/or entertainment company preferred. Legal qualification is not required.\n\n","requirements":[],"extras":[{"title":"Additional Skills:","content":["Business level fluency in English and fluency in Japanese is required","Clear, concise communication skills in both English and Japanese","Excellent leadership, supervisory, interpersonal and communication skills, with strong people management skills to develop a high performing team in a dynamic environment.","Strong analytical capabilities and judgment, even when the rules are unclear and the issues are of first impression.","Ability to work proactively, independently, and reliably under tight timeframes in a fast-paced environment.","Ability to work effectively and collaboratively, think practically and be solution-oriented.","Must be approachable and spend the extra effort to foster external and international relationships, and is able to build rapport well.","Must be able to act with both internal and external partners in mind, and able to balance interests and risks based on reality-based decision-making.","Must be very curious and self-aware, and able to get first hand information and use it for meaningful improvements and innovation.","Ability to approach obstacles as learning opportunities, and develop and evolve with our culture and ways of working.","Willingness to tackle matters outside their area of expertise."]}],"location_emoji":"🇯🇵"}