{"title":"Dubbing Manager - Japan","location":["Tokyo, Japan"],"attendance":["Onsite"],"type":[],"experience":"7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Dubbing Manager","Japan","Netflix","dubbing/VO production","technical skills","tools","job responsibilities","international expansion","localized experience","Japan Dubbing Manager","members experience","dubbed audio","highest quality experience","local territory","Title Managers","Language Production Managers","leadership","strategic thinking","self-motivated","quick-thinking","flexible","juggle multiple","diverse responsibilities","managing a team","passion for language","cultural nuances","demanding and fast-moving position","holistic approach","up to 36+ languages","Title Management","Language Production team","longform dubbing","shortform dubbing","accessibility assets","cross functional teams","context and feedback","strategic business solutions","creative excellence","tight and consistent alignment","Global Resource Strategy","Dubbing Strategy and Innovation","continuously educate, grow and develop the team","collaborate with other country, vertical and territory leaders","creative best practices","continuous awareness and implementation of Netflix Culture","in-territory dubbing standards and workflows","local competitive landscape","monitoring competitor's landscapes","7+ years experience","dubbing operations","creative services","sales/client services","localization and dubbing position","working knowledge of the local slate","trust and team-building skills","scalable solutions and workflows","analytical and problem-solving skills","Dubbing workflows and pipelines","supervising team members","curiosity and self-disciplined pro-active responsibility","interest in technology, operations, creativity, and business","writing, facilitating and presenting analyses","Bachelor's degree","Fluency in English and Japanese"],"skills":["Dubbing operations","Localization","Dubbing workflows","Dubbing pipelines","Creative services","Sales/client services","Scalable solutions"],"overview":"The Japan Dubbing Manager will oversee a team responsible for providing high-quality dubbed audio to Netflix customers across the globe, ensuring the best-localized experience of the content in up to 36+ languages.","description":"The Opportunity\nNetflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nThe Netflix Dubbing Production team is responsible for getting those amazing programs to our growing international audience. Centered around dubbing/VO production, a great team environment, and cutting-edge technology, this group is critical to Netflix’s ability to provide the best-localized experience of our great content. With this international expansion, the preservation of creative intent in the production of a localized experience is of utmost importance; what a great time to join Netflix!\n\nAs a Japan Dubbing Manager, you will be responsible for how members experience dubbed audio, ensuring Netflix customers across the globe get the highest quality experience from our localized audio assets. As we continue to add support for new languages and expand our global membership, providing best-in-class localized content is critical to our success.\n\nThe Role\nThe Japan Dubbing Manager will be the main contact for their respective local slate in territory.  60% of the role is management and leadership.  40% of the role is title or language specific coverage.  As a Dubbing Manager, you will be leading a team responsible for how members experience dubbed audio, ensuring Netflix customers across the globe get the highest quality experience from our localized audio assets.  You will be overseeing a team covering a specific slate within your local territory.  This will include a team of Title Managers and Language Production Managers who are managing the execution of the launch of all dubbed assets on titles.\n\nWe are seeking a candidate who has strength in leadership, strategic thinking, self-motivated, quick-thinking, flexible, able to pivot when necessary, and able to juggle multiple and diverse responsibilities. The candidate should have experience in managing a team, a passion for language and an appreciation for regional and cultural nuances. This is a demanding and fast-moving position that requires someone who can have a holistic approach to managing a team locally while working closely with other leaders or global teams to produce Dubbing in up to 36+ languages.  \n\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Oversee a local Japan Title Management and Language Production team that will be managing multiple large-scale dubbing projects (longform and shortform dubbing, as well as accessibility assets).","Continue to manage a smaller slate of titles within the respective country.","Foster relationships and expertise with Dubbing’s main cross functional teams, to ensure the team is as upstream as possible in title-level conversations to be able to collect context and feedback as it applies to individual local slates, ensuring the Dubbing team continues to operate as an informed captain.","Develop strategic business solutions and creatively apply them to the team’s challenges and limitations.","Maintain tight and consistent alignment with global Dubbing leadership, Global Resource Strategy, and Dubbing Strategy and Innovation.","Continue to educate, grow and develop their team, keeping them focused on the overall goal of creative and operational excellence of Netflix content.","Manage the overall country/vertical slate for their team, utilizing content team signals for measured distribution of titles across each Title Manager and Language Production Manager.","Collaborate with other country, vertical and territory leaders to ensure alignment and execution of creative best practices.","Contribute to a continuous awareness and implementation of the Netflix Culture amongst the team by leading or delegating initiatives.","Monitor and adapt impactful initiatives to the respective country, and ensure a solid development and roll-out of global/regional/local initiatives.","Explore and support further innovation with regard to in-territory dubbing standards and workflows.","Be sensitive to the local competitive landscape in the respective market.","Closely monitoring of activities of competitors' landscapes that could influence dubbing capacity and general market behavior."]},{"title":"Role Requirements","content":["A minimum of 7+ experience in management, dubbing operations, creative services, and/or sales/client services or a related localization and dubbing position.","A working knowledge of the local slate.","Ability to inspire trust and team-building skills while creating professional representation on behalf of Netflix.","Provide innovative thinking around scalable solutions and workflows, constantly questioning existing systems and looking for a better way.","Highly analytical and able to get to the root cause of a problem; creatively figure out a solution or propose changes to existing workflows as required.","A strong understanding of Dubbing workflows and pipelines, including real-time workflows and the creative nature of the business.","Ability to supervise several team members executing on titles at various production points (from development through delivery).","Contribute to the company's culture of curiosity and self-disciplined pro-active responsibility as part of the Dubbing team.","Have an interest in the intersection of technology, operations, creativity, and business.","Adept at writing, facilitating and presenting analyses."]},{"title":"Education:","content":["Bachelor's degree preferred and/or equivalent, relevant work experience."]},{"title":"Languages:","content":["Fluency in English and Japanese is mandatory."]}],"location_emoji":"🇯🇵"}