{"title":"Engineering Manager, Billing Platform","location":["Los Gatos, California"],"attendance":["Hybrid"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Engineering Manager","Billing Platform","Project Management","Software Engineering","Distributed Systems Architecture","Technical Execution","Commerce"],"skills":["commerce","software engineering","distributed systems architecture","technical execution","hyper-scale systems","large-scale distributed architectures","stateful systems"],"overview":"The Engineering Manager, Billing Platform position at Netflix involves leading a team of engineers in designing and delivering scalable and accurate billing solutions, while ensuring accurate charging and revenue collection for Netflix.","description":"At Netflix, we want to entertain the world and are constantly innovating how entertainment is imagined, created, and delivered to a global audience. A part of that innovation is also giving our members a smooth and reliable billing experience. The Billing Platform Team is at the core of recurring subscriptions at Netflix. Our highly available platform renews and invoices 240+ million Netflix subscribers around the world successfully, handling millions of transactions flowing through our services every day. Billing services are critical for Netflix and come under SOX scope as they collect and report revenue for the business. We design and operate these services to be scalable and resilient with a focus on correctness.  \n\nAs the manager of the team, you will be a key leader within Growth Engineering and will be expected to balance delivering high-performance, scalable, and highly available systems with the responsibility of making sure we are accurately charging our members, enabling all flows that need invoicing and gift flows, while collecting and reporting revenue and taxes for Netflix. This is an exciting role, and to be successful, you must have a strong background in commerce, software engineering, distributed systems architecture, and technical execution.  \n\n","requirements":[],"extras":[{"title":"What you will do:","content":["Lead, mentor, and develop a team of highly talented senior engineers, cultivating a driven, high-performing, inclusive culture.","Lead with engineering curiosity and a high bar for engineering excellence.","Envision and deliver massive-scale, accurate, compliant, and distributed solutions for Commerce.","Foster strong partnerships with stakeholders in engineering and other functions towards mutual success.","Define technical roadmap along with the team and execute with a bias to action."]},{"title":"What we are looking for:","content":["BS or equivalent experience in Computer Science, Computer Engineering, or related field.","Experience leading engineering teams as a manager. Can inspire and grow senior engineers.","Background in building hyper-scale systems for commerce, monetization, and global finance.","Demonstrated experience in large-scale distributed architectures. You have demonstrated success as an engineer/architect of complex distributed, stateful systems.","Clear communicator, switching communication as needed, between engineering and financial stakeholders with ease.","A strong thought partner for Product. Equally passionate about working with engineering and non-engineering stakeholders.","Focused and disciplined at executing multiple priorities simultaneously while delivering on technical, business, and people ambitions for the team and stakeholders.","Engineering mindset that attracts great engineering talent that is curious, inclusive, and driven to the mission. A great role model for the team.","Highly aligned with Netflix Values"]}],"location_emoji":"🇺🇸"}