{"title":"Engineering Manager, Consolidated Logging","location":["Los Gatos, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Engineering Manager","Consolidated Logging","Consumer-facing Logging Infrastructure","Data Engineering","System Design","Multi-disciplinary Team Leadership","Recruiting"],"skills":["software engineering","data engineering","system design","leadership","recruiting","feedback","coaching"],"overview":"Netflix is hiring an Engineering Manager to lead the Consolidated Logging team, responsible for the consumer-facing logging infrastructure that enables analysis, experimentation, and personalization across the entire Netflix experience.","description":"As Netflix continues to grow, we are venturing into exciting new frontiers that help our members find the content they’ll most enjoy. At the core of all this innovation is reliable, high-quality data which fuels progress in the form of new user experiences and personalization.\n\nNetflix is looking for a seasoned engineering leader to head the Consolidated Logging team. This team is responsible for the consumer-facing logging infrastructure which enables analysis, experimentation, and personalization across the entire Netflix experience. In this role, you will be responsible for building and leading a team of extraordinary engineers who will partner across the company to build cutting edge improvements to the Netflix product. You will help influence and guide projects from end-to-end: ideation to production.\n\nTo be successful in this role, you need to be a strong people manager; great at giving and receiving feedback, fostering new ideas, and empowering others. You also need a strong software engineering background, to be a quick and data-driven learner, to have proven data engineering and system design skills, and the ability to lead large multi-disciplinary, cross-functional teams. \n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Recruiting: You are constantly on the lookout for talent and have a knack for recognizing and attracting top-tier engineers to your team. You understand the importance of building an amazing team that is additive and diverse, and the value it brings to the overall company.","Feedback & Development: You will coach and guide employees through their strengths and weaknesses through regular feedback.","Contribute to Data Science & Engineering Leadership. You will be expected to participate in leadership conversations and interview for engineering teams across Netflix.","Vision: You intuitively understand business and technology and you leverage that to guide a team by providing relevant context and inspiration.","Partnership: You will continue to establish strong relationships with both business and technical leaders across Netflix."]},{"title":"Skills & Characteristics:","content":["You are a natural people leader who also demonstrates humility. You care deeply about people, and their success. You invest in your relationships, so that you have an understanding of the whole person and their perspective.","You’re not afraid of hard conversations, and are gifted at coaching your colleagues through difficult situations. You are comfortable sharing your perspective on challenging people dynamics.","You seek to de-escalate tense situations, and are creative & flexible in finding balance with partners to maximize impact.","You are a strong communicator, and self-aware about how others perceive your comments. As someone in a leadership role you aim to be assertive, not passive nor aggressive, in providing input, support, and feedback.","You are forward-looking and able to anticipate the investments Netflix should be making to improve efficiency, innovation, and alignment. You identify areas for continuous improvement, and persistently advocate for action to address them.","You have an impeccable eye for technical talent, and a history of influencing hiring decisions across organizations. In this role you will be expected to understand how the Data Science & Engineering organization’s broad hiring strategy translates into the needs of our team, and our partners.","You’re allergic to micromanagement. You prefer to give context, delegate, and watch amazing people exceed your hopes and expectations.","You work hard, and you have healthy boundaries. You know how to prioritize both your work and personal commitments without set boundaries or guidelines."]},{"title":"Preferred Requirements:","content":["You have 10+ years software development experience. You have a mastery of object-oriented design and design patterns, and programming skills.","You have 5+ years of engineering team management experience.","You have a MS in Computer Science/Engineering, or related field.","You have used big data technologies (i.e. Spark/MapReduce/Hadoop, etc.) at one point in your career, and have built web-scale data pipelines.","You have used SQL and reporting tools at one point in your career, and are analytically savvy."]}],"location_emoji":"🇺🇸"}