{"title":"Engineering Manager - AV Iteration and Delivery Engineering","location":["Los Gatos, California"],"attendance":["Remote"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":["backend software engineering","frontend software engineering","software engineering teams","coaching","mentoring","architecture evaluation","technology innovation"],"overview":"","description":"Netflix is the world's leading streaming entertainment service with over 230 million paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nPromotional Media Engineering builds the products and services our internal and external creative partners use. Our purpose is to build products and tooling that enable us to tell stories about our stories. We build technology that enables the entire workflow of promotional content, from the planning of images and trailers to the distribution of promotional assets on Netflix service. We have an ecosystem of products that help us manage our millions of assets at scale. We are a very unique organization that partners with product creatives, marketing, consumer engineering, and algo/DSE engineering teams to imagine how we can create better images and trailers, operationalize and scale them, and run tests on what assets can drive choosing on our service.\n\nThe AV Iteration and Delivery Engineering team is accountable for the Promotional Video Iteration & Fulfillment, and the QC problem domains, with a near-term focus on recipe-based AV Assembly (transformative, not creative).\nWe are looking for an Engineering Manager to deliver high-impact innovation and lead a diverse team of talented backend and frontend software engineers. In this role, you will partner with Product, Design, DSE/Algo, Marketing and Product Creative Strategy (PCS) stakeholders to build technology solutions. \n\n","requirements":[],"extras":[{"title":"What You Will Do:","content":["Coach, mentor, and grow a diverse team of backend and frontend software engineers fostering an inclusive, high-performing environment.","Act as a strategic technical advisor continuously reevaluating architectures to meet the evolving technology needs of a growing business.","Drive technology innovation for new and existing products while navigating the tradeoffs and balance between critical business needs and strong engineering principles.","Position yourself as a thought partner with stakeholders and build trusting relationships with Product, Design, and Operations to define and execute innovative roadmaps.","Be a strong role model in alignment with our culture of Inclusion, Freedom & Responsibility, Informed Captaincy, and Context Not Control.","Demonstrate consistent curiosity about the space and contribute towards the broader engineering strategy and goals."]},{"title":"Qualifications:","content":["You have at least 3 years of experience managing inclusive high-performing software engineering teams.","Passionate about mentoring and coaching software engineers with a balance between giving context and driving direction.","You are an innovative thinker with experience leading large complex projects across multiple disparate independent engineering teams.","A strong product mindset to work through ambiguous requirements, balance competing priorities across multiple cross-functional stakeholders, and make thoughtful decisions to push the roadmap forward.","Passionate about building highly scalable solutions to meet the evolving technology needs of a growing business.","Experience partnering with a product team to build a vision for how UX, UI, and the back-end will come together on a given product or feature.","You have proven skills building software systems in a distributed cloud environment deployed in a CI/CD fashion."]}],"location_emoji":"🌍"}