{"title":"Engineering Manager, Data & Feature Infrastructure, Machine Learning Platform","location":["Los Gatos, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Engineering Manager","Data & Feature Infrastructure","Machine Learning Platform","ML Infrastructure","ML Practitioner","ML Feature Computation","Feature Definitions"],"skills":[""],"overview":"An experienced engineering leader is sought to manage the Data & Feature Infrastructure team within the Machine Learning Platform org at Netflix, with a focus on building scalable ML infrastructure and centralized feature/embedding stores to support various ML domains and ensure a world-class user experience leveraging the ML Platform.","description":"Netflix is the world's leading streaming entertainment service with 238M paid memberships in over 190 countries enjoying TV series, documentaries, and feature films across a wide variety of genres and languages. Machine Learning drives innovation across all product functions and decision-support needs. Building highly scalable and differentiated ML infrastructure is key to accelerating this innovation.\n\nThe Opportunity\nWe are looking for an experienced engineering leader to lead the Data & Feature Infrastructure team in the Machine Learning Platform org. The ML Platform org is chartered to maximize the business impact of all ML practice at Netflix and innovate on ML infrastructure to support key product functions like personalized recommendations, studio innovations, virtual productions, growth intelligence, and content demand modeling among others.\n\nThe Data & Feature Infrastructure team is building a next-generation event-driven ML feature computation platform to significantly up-level productivity of ML practitioners.  This managed infrastructure solution enables ML practitioners to easily write and test feature definitions, while our Platform takes care of the computation, storage, and serving of feature values for both training and low-latency member-scale inference use cases. The team is also innovating on centralized feature/embedding stores to enable dataset sharing across various ML domains across Netflix.\n\nThis team is responsible for high-profile projects with great visibility across senior engineering and data science leaders. We are looking for a leader who has ideally been an ML practitioner or led a team of ML practitioners, so they can empathize with the needs of the customer and be a strong advocate for ensuring our customers have a world-class user experience leveraging our ML Platform.\n\n","requirements":[],"extras":[{"title":"Expectations","content":["Vision: Understanding the media business and how technology is changing the landscape will allow you to lead your team by providing inspiring context!","Partnership & Culture: Establishing positive partnerships with both business and technical leaders across Netflix will be critical. We want you to regularly demonstrate the Netflix culture values like selflessness, curiosity, context over control, and freedom & responsibility in all your engagements with colleagues.","Judgment: Netflix teams tend to be leaner compared to our peer companies, so you will rely on your judgment to prioritize projects, working closely with your partners - the personalization research leaders.","Technical acumen: We expect leaders at Netflix to be well-versed in their technical domain and be a user of the products we are building, so they can provide guidance for the team when necessary. Proficiency in understanding the needs of research teams and how to bring efficient ML infrastructure to meet those needs will be crucial.","Recruiting: Building and growing a team of outstanding engineers will be your primary responsibility. You will strive to make the team as excellent as it can be, hiring and retaining the best, and providing meaningful timely feedback to those who need it."]},{"title":"Minimum Job Qualifications","content":["Experience leading a team responsible for large-scale ML Infrastructure","Outstanding people skills with high emotional intelligence","Excellent at communicating context, giving and receiving feedback, fostering new ideas, and empowering others without micromanagement","Willing to take action, without being stubborn - the ability to recognize your own mistakes","Your team and partners see your humility all the time and diverse high-caliber talent wants to work with you"]},{"title":"Preferred Qualifications","content":["ML practitioner leader or individual contributor experience owning end-to-end ML functions for a product domain","Built offerings for ML Researchers, Engineers and/or Data Scientists","10+ years of total experience including 3+ years of engineering management","BS/MS in Computer Science, Applied Math, Engineering or a related field","Exposure to modern experimentation and A/B Testing methodologies for consumer-facing applications","Experience building high-scale services on a public cloud like AWS and exposure to Scala and Python","Experience in Flink, Kafka and/or Spark computations"]}],"location_emoji":"🌍"}