{"title":"Events Specialist - Korea","location":["Seoul, South Korea"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"Netflix aspires to provide great entertainment for people everywhere from the world's best creators across movies, TV series, documentaries, comedy and more. Our members have control over what they watch, when and where. It's an amazing time to join the Netflix team as we continue to transform entertainment. If you are a talented public relations executive with a passion for content and entertainment, keep reading!\n\nAbout the Role \n\nWe are seeking an Events Specialist who will play a key role in supporting the team of seasoned professionals developing and executing strategic events from in-person to virtual and everything in between in Korea for external and internal audiences. \n\nTasks are varied, extensive and timely. They will include but are not limited to: Lead meeting planning and preparation, work with other department to put in place a set of best practices that enable us to move quicker, bigger and better; coordinating with outside agencies and vendors and internal teams; assisting with meeting schedules and facilitation, including help putting together documentations and coordinating audiovisual needs; updating various lists, documents; helping to coordinate the invite process; trafficking creative and screening asset requests. Support in the planning, managing and execution of press junkets, title premieres, fan engagements and other internal employee-facing events and other duties as assigned.\n\nA go-getter, you should not be afraid to push the envelope and bring new ideas to the table, as well as experiment with the latest tools and technologies to elevate our events into unique-to-Netflix  experiences. From external-facing events to internal employee-facing events; you will display curiosity about building holistic event experiences with new and innovative event ideas. \n\nReporting to the Director of Events for APAC, this is a hands-on role and one that requires end to end project management of some events, whilst working as a support on other events. You will have amazing attention to detail, the ability to see the big picture as well as have the ability to partner seamlessly in Korea.\n","requirements":[],"extras":[{"title":"The work:","content":["Produce creative and well-executed Events that are unique to Netflix","Creative conceptualization, crafting of creative proposals and quotations with external agencies","Ability to pivot quickly and maintain a positive attitude","Proactively manage feedback and perspectives from cross-functional partners and APAC team to deliver impactful event campaigns","Able to anticipate potential problems, willingness to be flexible and get the job done","Adaptable to hybrid or virtual events, with knowledge of what it takes online and off, including the latest tools, platforms and technologies to bring our vision to life","External vendor and agency management and supervision","Produce creative and well-executed experiences that are consumer and Press centric and unique to Netflix","Curious and can contribute effectively outside of their speciality"]},{"title":"The candidate must:","content":["8+ yrs of events experiential marketing preferably from the entertainment industry that includes managing, executing, planning events at an agency, studio, network or with a brand","Be proactive about their tasks and responsibilities, while exercising sound judgment even when faced with ambiguity","Be able to pivot quickly and maintain a positive attitude and sense of humor","Have budget and time management skills; within tight deadlines","Be agile with meticulous attention to details","Be confident and able to express ideas and point of view thoughtfully and with passion","Be transparent and unafraid to challenge, ask questions or call out obstacles","Agile","Have excellent organizational skills and ability to roll up your sleeves to get things done","Have excellent communication in Korean and English","","The Netflix culture attracts talents who exhibit good judgment, innovation, selflessness, courage, impact, candid communication, passion, and curiosity. Read our culture memo. If it resonates with you, maybe you’re the right person to join our team."]}],"location_emoji":"🇰🇷"}