{"title":"Executive Producer, Transmedia Content - Game Studio","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"The Executive Producer, Transmedia Content - Game Studio position is responsible for supporting content teams in identifying and prioritizing key Netflix IP suitable for game adaptation, as well as coordinating communication between linear content teams and game producers, and building a transmedia ecosystem.","description":"We’re looking for a creative and highly-skilled Transmedia Content Executive to help us amplify Netflix’s world-class entertainment experience through a connected content ecosystem. As a transmedia content executive, you will be primarily responsible for supporting content teams in identifying and prioritizing key Netflix IP suitable for game adaptation, and working with game teams to help pair gameplay concepts with suitable Netflix IP. The right candidate will bring industry-leading expertise and attention to detail to build transmedia franchises as part of a platform that creates member joy.\n\nWe're building the foundation for a small, densely-talented team with a background in content development and/or interactive entertainment. The Transmedia team will help serve as creative connective tissue between our games, product, and content teams on key titles and platform features. We’re looking for that group of key leaders who are aligned with our core values, and care deeply about the experiences they create as well as the people they make them with.  Those who bias towards action and are energized by the learning that comes with bold experimentation at an agile pace. As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. \n\n","requirements":[],"extras":[{"title":"Core Responsibilities Include:","content":["Work with the content organization (film, series, animation, regional) to help identify and prioritize suitable Netflix IP for game adaptation.","Coordinate and facilitate communication between linear content teams and game producers (external or internal).","Work with internal game teams to support a creative process that leads to creation of new IP suitable for series or film adaptation.","Coordinate with cross functional creative leads and the Head of Transmedia on the strategy, structure and plans to build a transmedia ecosystem.","Act as a central hub that tracks, reports and updates game rights management.","Identify and evaluate soon-to-be or newly released games as candidates for adaptation and possible transmedia game connectivity.","Collaborate with teammates by providing and receiving creative/team feedback, improving others’ creative contributions, and providing clear creative goals","Bring an entrepreneurial spirit"]},{"title":"Qualifications:","content":["5-8 years of experience as a Development Executive, Producer, EP, Narrative Director","Film and TV experience with strong experience in game adaption space OR game development experience with strong experience in story","A track record of high level execution on commercial projects","Ability to form, maintain, and influence relationships with content executives and creative talent","Demonstrated commercial sensibility to determine which film/series/unscripted concept is well suited for a games OR vise versa; how to think about games as the basis for adaptation.","Relationships with agencies, management companies and production companies a plus","Relationships with game development studios a plus","Interest and experience in early stage creative development","Ability to lean into data as needed to make informed decisions","Strong written and oral communication and presentation skills","Highly driven, well organized, and execution-focused"]}],"location_emoji":"🇺🇸"}