{"title":"Executive Assistant - Next Games","location":["Helsinki, Finland"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Executive Assistant","Support","Scheduling","Coordination","Event Planning","Communications","Budget Tracking"],"skills":[""],"overview":"","description":"Next Games is a Helsinki based Netflix Game Studio, focusing on creating compelling fans-first interactive experiences by combining the stories of well-known movies and shows with engaging game mechanics. An unwavering focus on fans and fun gameplay is at the core of the studio’s game development, free from the constraints of free-to-play.\n\nIf working on globally recognised entertainment IPs, or helping develop the next blockbuster game IP; that’ll be available on the world's biggest streaming platform Netflix, sounds like your cup of tea, Next Games can provide that opportunity.\n \nWe are seeking an experienced Executive Assistant who will provide support to a small group of executives and from time to time a handful of other Directors within Netflix Finland. A successful candidate will be self-motivated, quick-thinking, proactive and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and an unwavering attention to detail at all times.\n \nThis is a versatile and fast-moving position that requires someone who is able to exercise good judgment, to respond quickly to changes, and show significant initiative. A can-do attitude and willingness to roll up your sleeves beyond your immediate job description will guarantee you success in this role.\n","requirements":[],"extras":[{"title":"Key responsibilities","content":["Supporting the Studio Management Team with scheduling meetings and bookings with multiple parties across multiple locations and time zones in close collaboration with other Executive Assistants within the global Netflix organization","Main point of coordination for visitors to the Helsinki office from other Netflix offices and teams, including setting up agendas, planning and coordination responsibility for schedules, meeting rooms, possible restaurant or off-site bookings","Planning and coordinating company-wide and smaller events in or outside of the office in collaboration with Communications and Office teams (e.g. off-sites and social events, including agenda planning, booking facilities and catering, and tracking budgets)","Support Office Team in various projects around the office where needed from time to time"]},{"title":"Qualifications & requirements","content":["4+ years experience as an Administrative or Executive Assistant, providing support to multiple executives at a fast-paced company (experience in an entertainment/tech setting a plus)","Previous experience working in an international environment is preferred","Comfortable dealing with multiple stakeholders through written and verbal communications","Great communicator and a team-player who can build strong working relationships with vendors, and internal and external partners","Ability to be discrete and maintain confidential information","Strong written and verbal communication skills in English and Finnish","We operate in Google environment so excellent understanding of Google office tools incl Calendar, Docs, Sheets and Slides is a must.","Ability to produce clear and concise materials with the mentioned tools including trackers, presentations, agendas and memos."]}],"location_emoji":"🇫🇮"}