{"title":"Global Talent Operations Analyst","location":["Mexico City, Mexico"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Workday","Data Analysis","Project Management","Process Improvement","Stakeholder Management","Process Mapping","Excel"],"skills":["Workday experience","Project Planning & Development","Project Execution & Control","Quality Control","Stakeholder Management","Understanding of Process Mapping Concepts","Hands-On Experience"],"overview":"","description":"Netflix is the world's leading streaming entertainment service with 222 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films and mobile games across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any Internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.\n\nThis position is part of the Global Talent Operations Centers (GTOC) which runs the infrastructure to deliver an outstanding talent experience from hire to retire. The role supports the main functions within the global and regional Talent Experience organizations. You will be expected to be independent, articulate effectively, and proactively implement positive improvements that are aligned to our culture.\n\n","requirements":[],"extras":[{"title":"What you will support:","content":["We are a rapidly growing global company. You will assist programs that reach all employees, including 360 feedback, Compensation Review, and benefits, to ensure they run smoothly, so employees can focus on their core roles.","We rely on data to support business decisions. You will partner with all Talent functions to maintain the information in Workday through job/organization changes, business process updates, and reporting.","You will also find ways to improve legacy processes and identify opportunities for streamlining and automation.","Work closely with other business units to map their needs and integrate GTOC services to their way of working.","Act as the primary point of contact and communication for all global project-related queries and coordination. Manage project communication across different time zones.","Oversee and manage the intake of new global projects. This includes gathering initial project requests, evaluating the project's feasibility based on company resources and strategic alignment, and assigning appropriate resources to approved projects","Your job is to diagnose problems quickly and troubleshoot functional and technical issues with HR, end users, and partner teams.","This role enables others to succeed by leading various projects focused on improving the employee experience as well as efficiencies on the Talent team, including recruiting, onboarding, and curation of content on our intranet.","You will continually learn new tools and techniques, implement major infrastructure changes and enable teams to navigate complex changes.","You will analyze and monitor Talent Operations KPI’s in order to suggest improvements and process efficiency"]},{"title":"To be successful, you are:","content":["You’ve done this before. 4+ years HR systems and project management.","Workday experience (employee lifecycle management transactions, data accuracy controls and mass upload execution)","Project Planning & Development: Define project goals and scope, develop and manage comprehensive project plans to meet objectives.","Project Execution & Control: Coordinate and oversee all project phase execution, ensure that project tasks are completed on time and on budget.","Quality Control: Ensure project deliverables meet quality standards and the needs of the stakeholders.","Stakeholder Management: Manage stakeholder involvement, expectations and communication.","Understanding of Process Mapping Concepts: A thorough understanding of process mapping concepts including As-Is and To-Be process analysis.","Hands-On Experience: Proven hands-on experience in creating, analyzing and optimizing process maps. Familiarity with commonly used symbols in process mapping and the ability to accurately represent processes with them.","Proficiency in Mapping Tools: Working knowledge of process mapping tools like Microsoft Visio, Lucidchart, or other similar software.","Continuous Improvement Mindset: Constantly seeks to utilize process mapping and other analytical tools to drive process improvement and operational efficiency.","Advanced user of Excel and Google sheets. You’re also proficient in tools that help eliminate manual steps from HR processes by automating and integrating to ensure greater operational efficiency.","Successful collaborating and providing ongoing support to the Talent team, identifying and resolving customer needs and contributing to the best employee experience","Analytical Skills: Ability to analyze complex data, identify project risks, and formulate action plans.","Have good knowledge of how to use different sources of data (e.g. surveys, interviews, focus groups)","with basic concepts in statistics (e.g. descriptive statistics, correlation) and measurement (e.g. reliability, validity)"]},{"title":"Preferred Qualifications:","content":["Agile project management skills: Certification in Agile methodologies (i.e., CSM, SAFe) is highly desirable.","Change Management skills: Familiarity or certification in change management principles","Interpersonal Skills: Exceptional negotiation and conflict-resolution skills."]}],"location_emoji":"🇲🇽"}