{"title":"Head of Creative Production - UK, Ireland, Israel","location":["London, United Kingdom"],"attendance":["Onsite"],"type":["Full-time"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Creative Production","Team Leadership","Operational Strategy","Local Titles","Cross-functional Collaboration","Market Perspective","Data-driven Decision Making"],"skills":["Product/brand/content","Creative and Operational Excellence","Local titles","High quality creative work at scale","Multidisciplinary team leadership","Product considerations","Marketing/Content concerns"],"overview":"The Head of Creative Production - UK, Ireland, Israel role at Netflix entails leading and developing a team responsible for contextualizing and launching titles across the regions, partnering with internal and external stakeholders to ensure a seamless member experience.","description":"At Netflix, we are reinventing the way people are entertained by both enabling and innovating how visual storytelling is produced, discovered and enjoyed. Netflix provides a platform for stories from different places and different perspectives to reach, connect, and inspire millions of people all over the world.\n\nIn this role, you sit at the intersection of content, promotions and product functions, powering one of the most transformational shifts in the industry. Netflix is the world's leading internet entertainment service with over 220 million members in over 190 countries enjoying TV series, documentaries, feature films, and games across a wide variety of genres and languages. EMEA is now the largest region (by membership) and is key to unlocking future opportunities for Netflix with large headroom for growth across many of the markets and through the expansion of initiatives such as MHU, Advertising and Gaming. \n\nAs the Creative Production Leader across the UK, Ireland and Israel you will grow, develop and lead a team that is ultimately responsible for contextualising what is special about the stories on our service.  Your team strives to authentically represent the multiple narratives that exist in every story so that our members can discover the stories that they will love.  You and your team define and drive the creative and operational strategy for how we represent and launch titles across these regions and partner with internal and external partners to ensure a seamless experience for our members in these countries and beyond.\n","requirements":[],"extras":[{"title":"Key Characteristics Sought:","content":["You value, understand, and can deliver great experiences for our members","Approaches problems with both a local and regional lens","Builds strong partnerships locally, regionally and globally to advocate for the needs of the UKII markets while seeking broader understanding and best practices","First-hand experience working with product/brand/content in UK","Understands that local titles have the power to inspire global phenomena","Strong track record of building and cultivating great locally-oriented teams","You are equally adept at defining and driving both Creative and Operational Excellence","Understands the challenges and importance of driving high quality creative work at scale","Ensures regional and global business context is considered alongside local ambitions to find the sweet spot for the UKII Creative Production team","Inspires a multidisciplinary team toward shared goals, objectives, and opportunities","You are a strong strategic partner to cross-functional leaders","You are a great bridge with other country teams in the region: equally adept at articulating your own vision while also collaborating to drive market success.","Be an invaluable colleague to your cross-functional stakeholders and partners by working with them closely to recognize opportunities and synthesize strategy across other countries, regions, and functions.","You are adept at speaking to Product considerations (member first approach, hypotheses forming and experimentation) as well as Marketing/Content concerns (audiences, how to integrate brand into day to day work, storytelling)","You influence and synthesize functional context and strategy for your teams in a way that best suits the UKII countries.","You are a builder and developer of strong multidisciplinary teams","You’ve grown, managed and evolved teams comprising multiple functions","You know how to develop and sustain a healthy and inclusive organization"]},{"title":"Ideal Candidates Will:","content":["Bring nuanced and deep local experience from the market which allows you to provide input on local creative and operational strategy from a market perspective while influencing regional and global teams.","Be an excellent leader who sees the big picture. You know how to inspire your own team through the challenges of a rapidly evolving business in the UKII market.","Be an invaluable colleague to your cross-functional stakeholders and partners by working with them closely to recognize opportunities and synthesize strategy across other countries, regions, and functions.","Be equally comfortable in “left brain” or “right brain” problem solving, but be most excited when both are deployed at the same time and understand how to leverage data and insights to push the boundaries of creative excellence.","Have an eye for compelling creative, inspire and set a high bar for quality, and advocate effectively on behalf of what’s best for the member experience.","Comfortable working with and applying operational frameworks and best practices","Adept at identifying, innovating and developing opportunities for efficiency and increased impact for the team.","Be an earnest and inclusive leader who will be a great steward of the Netflix culture while also helping it to shape and evolve it over time."]},{"title":"Qualifications:","content":["10+ years of experience managing teams (20+ full-time employees) in an environment that has had to scale with rapid company and market growth.","Proven experience building a diverse team: hiring, developing and managing high performers.","Experience working in the UK market and other EMEA markets, with a nuanced understanding of navigating the local challenges and opportunities while synthesising regional and global context.","Experience in managing teams and influencing outcomes in a matrix environment.","Comfort working at a company, and in a team, where data and insights are heavily leveraged in decision-making. First-hand experience with A/B testing is a plus.","Fluency in English (additional languages are a plus)."]}],"location_emoji":"🇬🇧"}