{"title":"Head of Photo & AV Studio - APAC","location":["Singapore, Singapore"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nAbout the Photo & Audio Visual (AV) Studio team\nThe Photo & AV Studio team has the enviable position of straddling two worlds in the entertainment industry: Photo & AV asset creation and global communication strategy. We specialize in capturing and creating photo & video assets that shape, enhance and support our publicity campaigns for our Netflix content including Series, Films, and Documentaries. Simply put, we produce content that compels people to watch our shows through various media.\n\nAbout the Role\nWe’re looking for a senior creative storyteller with an editorial and/or entertainment background to be based close to one of our production hubs. The role requires a high level of creativity, an inquisitive, innovative and self-motivated personality, and a succinct communicator with the ability to start and drive initiatives and scale operational needs at a regional level. As the regional lead for the team, you will manage a diverse team of Photo & AV specialists across APAC focused on making our content stand out and creating an impact on the industry and consumers alike, compelling them to watch Netflix content. This role is highly cross functional working with Publicity, Social, Marketing, Product, and global Photo & AV Studio leadership to provide best in class photography and on-set video content from our TV and films to create stories press and consumers alike can’t stop talking about. \n","requirements":[],"extras":[{"title":"Responsibilities of the role:","content":["Be a regional creative and editorial expert, driving innovative storytelling strategy based on insights and the external media landscape to connect consumers and press to communications strategy more effectively in an increasingly visual world","Build new frameworks and approaches to reimagine what editorially-driven content can be in order to elevate our title and overall communications strategies","Work with global partners in creating and championing better ways of asset creation, management, and storage in order to find global scale without losing local or creative nuance","Provide regional oversight on operational strategies and creative output by being a connection within the global Photo & AV Studio leadership team to drive APAC needs globally while adopting global best practices locally","Manage an agile team of Photo and Audio Video specialists across APAC"]},{"title":"Skills & Requirements:","content":["12-15+ years experience working across visual asset creation, publishing, publicity and/or entertainment","Deep background in leading diverse creative and/or editorial teams and growing those teams from a “start-up” phase to more established organizations","Strong people manager who can lead through context and not control","Must possess solid organizational skills, model effective time management and deliver consistently excellent verbal and written communications across internal and external teams","Strong creative eye with a keen understanding of visual storytelling in the service of audience-first communication strategies","Must be able to work independently, make sound decisions, think strategically, and maintain accuracy and attention to detail","Experience working with TV/film productions, talent, filmmakers and with publicity teams","Understand and interest in copyright laws, usage licenses and embargoes","Understand the photography/video industry and preferably with networks in each","Strong knowledge in creative digital assets formats and asset management","Extensive knowledge of Adobe Suite including Photoshop and Pro is preferred","Fluency in English and ideally, one other Asian language"]}],"location_emoji":"🇸🇬"}