{"title":"HR Associate, SEA","location":["Manila, Philippines"],"attendance":["Onsite"],"type":["Full-time"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["HR Associate","Talent Management","Project Management","Inclusion and Diversity","Data Analysis","Compliance","Presentation Skills"],"skills":[""],"overview":"The HR Associate, SEA position at Netflix will work closely with the Head of Talent and HR Business Partners to support and deliver HR/Talent-related solutions to teams in Southeast Asia, including managing regional and local programs and projects.","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nThe Opportunity\n\nOur HR Associate will work very closely with our Head of Talent and HR Business Partners to support and deliver HR/Talent-related solutions to various teams within Netflix Southeast Asia. The role will include management of programs and projects that are regional, as well as local. For regional programs and projects, the HR Associate will work closely with other HR/Talent team members based in other countries. The HR Associate must be comfortable working autonomously in a fast-paced environment with the ability to make good judgment calls and manage multiple tasks and projects. They must be a motivated self-starter with curiosity and strong communication skills.\n\n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Support Head of Talent and HR Business Partners on planning and delivering of HR/Talent-related programs and projects, such as new hire onboarding, manager development, culture delivery programs and employee sentiment surveys","Support the Inclusion and Diversity agenda on inclusion-related sessions and trainings, including providing support to the Employee Resource Groups (ERGs)","Organize and manage logistics and agenda for HR/Talent-related trainings and activities, including company meetings, team meetings, offsites and events","Gather and interpret HR/Talent-related data and metrics, and be able to explain and present the data in a format that meets the needs of the team","Coordinate on local compliance needs, and work closely with employee services and cross-functional teams such as Legal on implementation and change management","Create presentations and documents mainly using PowerPoint and Google Apps","Liaise with cross-functional business partners, both internal and external, as needed","Maintain flexibility and openness to take on additional tasks and projects as necessary or assigned"]},{"title":"Qualifications:","content":["Minimum of 3 years of human resources experience","Learning and development background is preferred","Strong communication skills and fluent in English","Exceptional organizational and project management skills","Team player who operates in a fast-paced team-oriented setting, with a strong ability to build relationships and trust","Ability to be discrete and maintain confidential information","Ability to handle urgent requests and tasks in a timely manner when needed","Proficiency in Google Apps, Microsoft Word, Excel, and PowerPoint is required","Ability to work collaboratively in a highly cross-functional environment","Ability to accommodate changes and flex one’s style to better serve the needs of the team and company","Have an entrepreneurial mindset and are eager to flourish in our unique company culture (see Who We Are)."]}],"location_emoji":"🇵🇭"}