{"title":"iOS Software Engineer (L4) - Streaming and Discovery Experiences","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["iOS Software Engineer","Streaming and Discovery Experiences","Netflix","Consumer Engineering","iOS","Android","TV apps","cross-functional teams","product management","experience design","creative production","streaming algorithms","client playback systems","UI","members","engage","cinematic experiences","delight","attract","retain","members interact","find","favorite Netflix title","global","diverse organization","genders","sexual orientations","upbringings","nationalities","ages","socioeconomic","educational backgrounds","passionate","building compelling mobile experiences","experienced iOS engineers","drive impact","iOS Client Foundations","foundational architecture","frameworks","developer velocity","set standards","App quality","experience metrics","scalable app architecture","foundational scaffoldings","documentation","communication","large-scale future-looking foundational architecture","UI","infrastructure","performance","quality","accessibility","elegantly designed","performant architectures","UI experiences","millions of users","partner closely","deliver solutions","UI development","efficient","enjoyable","iOS Product Engineering","cross-platform UI team","deliver ✨joy✨","stories","A/B testing","highly performant UI experiences","data-driven optimizations","device","network ecosystem","operational testing","automation solutions","high-performance","fast-paced culture","experimentation","autonomy","ownership","skills","experiences","wide variety","building frameworks","technologies","UIKit","Core Animation","Objective-C","Swift","Apple frameworks","scalable","modular","extensible","scales","live data transactions","technical leadership","pragmatic","deeply impactful architectural decisions","technical landscape","iOS development","introduce new paradigms","practices","thoughtful approach","problem-solving","tradeoffs","over-engineering","Sets You Apart","Curious","unfamiliar technologies","consumer base","product vision","different perspectives","feedback","relevant information","strong relationships","clear communication","asking questions","seeking knowledge","ambiguous situations","elevate","knowledge","skills","abilities","inclusive","collaborative environment","successful","role","pushing boundaries","technology","exploring uncharted waters","supervision","various new","familiar technologies","transparent observability tooling","enhance developer velocity","empowering other engineers","understand","use cases","unique perspectives","balanced views","value the opinions","fleshing out solutions","fill out your blind spots","familiarity","Data-centric approach","app development","navigate ambiguity comfortably","establishing strong relationships","care","quality & performance","shipped","Netflix’s culture"],"skills":["UIKit","Core Animation","Objective-C","Swift","Apple frameworks","iOS development","paradigms and practices"],"overview":"The iOS Software Engineer (L4) - Streaming and Discovery Experiences position is responsible for improving the Netflix experience by building engaging and cinematic iOS apps, implementing streaming algorithms, and creating UI frameworks for an efficient and enjoyable UI development process.","description":"Netflix is the world's leading streaming video service with over 200 million paid memberships in 190+ countries. The Consumer Engineering team builds the industry-leading Netflix iOS, Android, and TV apps. To bring new kinds of engaging and cinematic experiences to life, we partner closely with many cross-functional teams including product management, experience design, and creative production. \n\nThe Streaming and Discovery Experiences Engineering organization continuously improves the Netflix experience to delight, attract, and retain our members. We’re responsible for much of what our members interact with when they use Netflix - from our streaming algorithms to our client and server playback systems to the UI our members use daily to find their next favorite Netflix title. \n\nWe are part of a global, diverse organization that includes people of all genders, sexual orientations, upbringings, nationalities, ages, and socioeconomic & educational backgrounds. We encourage anyone passionate about building compelling mobile experiences that touch audiences worldwide to apply.\n\nWe are hiring for multiple roles.  Here’s an overview of the teams that are looking for experienced iOS engineers to drive impact:\n\niOS Client Foundations\n\nThe iOS Client Foundations team shepherds and builds foundational architecture and frameworks that power the Netflix iOS app. Our three core values are: Accelerate developer velocity, pave the path and set standards for App quality and experience metrics, and pave the path to build scalable app architecture (foundational scaffoldings), frameworks, documentation, and communication for iOS platforms across Netflix.\n\nOur responsibilities include implementing large-scale future-looking foundational architecture and frameworks ranging from core UI frameworks to core infrastructure that enables existing and future innovations for product teams across Netflix. We care deeply about the performance, quality, and accessibility of the Netflix app. We’re passionate about creating elegantly designed, highly performant architectures that empower engineers to build unique UI experiences used by millions of users across the globe. We partner closely with teams across Netflix to help deliver solutions that make UI development efficient and enjoyable.\n\niOS Product Engineering\n\nOn our cross-platform UI team, we are passionate about delivering ✨joy✨ to hundreds of millions of Netflix members worldwide, whether traveling to a remote location or at home with family. We work on iOS mobile product innovations that connect our members to the stories they love.\n\nOur responsibilities include extensive A/B testing on a wide variety of devices by building highly performant UI experiences. We care deeply about UI performance, quality, and accessibility of the Netflix iOS app. To bring new kinds of engaging and delightful experiences to life, we partner closely with many cross-functional teams, including product management, experience design, and creative production. \n\nWe work on data-driven optimizations at scale in a diverse and sometimes unforgiving device and network ecosystem. We leverage sophisticated operational testing and automation solutions to support our high-performance, fast-paced culture of experimentation, autonomy, and ownership.\n","requirements":[],"extras":[{"title":"Must-have skills & experiences","content":["Bring a wide variety of experience building frameworks/libraries with technologies like UIKit, Core Animation, Objective-C and/or Swift, and other Apple frameworks to the team.","Help create a scalable, modular, extensible, and highly performant app that scales with high volumes of live data transactions on the app.","Provide technical leadership to drive pragmatic yet deeply impactful architectural decisions that address current and future product needs.","Deep understanding of the technical landscape of iOS development and can introduce new paradigms and practices.","Taking a thoughtful, practical approach to problem-solving that considers tradeoffs and avoids over-engineering."]},{"title":"What Sets You Apart","content":["Curious about a broad range of new or unfamiliar technologies, our consumer base, and product vision.","Seek different perspectives, feedback, and relevant information to continuously grow and improve.","Maintain strong relationships with cross functional teams through clear communication.","Take a thoughtful and practical approach to problem-solving that considers tradeoffs and avoids over-engineering.","Comfortable asking questions and seeking knowledge in unfamiliar or ambiguous situations.","Endeavor to elevate the knowledge, skills, abilities of yourself and others that fosters an inclusive and collaborative environment."]},{"title":"You will be successful in the role if","content":["You enjoy pushing the boundaries of what technology can do and exploring uncharted waters with some supervision.","You are curious and ready to learn about various new or unfamiliar technologies, our consumer base, and product vision.","You have experience building transparent observability tooling and solutions that enhance developer velocity.","You love the idea of your work empowering other engineers and striving to understand their use cases.","Your colleagues appreciate the unique perspectives and balanced views you bring to collaborations.","You value the opinions of others when fleshing out solutions to fill out your blind spots.","You have familiarity with the Data-centric approach to app development.","You always seek different perspectives, feedback, and relevant information to navigate ambiguity comfortably.","You are effective at establishing strong relationships with cross-functional teams through clear communication.","You deeply care about the quality & performance of the product shipped.","You have read about Netflix’s culture and think you would thrive here"]}],"location_emoji":"🇺🇸"}