{"title":"Language Manager, Japan","location":["Tokyo, Japan"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Language Manager","Japan","Netflix","translation","cultural standards","linguistic quality","style guides"],"skills":[""],"overview":"","description":"It’s an exciting time to join Netflix as we continue to transform entertainment globally. We are bringing new stories to millions of people worldwide by promoting our original, exclusive content. A key to growth is our ability to translate and adapt culturally most things Netflix creates, from beautiful user interfaces to cinematic original programming. As we move beyond 200 million members and hundreds of partnerships worldwide, we are looking for talented individuals to drive better creative outcomes for our global presence.\n\nLike all companies, we strive to hire the best and we value integrity, excellence, respect, inclusivity and collaboration. What is special about Netflix, among other things, is our Culture.\n\nWe treat each country we enter differently since it is not just about translation, it is about providing our audience with an experience that feels local, and we do it at scale.\n\nOur team is looking for an experienced Language Manager to drive and manage the language strategy for Japan on the Netflix product and content, and to collaborate closely with external resources and internal stakeholders and partners in order to deliver the best user experience to our members and non-members in the market.\n\nThis highly motivated individual will be based in our Tokyo office and will work closely with the rest of the Globalization team in the US, Asia and Europe.\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Develop and maintain linguistic and cultural standards and guidelines, define quality expectations across the whole localized user experience, including supporting the development of style guides, glossaries, tone and voice of Netflix product (UI, navigation, synopses) and content (subtitle, title name localization, supplementals) in the market.","Monitor the linguistic quality output of Japanese language by using our internal MQM-based LQA model and other internal quality metrics and KPIs, and provide feedback and context to the translation teams, in order to ensure the best resource fit for the highest quality impact.","Communicate proactively with Globalization cross-functional teams to anticipate, identify and fix linguistic, product, and subtitling issues related to the region.","Proactively engage with relevant stakeholders in the market (e.g. Marketing, PR, Social) for additional context and insights on high visibility titles and to define and influence the best creative and linguistic approach for top priority content.","Facilitate collaboration between internal stakeholders (in region and in the US) and vendors, making sure the necessary resources have access to the relevant information, and advising on the best course of action regarding localization processes.","Collaborate closely with other Globalization Language Managers and internal stakeholders (e.g. Globalization Producers, Program Managers, Content Acquisition teams) to collect relevant cultural and linguistic information about Netflix Japan International Originals and support the localization effort in bringing this content to the global audience.","Partner with our International Dubbing team to influence the language strategy of our local language dubbed assets for Netflix branded and non-branded content in the market.","Gain deep production knowledge and awareness of product and content data for the region and define quality expectations through research and A/B testing.","Proactively engage with internal and regional stakeholders to drive regional product initiatives and create an optimized and consistent local experience and ecosystem for our regional members and non-members."]},{"title":"Role Requirements","content":["10+ years of experience in managing language quality and localization programs at a strategic level - experience in entertainment localization (subtitling, dubbing, gaming) a plus.","Strong business acumen and proven stakeholder management skills.","Proven experience in translation, localization and language quality management.","Ability to show initiative and work independently, and drive initiatives at a strategic level.","Fluency in English and native knowledge of Japanese is a must.","Strong knowledge of the movie/entertainment industry in the region.","Experience in creative writing and media/journalism is a plus.","Deep understanding of localization specificities and pitfalls.","Eagerness to embrace a culture of candid feedback.","Excellent presentation, communication, and interpersonal skills."]}],"location_emoji":"🇯🇵"}