{"title":"Lead Animator, Games Studio (Blue)","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":100000.0,"max":500000.0,"format":"per-year-salary","currency":"USD"},"tags":["Lead Animator","Games Studio","AAA","multi-platform game","3D characters","weapons","vehicles","cameras","gameplay sequences","cinematics","production","Character and Tech Artists","high quality animations","small team","game experience","design constraints","quality","core values","action","learning","bold experimentation","agile pace","Netflix","entertain the world","mentor","guide animators","best practices","visual and technical standards","DCC pipelines","processes","workflows","animation schedule","Art Director","Designers","animation style","tools department","character setup process","skeletons","IK","FK","facial animation system","constraints","game characters","run levels","cinematics","scene troubleshooting","animation techniques","game production challenges","combat design","character art","8+ years of experience","Team Lead","Maya","Unreal Engine","art pipelines","dependencies","project scope","rig systems","motion capture techniques","performance capture","animation portfolio","animation workflows","rigging","game engines","art integration pipelines","shader knowledge","polygon modeling","topology adjustments","anatomy","movement","tool writing","passion for gaming"],"skills":[""],"overview":"","description":"We’re looking for a creative and highly-skilled Lead Animator to help us forge the creative vision on a brand-new AAA multi-platform game. This is a unique opportunity to be at the heart of crafting and bringing to life worlds for one of Netflix’s first generation of internally developed original games.\n\nAs Lead Animator, you will be responsible for leading a team of animators and/or technical animators in establishing, maintaining, and continuously advancing the quality of in-game and/or cinematic animation excellence. The ideal candidate is a well organized leader with a strong, hands-on background with a devotion for sharing. This role will involve leading all aspects of production by collaborating with Character and Tech Artists to create high quality animations of 3D characters, weapons, vehicles and cameras for both gameplay sequences and cinematics.\n\nWe're building the foundation for a small, but ambitious, team of creators whose primary goal is to create a game experience that our players want to repeatedly come back to; and as our Lead Animator, you will be able to create, ship, and run a game without any competing design constraints due to monetization.\n\nQuality is something that we are immensely proud to be aiming for, and we are looking at putting the right team together to help take us forward. We’re looking for that group of leaders who are aligned with our core values, and care deeply about the experiences they create as well as the people they make them with. Those who bias towards action and are energized by the learning that comes with bold experimentation at an agile pace. As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. \n\nNow is an amazing time to join Netflix as we seek to entertain the world. We have over 200 million paid members in over 190 countries, and we won’t stop there!\n","requirements":[],"extras":[{"title":"Responsibilities Include","content":["Mentor and guide animators in areas of expertise; instill best practices.","Partner with leads and directors to meet visual and technical standards.","Research, define, extend, and maintain DCC pipelines, processes, and workflows.","Create and maintain an animation schedule that works with the overall schedules of the assigned production.","Works with Art Director and Designers to plan and direct an animation style that works with the overall tone, team size, and schedules of the assigned production.","Works with the Tools department to help create and evaluate new tools that would expedite the animation process.","Maintains a strong understanding of Character Set up process and highly proficient with skeletons, IK, FK, facial animation system, constraints and other systems used for character animation.","Reviews game characters and run levels to check on correct implementation of animations.","Maintains a solid understanding of the entire process of creating cinematics; e.g. creating partial levels, setting up cameras and characters, animating, checking, and troubleshooting scenes.","Stay informed on the latest in animation techniques from various games.","Engage in broader game production challenges as they relate to combat design, animation, and character art."]},{"title":"The Ideal Candidate","content":["Minimum 8+ years of relevant experience","Has worked on at least one AAA title as a Team Lead","Strong Maya and Unreal Engine Knowledge","Intimate knowledge of Maya and strong understanding of Maya’s rigging tools","Has an excellent understanding of art pipelines, dependencies, and the overall scope of the project","Ability to pioneer practical production-oriented rig systems and workflows, including motion capture techniques and performance capture","Portfolio that demonstrates relevant animation experience in games (tools, pipelines, etc.)","Deep knowledge of animation workflows and rigging to implement characters in unreal","Strong communication skills and understanding of various art disciplines (animation, character, environment, VFX)","Strong understanding of game engines and art integration pipelines and how to optimize them"]},{"title":"Additional and Bonus Skills","content":["Working knowledge of shaders, specifically as they relate to animation","Proficient with polygon modeling and topology adjustments related to character deformations","Well-versed in human and animal anatomy","A keen eye for correct form throughout a wide range of movement","Experience with writing tools for animation","Passion for gaming"]}],"location_emoji":"🇺🇸"}