{"title":"Lead Technical Artist, Games Studio (Blue)","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"","salary":{"min":100000.0,"max":500000.0,"format":"per-year-salary","currency":"USD"},"tags":[""],"skills":[""],"overview":"","description":"We’re looking for a creative and highly-skilled Lead Tech Artist to help us forge the creative vision on a brand-new AAA multi-platform game. This is a unique opportunity to be at the heart of crafting and bringing to life worlds for one of Netflix’s first generation of internally developed original games.\n\nAs Lead Tech Artist, you will help define the overall quality and bridge tech and art, while managing, mentoring and caring for the well-being of your team members. The ideal candidate is a well organized leader with a strong, hands-on background with a devotion for sharing. This role will involve leading all aspects of production by collaborating with Character Artists, Environment Artists, and Animators to deliver the highest quality for the game.\n\nWe're building the foundation for a small, but ambitious, team of creators whose primary goal is to create a game experience that our players want to repeatedly come back to; and as our Lead Tech Artist, you will be able to create, ship, and run a game without any competing design constraints due to monetization.\n\nQuality is something that we are immensely proud to be aiming for, and we are looking at putting the right team together to help take us forward. We’re looking for that group of leaders who are aligned with our core values, and care deeply about the experiences they create as well as the people they make them with. Those who have bias towards action and are energized by the learning that comes with bold experimentation at an agile pace. As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. \n\nNow is an amazing time to join Netflix as we seek to entertain the world. We have over 200 million paid members in over 190 countries, and we won’t stop there!\n","requirements":[],"extras":[{"title":"Responsibilities Include","content":["Mentor and guide character artists and animators in areas of expertise; instill best practices","Partner with leads and directors to meet visual and technical standards","Research, define, extend, and maintain DCC pipelines, processes, and workflows","Collaborate with Artists, Animators, Coders, & Designers to implement tools","Identify and solve problems by inventing or building robust technical implementations","Create and maintain animation toolsets and character development workflows","Engage in broader game production challenges as they relate to combat design, animation, and character art"]},{"title":"The Ideal Candidate","content":["Minimum 8+ years of relevant experience","Has worked on at least one AAA title as a Team Lead","Strong Unreal Engine Knowledge","Intimate knowledge of Maya and strong understanding of Maya’s rigging tools","Expertise in Python and/or C++ –","Expert knowledge Maya API and Qt","Ability to pioneer practical production-oriented rig systems and workflows","Portfolio that demonstrates relevant tech art experience in games (tools, pipelines, etc.)","Deep knowledge of animation workflows and rigging to implement characters in unreal","Demonstrable strong understanding of relevant tools and technology","Strong understanding of game engines and art integration pipelines and how to optimize them"]},{"title":"Additional and Bonus Skills","content":["Working knowledge of shaders, specifically as they relate to animation","Proficient with polygon modeling and topology adjustments related to character deformations","Well-versed in human and animal anatomy","A keen eye for correct form throughout a wide range of movement","Experience with procedural tools like Houdini","Passion for gaming"]}],"location_emoji":"🇺🇸"}