{"title":"Legal Counsel - SEA","location":["Singapore, Singapore"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"Legal Counsel - SEA: Join Netflix's Legal team in Singapore to support business growth in SEA, primarily focusing on commercial transactions, advisory, regulatory, and contentious matters.","description":"The Opportunity\nNetflix is the world's leading internet entertainment service with over 233 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time - it’s an exciting time to work at Netflix!\n\nThe Role \nWe are looking for a talented and experienced legal counsel to join our Legal team based in Singapore, to support the growth of the business in SEA and should be extremely comfortable counseling business partners and making decisions that have both legal and business impacts. The role will be primarily focused on commercial transactional work and supporting advisory, regulatory, and contentious matters in SEA markets.\n","requirements":[],"extras":[{"title":"The successful candidate will be responsible for:","content":["Partnering with the SEA Partnerships team to support the growth and expansion of Netflix across SEA markets by negotiating, reviewing, and drafting various partnership and commercial agreements.","Collaborating with Netflix’s Public Policy teams, managing regulatory inquiries, and conducting a legal risk assessment of any regulatory developments in SEA.","Advising the business and other internal stakeholders on the impact, risks, and mitigation strategies relating to regulatory and legal changes.","Managing ad hoc projects and providing general legal support for corporate and commercial matters in SEA."]},{"title":"Qualifications:","content":["A qualified lawyer with at least 8 years of either in-house and/or private practice experience working on commercial and regulatory matters. Experience in litigation and conducting or managing contentious matters and legal investigations within SEA markets would be an advantage.","Fluency in English is required. Fluency in other SEA languages (Vietnamese or Thai) would be required.","Strong industry knowledge with an understanding and interest in the SVOD, telecom media, and entertainment industries and how they intersect with laws and regulations in SEA, with a particular focus on SEA markets (particularly Vietnam, Thailand, or the Philippines).","Demonstrated thoughtful business judgment, strong research and analytical skills, and ability to work well under pressure and tight timeframes.","Excellent cross-functional collaborator and an ability to cover a broad range of issues and be capable of navigating a complex organization with diverse goals across multiple countries and functions.","Be self-motivated, disciplined, highly organized, and able to prioritize multiple tasks.","Ability to drive alignment and momentum with a reputation for cultivating positive relationships with external and internal partners and cross-functional teams.","Willingness to tackle matters outside their area of expertise"]}],"location_emoji":"🇸🇬"}