{"title":"Licensing Associate, Consumer Products","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Licensing Associate","Consumer Products","Softlines","Home Categories","Licensees","Category Management","Line Planning"],"skills":[""],"overview":"","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nOur growing global Consumer Products team brings our members' favorite stories to real life through products and experiences. The team is responsible for overseeing the business and creative execution across merchandise creation, product development, licensee relationships, publishing, marketing, as well as a global division focused on live experiences.\n\nWe are looking for a Licensing Associate to grow and manage the soft lines and home categories across our series and films. The successful candidate will be a dynamic professional with an eye for trends who can work hand in hand with our core licensees to build impactful programs. The right candidate strives to break out of the traditional mold of licensing, is passionate about entertainment, and has an insatiable desire to reinvent licensing and retail in a challenging landscape. They’re comfortable leaning into risk and shaking things up. Most importantly, they are naturally inquisitive and unafraid to speak their mind in the spirit of dissent, even if it isn’t a popular opinion, but what they feel is right for Netflix.\n\nThe Licensing Associate will develop an end-to-end strategy and execution for merchandising in the US and Canada. They will work closely with our Retail Development team to support the unlocking of new channels by providing clear category strategies and line plans that support the respective goals of that channel and account. Our overall goal is to ensure that Netflix consumer products are present in the right categories and channels and make good on our promise to deliver fan joy wherever those fans are. \n","requirements":[],"extras":[{"title":"What you will do:","content":["Day-to-day management of the softlines and home categories and the licensees that support that business (eg. apparel, accessories, footwear, bedding/home decor, etc) including ownership of the relationship with licensees and category management (e.g. line planning, distribution, sales performance, etc.).","Identify and evaluate licensing partners that can deliver on an established set of KPIs (e.g. quality, distribution, sales performance) and whose goals align with ours.","Negotiate favorable deals and proactively manage licensees to achieve our short and long-term strategic goals.","Possess strong analytical and financial skills to continually evaluate business and market performance, including category and consumer trends and whitespace opportunities","Be a strong internal and external category champion of the opportunity, vision, pitch and message with regards to our licensing strategy and our titles.","Communicate our category plans to internal Consumer Products teams (Merchandise Strategy, Product Development & Creative, Ops) so they understand how their work can support category goal","Take a ‘talent friendly’ approach to the work and ensure appropriate internal stakeholders are involved in key decision-making.","Be informed of the priorities and complexities of cross-functional teams (e.g. content, marketing, publicity, PR, social, etc.) and understand how consumer products benefit and support other teams’ work."]},{"title":"What we need from you:","content":["Demonstrated, 7+ years of experience in outbound licensing function with apparel","Softlines experience working with reputable brands (CPG, fashion/lifestyle, entertainment, gaming, agency)","Strong knowledge of the licensing landscape and value chain from ideation around IP through to delivery and consumer experience, including experience working with Brand Management/Product Development & Creative/Retail/Consumer Insights","Ability to develop category plans and drive programs to completion","Possess contacts and network of key stakeholders across the licensing landscape","Deep partner engagement competency and ability to work with multiple, disparate stakeholders to foster strong, long term relationships that achieve the best outcome for Netflix.","Ability to travel domestically and internationally up to 10% for partner meetings and trade shows"]}],"location_emoji":"🇺🇸"}