{"title":"Live Broadcast Operations Manager, L4/ L5","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Live Broadcast Operations","Global Live-streaming Operations","Live Streaming Pipeline Engineering","Live On-site Technical Managers","Production Teams","Reliability Engineering","Coordination","Transmission Planning","Partnerships","Hardware and Broadcast Companies","Venue Infrastructures","Troubleshooting","Audio and Video Issues","Video Infrastructure Management","Ground Ingest Capabilities","Emerging Technologies","Feature Development","Network Operations Center","Flexible Hours","Travel for Live Events","Broadcast Remote Operations","Digital Audio/Video Fundamentals","Compression Technologies","Distribution Formats","Multicast and Unicast Video Distribution","MPEG Video","HDR","SCTE-35 and ESNI Signaling","Closed-captions","Satellite Video Distribution","Ad-splicing","Video Transport Protocols","Video and Audio Compression Technology","Remote Production Knowledge","MVPD-based Linear Ecosystem","OTT Video Distribution","Video and Audio Quality","On-premise Video Acquisition","Cloud-based Infrastructure","Programming Languages","Unix and Shell Scripting","SQL Knowledge","Web Technologies","Distributed Systems"],"skills":["SDI","SMPTE-2110","RTP","RTMP","SRT","Zixi","RIST"],"overview":"The Live Broadcast Operations Manager, L4/ L5, is responsible for managing day-to-day global live-streaming operations for Netflix, coordinating and executing live-focused initiatives, and impacting multiple areas of the live event lifecycle.","description":"About the role\nIn this role, you will manage day-to-day global live-streaming operations for Netflix. As a Live Broadcast Operations Manager, you will mainly coordinate and execute live-focused initiatives based on collaboration with the Live Streaming Pipeline Engineering Team, Live On-Site Technical Managers and Production teams, and our Reliability Engineering teams.\n\nYou will impact multiple areas of the live event lifecycle, from the pitch & planning phase to testing and event launch days. You will lead innovation initiatives that bridge the gap between production, hardware, broadcast engineering, and our software engineering teams.\n\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Coordination and partnership across multiple stakeholders and clients for the smooth execution of live-streaming events","Collaborate with contractors and in-house engineers for transmission planning.","Establish and maintain partnerships with satellite and IP transmission vendors.","Establish and maintain partnerships with hardware and broadcast companies such as contribution/distribution encoder vendors, closed-captioning gears, and services.","Ability to organize and maintain maps & drawings of venue infrastructures for communication with all entities","Acts as a central resource for engineering and production, collaborating with teams to develop and execute technical plans that align with Netflix's creative and technical objectives, often managing concurrent schedules.","Responsible for troubleshooting, diagnosing, and reporting audio, video, and infrastructure issues.","Monitor and manage cloud-based and hardware-based video infrastructure. Provide analysis and remediation of any issues in the video workflow.","Manage, build, and evolve ground ingest capabilities, including signal acquisition, inspection, validation, and standardization.","Monitors the industry for emerging technologies, developing trends to keep Netflix live on the cutting edge.","Work closely to help enable new feature development by figuring out how the feature affects overall operations and how to make it work at scale.","Be present on launch days at Network Operations Center (NOC) or ground ingest facilities as required.","Be able to work with flexible hours based on the live events schedule.","Must have flexibility to travel for scheduled live events."]},{"title":"Qualifications","content":["5+ years of broadcast remote operations experience (preferably network level) in a coordination or supervisory role","Strong understanding of digital audio/video fundamentals, compression technologies, distribution formats, and associated technologies such as Multicast and Unicast video distribution, MPEG Video (2,4, & HEVC), MPEG-2 TS, HDR, SCTE-35 & ESNI signaling, closed-captions, satellite video distribution, and ad-splicing.","Experience with video transport protocols such as SDI, SMPTE-2110, RTP, RTMP, SRT, Zixi, RIST, HLS, MPEG-DASH","Proficient in Video and Audio Compression technology","Understanding of nuances of remote production and the on-site technical operation","Knowledge of remote production facilities and equipment vendors","Deep understanding of MVPD-based linear ecosystem and working knowledge of OTT video distribution, contribution technology, and architecture","Ability to assess and troubleshoot video and audio quality","Experience with on-premise video acquisition with partners or co-location facilities."]},{"title":"Nice to have","content":["Experience with cloud-based infrastructure","Experience with at least one programming language (Java, Go, Python)","Experience in Unix (or unix-based systems), shell scripting, and good SQL knowledge","Experience with web technologies and distributed systems with microservices architecture"]}],"location_emoji":"🇺🇸"}