{"title":"Live Streaming Software Engineer, L4","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":["Java","Go","scripting languages","automation tools","digital audio/video fundamentals","compression technologies","distribution formats"],"overview":"The Live Streaming Software Engineer, L4 position entails developing and supervising signal acquisition and audio/video/text processing workflows, supporting live event operations and pipeline management, and working with video infrastructure and tooling for live video streaming at scale.","description":"About the role\nOur team is searching for a Live Streaming Software Engineer to join the Live Streaming Pipeline team, assisting in developing and supervising our signal acquisition and audio/video/text processing workflows. The position will involve the execution and maintenance of solutions aimed at enhancing the efficiency of live event operations and our live pipeline management. We're seeking someone knowledgeable in video infrastructure and tooling to support live video streaming at scale.\n\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Responsible for developing and supporting media encoding pipelines, streaming media workflows, and workflow coordination layers for on-premise and cloud media processing components.","Partner with the Live Broadcast Operations team to collaborate and create services and standards enabling live operations at scale.","Implement infrastructure, tools, and applications to monitor critical operational workflows in the live video space in real-time, including the building of tools for the Live Broadcast Operations team to manage and troubleshoot live video streams.","Build automation and quality control checks to alert operators of any ongoing issues with existing live streams.","Support live streams and events, maintaining high quality throughout the broadcast chain.","Be able to work with flexible hours based on the live events schedule."]},{"title":"Qualifications","content":["4+ years of hands-on professional experience with back-end systems development and 3+ years of experience in live streaming workflows.","Robust programming skills and strong experience with Java/Go.","Strong experience with scripting languages and automation tools.","Desirable experience in operation, metrics, dashboard, and alerting.","Strong understanding of digital audio/video fundamentals, compression technologies, distribution formats, and associated technologies such as Multicast and Unicast video distribution, MPEG Video (2,4, & HEVC), MPEG-2 TS, AVC/HEVC/DD+, Atmos, HDR, SCTE-35 & ESNI signaling, closed-captions, satellite video distribution, and ad-splicing.","Experience with video transport protocols such as RTP, RTMP, SRT, UDP, Zixi, RIST, HLS, MPEG-DASH","Expertise with audio/video codecs, HDR (HDR10/Dolby Vision), and DRM technologies (Fairplay, Playready, Widevine).","Expertise in client-side and server-side dynamic ad insertion, including technical architecture and design implications.","Comfort with the software development lifecycle and software-based tools and workflows.","Strong quantitative, analytical, problem-solving, debugging, and decision-making skills."]},{"title":"Nice-to-have","content":["Expertise in encoding profiles, bitrate ladders, and video compression technologies.","Expertise in AWS, command line operations (Linux/Windows), and open-source multimedia frameworks.","Experience with feed contribution and conditioning hardware, including encoders, decoders, format converters, and similar in either baseband or ST 2110 domains"]}],"location_emoji":"🇺🇸"}