{"title":"Manager, FP&A, Corporate - People Costs","location":["Los Gatos, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"8","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["FP&A Manager","Financial Planning","Forecasting","Strategic Analysis","Operational Activities","Headcount Planning","Partnership","Communication Skills","Process Improvements","Workforce Management","Employee Expenses","Compensation","Org Effectiveness","Metrics","Forecast Methodologies","Business Decisions","Contingent Talent Planning","Cost / Benefit Analyses","Senior Management","Mentorship","Corporate Strategy","Corporate Planning","Accounting Concepts","Financial Modeling"],"skills":[""],"overview":"The FP&A Manager, Corporate - People Costs at Netflix will drive financial planning processes related to headcount planning and employee expense forecasting, provide key insights into employee expenses, improve headcount planning processes, and serve as a subject matter expert for headcount and workforce planning within the finance department.","description":"Netflix is the world's leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nFP&A (Financial, Planning, & Analysis) at Netflix is an organization that is highly aligned and deeply entrenched within functional areas throughout the company, partnering with senior leaders in financial planning, forecasting, and strategic analysis. We believe that we derive a significant competitive advantage from the highly integrated and analytical approach we take to managing the company.\n \nThe planned scope for this FP&A Manager will be to support all operational activities within company-wide people costs and headcount planning. Successful candidates have a commitment toward action, have exceptional partnership and communication skills, and know how to balance getting the details right while still moving fast.\n\nIn this role you’ll partner closely with our Finance and FP&A leaders as well as key Talent Leadership. You will gain invaluable experience in a position that offers significant responsibility and interaction with business partners as well as considerable opportunity to have a large impact within a growing Finance organization. \n\nThe position will manage one associate, will report to the Director, FP&A, Corporate, and is based in Los Gatos, CA.\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Drive financial planning processes related to headcount planning and employee expense forecasting and long-range outlooks.","Help business partners gain key insights into employee expenses with meaningful analyses and trends.","Drive process improvements in headcount planning by partnering with up-stream process owners and enhance current tools/systems related to workforce and expense management","Develop and maintain the organization's employee expense and headcount calculations and assumptions within our planning tool for all forecast cycles","Partner with our Compensation and Org Effectiveness HR teams to lead processes in these spaces, including annual compensation cycle, executive compensation, and corporate benchmarking.","Own the design, development, and maintenance of ongoing metrics, forecast methodologies, and analyses to drive business decisions related to the Employee Expenses and Headcount.","Collaborate with groups in finance and HR on contingent talent planning and management","Completing cost / benefit analyses and communicate key drivers / inputs to support business decisions","Serve as the company subject matter expert within FP&A for headcount and workforce planning as we optimize solutions that will enable future scale.","Prepare financial reports, summaries, and insights for senior management.","Mentor, coach and develop direct report(s) and other associates on the team."]},{"title":"Minimum Qualifications","content":["Minimum 8 years of related experience (e.g. corporate strategy, corporate planning, or FP&A).","Strong track record of identifying gaps and opportunities; defining, performing and coordinating analyses; and communicating findings in a clear and concise way.","Exceptional communication skills with ability to build relationships with people across all levels.","Ability to deal with ambiguity and competing objectives in a fast-paced environment.","Experience in accounting concepts and financial planning.","Superior proficiency in Excel & financial modeling.","People management experience is a plus.","Genuine passion and excitement for Netflix’s unique culture."]}],"location_emoji":"🇺🇸"}