{"title":"Manager, Creative Operations, Ads Marketing","location":["London, United Kingdom"],"attendance":["Onsite"],"type":["Full-time"],"experience":"7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Creative Operations","Ads Marketing","Project Management","Sales Enablement","Budget Management","Team Coordination","Asset Management"],"skills":["Project management","Operations","Budget management","Cross-functional coordination","Presentation design","Asset management","Graphic design"],"overview":"The Manager, Creative Operations, Ads Marketing will support the Ads team with positioning, messaging, and key narratives by coordinating and implementing Sales Enablement materials.","description":"It's an exciting time to join Netflix as we continue to transform entertainment globally. We bring new stories to over 230 million subscribers in over 190 countries. We’ve recently introduced a new ad-supported plan, offering customers a more affordable price point and offering advertisers a new way to reach engaged audiences. \n\nWith that, we are building out an Ads Marketing team to bring ‘Netflix with Ads’ to advertisers in key European markets. As the Manager, Creative Operations you will support the Ads team with the positioning, messaging and key narratives. This is done by coordinating and coalescing the tools, resources, and cross-functional alignment needed to produce and implement Sales Enablement materials to the highest creative standards. \n\nThe role\n\nIn this role, you will support creatively an Ad Sales organization and you will cover everything from logistics/creative production, resource management, project management and financial management, to cross-functional coordination and sales/advertiser/agency management (and more). While not a creative practitioner, the ideal candidate will have a sharp eye and a strong passion for creative excellence.\n","requirements":[],"extras":[{"title":"Creative Production and Planning","content":["Project management and operations for Ad Sales/Marketing creative requests and delivery (efficient workflow, agency engagement, timeline/budget management, cross-functional coordination, etc.).","Develop a project plan that drives timeline, budget and key cross-functional stakeholder milestones. Partner with agency partners to develop and adhere to plans.","Stay closely aligned with the Ads Marketing team and creative team to ensure flawless implementation of all projects."]},{"title":"Project Implementation","content":["Act as day-to-day contact for cross-functional socialization and approvals for all sales enablement assets required. This includes teams such as sales, creative marketing, content, legal, music, PR/Comms, media, etc.","Executional oversight and coordination of all creative sales enablement materials (presentations, video, print, talent/legal, social media/content, activations/events, PR, etc.)","Assist in the development of creative presentations, including presentation design, creative mockups and working across the team to collaborate on the deck","Own & manage budgets including negotiating agency estimates/bids.","Ensure all necessary assets are reviewed, approved and delivered on-time. This includes prior alignment and approvals with all necessary cross-functional partners."]},{"title":"Operations","content":["Act as main liaison in facilitating sales enablement asset requests as well as manage the retrieval of any/all title specific asset needs.","Become an expert in the utilization of Netflix internal tools, in order to properly support the Ads Marketing creative lead as well as all external agency partners / vendors.","Manage creative agency NDAs, SOWs and creative agency onboarding as needed"]},{"title":"We are looking for:","content":["Program Manager/ Creative Operations Manager with at least 7 years of experience within the B2B Marketing and Communications field","A deep understanding of the Ad Sales environment and experience in creative sales enablement is highly preferred","Previous experience in entertainment studio, and broadcast/streaming service is a plus","Ability to work on fast-paced projects that involve multiple stakeholders, content production, and media activations.","Fluent in Video and Digital types and formats while understanding the fundamentals of asset management, servicing and ad trafficking.","Experience with marketing creative concepting, asset production, and delivery","Ability to manage and edit graphic designs and deck templates.","Strong written/verbal skills. Can organize, clarify and communicate complex ideas succinctly and accurately and quickly respond to inquiries.","Someone who can flourish in our unique company culture."]}],"location_emoji":"🇬🇧"}