{"title":"Manager, Space & Occupancy Planning - LA","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Space & Occupancy Planning","Strategic Planning","Space Programming","Workplace Occupancy","Real Estate Portfolio","Liaison and Relationship Building","Spatial Analysis"],"skills":["Space planning","Occupancy planning","Space programming","AutoCAD","Google Sheets","CAFM systems","ADA requirements"],"overview":"The Manager, Space & Occupancy Planning - LA position at Netflix involves supporting space planning for existing offices, developing space programming for new spaces, and tracking changes in workplace occupancy in the Los Angeles region.","description":"Netflix is the world's leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n \nWe are seeking a Manager of Space & Occupancy Planning, reporting to the Director of Space & Occupancy Strategy,  to support the day-to-day space planning of existing Netflix offices, lead on the development of space programming for new Netflix spaces, while tracking changes of workplace occupancy of Netflix’s evolving real estate portfolio in the Los Angeles region.  This role is based in-office at our Hollywood, CA office.\n\nThe focus of the Space and Occupancy Planning role will be the strategic planning and analysis of Netflix existing and planned corporate locations within the Los Angeles region. The role will collaborate and communicate with other members of the global occupancy and space planning team, real estate strategists, designers, and workplace specialists.\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Liaise, influence, and build relationships with local/regional business partners, Director’s and VP’s, to ensure their business’ allocation, adjacency and spatial needs are met, validating yearly headcount projections and short-term spatial programming/technical requirements","Subject matter expert for the Los Angeles region on space and occupancy strategy and planning; lead for co-developing space planning methodologies at a macro level and bridging those strategies to the micro level to support individual sites and teams","Monitors, tracks and reports space and occupancy trends based on local headcount forecasting, business org changes and space requirements","Leads spatial and occupancy analysis’ for all LA sites; gathers trends and findings to support on future regional planning as well as global impacts and initiatives","As the SME for the LA region, proactively analyze and report on space and headcount trends; partner with the global S&O team to strategize long term occupancy and spatial solutions","Lead, manage and support the development of a team of space and occupancy planners dedicated to the LA region","Partner closely with the cross functional regional team in defining short and long term needs for new and existing sites","In partnership with the regional workplace teams, lead monthly efforts to ensure data accuracy within the CAFM system for all Los Angeles space and occupancy data","Utilize space and occupancy metrics and best practices to inform real estate decisions.","Perform spatial analysis to develop scenarios on the most strategic use of space; including implementing seating strategies that maximize space utilization.","Be a champion of change management for end users - creating, contributing, and maintaining employee resources to navigate workplace strategies (assigned seating, flex seating, hybrid work, etc).","Partner with the Workplace and MAC teams in the execution of move and migration plans with space allocations and occupancy data","Closely partner with the global Space & Occupancy team on developing workplace strategy pilots, specific to region, to support the hybrid workplace","Contribute to presentations for highly visible projects for a wide range audience (ie: senior leadership) containing but not limited to workplace standards, agile work environments, and complex phasing","Provide conceptual space occupancy plans and recommendations to stakeholders subsequently preparing block plans or stacking diagrams.","Contribute to the development of space programs for new corporate offices, post production facilities and studio spaces; track the development and implementation of the program from project inception to completion","Keep up to date with emerging trends and insights with regards to workplace strategy, design, and best practices","Other duties may be assigned","Travel up to 25% of the time"]},{"title":"Basic Requirements","content":["BA/BS degree or equivalent combination of education, training and experience in Architecture, Interior Architecture or Space Planning","7+ years of experience in workplace strategy, occupancy and space planning","Expertise in space planning, user research, occupancy planning and strategy, and space programming","Comfortable in a fast-paced, open, collaborative environment","Direct experience managing a diverse and talented team","High degree of flexibility and the ability to collaborate, problem solve and multi-task","Proficiency in AutoCAD, GSuite (specifically Google Sheets), and CAFM systems","Knowledge of ADA requirements and building codes","Ability to read and interpret floor plans and construction documents"]},{"title":"Preferred Requirements","content":["Excellent interpersonal communication skills","Excellent team management and development skills","Demonstrated ability to work in a fast paced, team based, deadline oriented environment","Ability to effectively manage complex tasks and prioritize multiple projects and competing priorities","Ability to develop business cases and service requirements while creating and managing strategic alliances","Ability to build internal networks and work cross-functional","Excellent organizational and project management skills","Strong analytical and problem solving skills","Demonstrated ability to produce reports/documents","Strong presentation and facilitation skills"]}],"location_emoji":"🌍"}