{"title":"Manager, Production Management - Canada","location":["Toronto, Canada"],"attendance":["Onsite"],"type":["Full-time"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Production Management","Vendor Relations","Budget Management","French language productions","Project Management","Team Leadership","Conflict Resolution"],"skills":["Production Management","Netflix Canada","vendor relations","budgets","pre-production","delivery","English","French","Netflix Canada’s Creative Team","show budgets","production strategy","cost management","schedules","key production staff","vendors","diverse and inclusive production staffing","mentorship","studio organization","streaming deliverables","high quality vendors","confidentiality","prioritization","travel","production processes","Movie Magic Budgeting","Google Suite","English language productions","French language productions","Toronto"],"overview":"The Manager, Production Management - Canada position involves overseeing the physical production of original scripted content commissions by Netflix Canada, including vendor and staff/crew relations, budget review, and support for both English and French language commissions.","description":"We are seeking an experienced Production Executive to help manage the physical production of original scripted content commissions by Netflix Canada. Responsibilities include establishing and curating vendor & staff/crew relations, reviewing budgets and supporting/suggesting best practices from pre-production through delivery across both English and French language commissions. \n\nThe Role\nA successful candidate will be self-motivated, proactive, quick-thinking, flexible, able to pivot when necessary, thorough and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and an unwavering attention to detail at all times. This is a demanding and fast moving position that requires someone who is a proactive and positive thinker and able to exercise good judgment and initiative. \n","requirements":[],"extras":[{"title":"Responsibilities","content":["Support Netflix Canada’s Creative Team in their goals, development and slate planning considerations","Work with Netflix Canada’s Creative, Business Affairs, Communications, Labour, Policy partners & external production partners on slate schedules and workflows","Work with executives, showrunners and line producers to prepare and vet show budgets and schedules, providing feedback on viability and risks","Review creative/scripts & begin defining series production strategy and determine budget estimates through to lock","Track & manage costs with Finance, keeping stakeholders apprised of status","Collaborate with internal teams (including Post, Localization) & external production teams to lock schedules","Troubleshoot and communicate all changes to schedule and delivery","Lead or assist with search and hire of key production staff","Determine key vendors to accommodate creative vision, financing considerations, budget needs, location factors","Supervise diverse and inclusive production staffing","Lead mentorship and growth opportunities for production talent in Canada","Track production activity in Canada and maintain alignment with wider studio organization","If requested by UCAN Production Management Lead, liaise and support inbound titles as needed."]},{"title":"Qualifications","content":["BA/BS Degree; 10 Years + experience with long form production executive managementAbility to handle a fast paced environment simultaneously supervising several projects in various points of production (from development through delivery)","Familiar with the current trends and workflows including streaming deliverables","Access to roster of high quality vendors and talent","Ability to be discreet and maintain confidential information","Understanding of how to prioritize and respond accordingly","Comfortable with travel within Canada","Willingness to continue learning to ensure understanding of current production processes and innovations","Strong written and verbal communication skills and the ability to multitask","Proficiency in Movie Magic Budgeting, Google Suite (Google Docs, Google Sheets, Google Slides, Google Mail)","Experience with English and French language productions in Canada"]}],"location_emoji":"🇨🇦"}