{"title":"Manager, Finance Strategy and Analysis Content - SEA","location":["Singapore, Singapore"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"The Manager, Finance Strategy and Analysis Content - SEA position at Netflix involves developing local content strategy, leading deal analysis and valuation, staying informed about industry trends, compiling post-mortem analyses, working cross-functionally, and requiring 5 to 7 years of relevant experience in a highly-demanding environment with strong analytical and communication skills.","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nThe Finance Strategy & Analysis (FS&A) Content team is looking for a Manager to join its Southeast Asia team with a focus on Indonesia. FS&A Content is the team in charge of the analytical strategy behind our content buying and original content decisions for Bahasa-language film and TV series. \n\nThe team works cross-functionally to translate the incredible amount of data at Netflix into financial decisions regarding the production and acquisition of shows and films. The team also evaluates the general programming and content strategy, in addition to leading competitive analysis. We partner closely with the senior leadership of Netflix who depend heavily on the strategic insights we provide to inform critical business decisions across the company.\n\nThis person will have a high degree of visibility with Asia Pacific and APAC senior management which uses the team’s analysis and insights to inform important decisions on our SEA content and business strategy.\n\nThe role will be based in Singapore with some limited travel to other SEA countries (<20%). The role involves close coordination with members of the FS&A team in both Asia Pacific and the US. You will report to the Head of Content Strategy & Analysis for Southeast Asia / Australia, based in Singapore.Netflix is the world's leading streaming entertainment service with over 220 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. M\n\nThe Finance Strategy & Analysis (FS&A) Content team is looking for a Manager to join its Southeast Asia team with a focus on Indonesia. FS&A Content is the team in charge of the analytical strategy behind our content buying and original content decisions for local language film and TV series. \n\nThe team works cross-functionally to translate the incredible amount of data at Netflix into financial decisions regarding the production and acquisition of shows and films. The team also evaluates the general programming and content strategy, in addition to leading competitive analysis. We partner closely with the senior leadership of Netflix who depend heavily on the strategic insights we provide to inform critical business decisions.\n\nThis person will have a high degree of visibility with APAC senior management which uses the team’s analysis and insights to inform important decisions on our SEA content and business strategy.\n\nThe role will be based in Singapore with some limited travel to other SEA countries (<20%). The role involves close coordination with members of the FS&A team in both Asia Pacific and the US. You will report to the Head of Content Strategy & Analysis for Southeast Asia / Australia, based in Singapore.\n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Develop local content strategy to improve our value proposition of our members and members to be in partnership with the Content teams","Lead deal analysis and valuation of new projects in partnership with the Content teams","Develop a deep understanding of industry trends as well as competitive threats and opportunities to better inform our future strategic choices.","Compiling thoughtful post-mortem analyses to determine areas for optimization and improvement.","Working cross-functionally with other Strategy teams as well as Product, Marketing, Consumer Insights, and Data Science team."]},{"title":"Qualifications:","content":["5 to 7 years of experience in a top management consulting firm, investment bank, private equity, hedge fund, and/or media/entertainment/tech company in a strategy/business development/analytical role.","We are looking for candidates that have worked in a highly-demanding environment in which complex modeling and analysis is performed.","Candidates are required to be highly analytical and be a strong, effective communicator with experience presenting complex analyses to executives/ senior management","He/She must thrive in a fast-paced environment, possess a high level of intellectual curiosity, focus on generating results and exhibit the highest personal and professional standards of integrity and ethics. Candidates must be motivated, disciplined, and flexible.","Superb modeling skills and extensive experience conducting quantitative and qualitative analysis.","Exceptional proficiency with MS Excel & PowerPoint; working knowledge of statistics and analysis packages.","Passion and familiarity with SEA content and entertainment is a strong plus especially Indonesian","English language fluency is mandatory, Bahasa speakers preferred but not mandatory.","Bachelor's degree in finance, economics, mathematics, statistics or other relevant field that demonstrates quantitative orientation. MBA a plus but not required."]}],"location_emoji":"🇸🇬"}