{"title":"Manager, Communications - Korea","location":["Seoul, South Korea"],"attendance":["Onsite"],"type":[],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"Based in Seoul, reporting to Communications Senior Manager, Korea\n\nAre you excited about how great entertainment is created, and technology enables consumers to discover and enjoy it? Do you want to help tell the story of a company delivering joy to its millions of members all over the world and setting new standards for its industry? Are you exceptional at planning and implementing great campaigns that shift how people think about brands? Have you been dreaming about being an important member of the Dream Team? If this sounds like you, we have an exciting opportunity for the right individual to join our Communications team.\n\nThe Role\nWe are seeking a talented communications professional to join our dedicated team of Public Relations professionals, who are passionate about shaping and effectively conveying the story of Netflix as a leading entertainment service. Reporting directly to the Communications Senior Manager based in Korea, you will be required to cultivate and maintain exceptional relationships with cross-functional partners both within and outside our Seoul office, ensuring trust and collaboration are upheld at all times.\n\nOur ideal candidate will be a strategic thinker, a strong communicator, and a relationship builder, who can be a trusted partner and adviser to teams across multiple disciplines. We’re looking for a creative team player who thrives in a fast-paced, dynamic environment and is an entrepreneurial self-starter unafraid to take calculated risks.\n","requirements":[],"extras":[{"title":"The Work","content":["Create and execute initiatives that contribute to shaping the Netflix storyline in collaboration with internal and external stakeholders. While the main emphasis of this position lies within Korea, our content, services, and operations have an international scope. As a result, you will closely collaborate with teams in various countries to guarantee the uniformity of our campaigns.","Partner closely with stakeholders within the Entertainment, Business Industry, Consumer, and other Netflix-relevant media/organizations/key industry influencers on proactively shaping the Netflix narrative to become a great Netflix advocate with these audiences","Proactively identify, map and preempt issues that could enhance or affect the Netflix brand","Write and shape our key corporate communications materials."]},{"title":"The Candidate Must:","content":["Minimum 10 years of communications experience.","Skilled storyteller who can thoughtfully craft narratives, boil down complex concepts into succinct pitches and with journalists across broadcast, print, and online in both the industry and consumer spaces","Ability to leverage insights, develop and secure stories aligned to company priorities","Good track record in handling and successfully delivering on a high volume of complex projects and tasks","Clear and concise communication style that can effectively convey complex ideas written and verbally","Have a point of view, and able to offer their unique perspective and voice","Fluency in both written and spoken Korean and English."]},{"title":"To succeed at Netflix, the candidate must also possess the following characteristics:","content":["Agility and the ability to stay cool under fire","Adept in a fast-paced environment, and is strong in detail and highly organized.","Selflessness","Effective communicator and writer (we love debates and memos)","Flourishes in a 'hands-on' role, adding value both upstream and downstream","The Netflix culture attracts talents who exhibit good judgment, innovation, selflessness, courage, impact, candid communication, passion, and curiosity. Read our culture memo (available in Korean)"]}],"location_emoji":"🇰🇷"}