{"title":"Manager, Live Action Content Licensing - Japan","location":["Tokyo, Japan"],"attendance":["Onsite"],"type":["Full-time"],"experience":"6","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Manager","Live Action Content Licensing","Japan","TV","Film","Programming","Acquisitions"],"skills":["quantitative analytics","negotiation","financial analysis","market analysis","competitive analysis","strategic thinking","project management"],"overview":"The Manager of Live Action Content Licensing - Japan is responsible for guiding TV & Film programming and acquisitions in the region, setting strategy, negotiating deals, and managing content from non-major studios and regional distributors/producers. The ideal candidate should have strong critical thinking skills, quantitative analytics background, deep relationships in Japan, the ability to work autonomously in a fast-paced environment, and a keen interest in finding great content worldwide.","description":"Netflix is recruiting for a Manager, Live Action Content Licensing based at our Tokyo office. The Manager will guide TV & Film programming and acquisitions for across the region, with content sourced from non-major studios and regional distributors/producers. S/he will provide critical support in setting strategy, deal negotiation, execution and management.\n \nThe ideal candidate has strong critical thinking skills that allow for intense attention to detail as well as the ability to be highly entrepreneurial in a structured environment. S/he will have a strong background in and comfort with quantitative analytics and deep relationships in Japan.  \n \nThe Manager, Live Action Content Licensing should be comfortable working autonomously in a fast-paced environment, taking the initiative, managing multiple projects, and working to find creative solutions with partners under tight time-frames. S/he is also a motivated, self-starter with a keen interest in and aptitude for finding great content from all over the world.\n \nThe Opportunity\nNetflix is one of the world's leading entertainment services with over 230 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n","requirements":[],"extras":[{"title":"Specific responsibilities include, but are not limited to:","content":["Develop and execute strategy for acquiring global rights to desirable TV & Film programming, sourced from outside the major studios","Oversee local programming for Japan through a deep knowledge of the production landscape - both the creators and the distributors and the ability to identify appealing series and films early in the life cycle","Develop co-production models to gain access to global content rights from producers and local studios","Utilize existing relationships with local and regional distributors to enable successful licensing of local content","Build content pipeline around specific genres and verticals, such as local drama and film","Participate in all aspects of negotiation (financial analysis and forecasting, contract drafting, security requirements, amendments)","Represent acquisition team interests across the company (operations, legal, finance, business intelligence/reporting, content marketing) on a regular basis and as needed on a project basis","Manage and evaluate external accounts through performance tracking and relationship cultivation in an effort to extend/enhance existing deals and identify new opportunities for great programming","Develop market expertise through continuous focus on and knowledge of the competitive and market environment -- locally, in specific markets, and globally, across all territories"]},{"title":"Qualifications:","content":["BA/BS required, MBA preferred but not required","10+ years of relevant work experience is required with 6+ years of negotiation/sales experience","Prior television, studio, investment banking, management consulting or media-focused technology experience preferred but not required","Direct knowledge of market-specific players and television programming in Japan","Communicate market trends and industry shifts, including implications and recommendations, to internal and external partners","Demonstrated mastery of verbal and written communication skills","Great analytical and critical thinking skills","Demonstrated experience in market analysis, competitive analysis and strategic thinking","Ability to work independently and change direction frequently","Ability to evaluate content on a creative basis","Ability to manage and process detailed information while keeping perspective on the bigger picture","Demonstrated ability to work cross functionally and across multiple geographies and time zones","Excellent project and time management skills","Fluency in Japanese is required, and English language proficiency is preferred"]}],"location_emoji":"🇯🇵"}