{"title":"Manager, Community - Multicultural Publicity","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"10","salary":{"min":165000.0,"max":445000.0,"format":"per-year-salary","currency":"USD"},"tags":[""],"skills":[""],"overview":"The Manager of Community on the Multicultural Publicity Team will work across Netflix's publicity teams to craft culturally relevant campaigns for the brand, titles, and talent, devising and executing tailored, innovative campaigns that shape the perception of Original Films, Series, Kids & Family, and Documentary content within multicultural communities.","description":"It’s an amazing time to be joining Netflix as we continue to transform entertainment globally. Netflix is one of the world's leading entertainment services with 233 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Opportunity\nThis Manager of Community on the Multicultural Publicity Team will work across our publicity teams, helping to craft campaigns that drive culturally relevant conversations around the Netflix brand, titles, and talent. The role will help devise and execute tailored, culturally relevant and innovative campaigns that help shape the perception of our Original Films, Series, Kids & Family and Documentary content within multicultural communities.  \n\nThe ideal candidate will have deep entertainment (film, tv, sports, and/or music) experience and strong industry relationships along with a love of great storytelling! They will know how to strategically engage with specific community audiences through publicity, digital, grassroots and event efforts.  This is a very hands-on role that requires extensive knowledge of the cultural landscape, a savvy consumer of social media, as well as the ability to be a strong cross-functional partner to multiple teams, including publicity, communications, marketing, editorial & publishing and awards. \n\nThe role requires a seasoned professional who is results-oriented, as well as a clear and concise communicator. They will have experience in communicating with executives, filmmakers, talent, talent representatives, agencies and production partners. They can anticipate messaging needs, be proactive, and able to meet fast-breaking deadlines. Curiosity, creativity, and the ability to take risks are expected.  This person will need to be able to manage a budget, operate at scale and be able to identify efficiencies while also keeping standards high and focusing on impact.\n\n","requirements":[],"extras":[{"title":"The Role","content":["Provide big-picture thinking and leadership to continuously elevate and promote Netflix’s original content","Manage strong community and partner relationships with brands, organizations, and community leaders that speak to Latinx as well as Black, Asian American, and LGBTQ communities","Develop relationships with Brands, Organizations, Founders, Executive Directors, Community Organizers, Community Engagement and Event Leads, College/School Administrators, etc","Identify strategic partnerships with Community organizations and leaders","Create a strategic plan to support a title with community partnerships","Know what is in the cultural zeitgeist and the ability to identify cultural moments at the intersection of audiences and title work","Align and strategize with Audience Publicists on titles where Community efforts will drive conversations","Develop budget and resources needed against plan","Oversee execution of community plan"]},{"title":"The Ideal Qualifications","content":["Ideally 10 years of progressive experience within marketing, publicity or social; experience leading audience or community engagement initiatives is highly preferred","Entertainment experience working in a studio, network, agency, brand or organization (experience within Sports would be a huge added plus!)","Proven success engaging communities and building audiences through Community & strategic partnerships","Experience engaging with multicultural audiences and deep knowledge of cultural festivals, conventions and events","Ability to build strong relationships and work across many internal cross-functional teams","High tolerance for change and the capacity to adapt to a fast-paced, ever-changing environment","Respect and enthusiasm for the Netflix brand, its IP and its culture.","Entrepreneurial and highly curious. Experience working within a startup at a larger corporation is a plus.","Must be able to prioritize and handle several projects at the same time in a fast-paced environment while adhering to shifting deadlines"]}],"location_emoji":"🇺🇸"}