{"title":"Manager, Ads Marketing","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Ads Marketing","Brand Partners","Strategic Approaches","Business Tactics","Learning and Development","Go-to-Market Strategies","Ads Narrative"],"skills":["CTV","OTT","Streaming landscape","Ads","B2B marketing","product marketing","digital advertising","marketing communications","product positioning","narrative development","collateral development","cross-functional environment","communications","analytical skills","organizational skills","ambiguity","creative ideas","agencies","competing projects","tight deadlines","product strategy","positioning","messaging","content development","blog posts","case studies","presentations","creative assets","thought leadership","measurement products","entrepreneurial mindset","company culture"],"overview":"The Manager, Ads Marketing will craft and activate the Netflix advertising story and value proposition, collaborate cross-functionally, develop go-to-market strategies, and deliver regular updates to leadership.","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Manager, Ads Marketing will be a key architect in the Ads Marketing team’s success by crafting and activating the Netflix advertising story and value proposition to brand partners across key markets. You’ll work with multidisciplinary teams to develop strategic approaches to fueling brand and business growth on platform, unlocking the creative potential of Netflix's ads offering. \n\nAdditionally, you will contribute to broader business tactics and pursue learning and development opportunities to consistently grow and evolve as a Netflix marketer and leader.\n","requirements":[],"extras":[{"title":"Core Responsibilities:","content":["Design and craft go-to-market strategies and narratives in an exciting way for the Sales team and their advertising clients in collaboration with Global Ads Marketing team.","Collaborate cross-functionally (Comms, Ad Product, Research & Marketing) to ensure a consistent ads narrative.","Lead the strategy and approach for how Netflix Ads shows up at local industry events and bespoke client engagements.","Pull together business goals, to align on audiences to target, channels to employ, countries to activate, etc.","Work with product and comms partners to clearly define marketing needs and coordinate various parts of the Ad Sales organization to execute against those needs (e.g. brand design, organic social, paid social, partner marketing, etc).","Collaborate in building the marketing strategy for ad product launches.","Understand our partners (advertisers), and seek actionable insights to inform product and marketing strategy, and represent partners to cross-functional teams.","Assess the right data and insights and upcoming ad solutions to identify key B2B stories that will resonate with the region and local markets.","Deliver regular updates to leadership complete with wins, challenges, and asks.","Collaborate with cross-functional and international teams for launches and ongoing growth. Partner regularly with Product, Sales, PR, and other cross-functional partners."]},{"title":"Qualifications:","content":["An understanding of of the CTV/OTT/Streaming landscape.","7+ years of experience in Ads or B2B marketing, product marketing, digital advertising or marketing communications.","Experience in product positioning, narrative, and collateral development.","Ability to work in a highly cross-functional environment to drive stakeholder alignment and scaled communications.","Analytical and organizational skills, and the ability to communicate effectively in person at all business levels and effectively navigate ambiguity.","Ability to develop and implement creative ideas, partner with agencies, and carefully manage competing projects with tight deadlines.","Work closely with product and sales teams to develop product strategy, positioning, and messaging.","Develop content including blog posts, case studies, presentations, creative assets, and thought leadership that support our marketing objectives.","Help inform the development of new measurement products based on advertiser feedback and market insights.","You have an entrepreneurial mindset and are eager to flourish in our unique company culture (see Who We Are)."]}],"location_emoji":"🌍"}