{"title":"Manager, Technology Systems and Operations - North Asia","location":["Tokyo, Japan"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Technology Systems","Operations","Service Organization","Technology Support","Business Stakeholders","Product Roadmaps","User-Facing Team"],"skills":["English","Japanese","Information Technology","Entertainment Production Technology","IT Management","Communication Skills","Decision Making"],"overview":"The Manager, Technology Systems and Operations - North Asia is responsible for building and leading a service organization that focuses on providing quality interactions at scale and enabling access to simple and effective technology quickly in the North Asia sub-region of APAC.","description":"Netflix is the world's leading streaming entertainment service with 230+ million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n \nNetflix has an extreme dedication to both the viewers and creators of our content. The Netflix Technology (N-Tech) team exists to empower and bolster the capabilities of our amazing colleagues to do the best work of their careers. We believe in offering simple, secure, and scalable solutions while delivering a stellar support experience. \n \nThe Manager, Technology Systems and Operations - North Asia is accountable for building and evolving a service organization focused on quality interactions at scale and enabling access to simple and effective technology quickly. This person is someone who understands technology deeply but can have frictionless conversations with anyone agnostic of their technical competency. They thrive in ambiguity and look to build great teams instead of great processes. Working with, for, and through others they succeed by building a culture of trust and resilience that will set Netflix up for success for years to come.  We are looking for a stunning manager to lead this initiative for our North Asia sub-region of APAC. The role will be based in our Tokyo office.\n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Living the Netflix Culture and ensuring it is represented within your teams globally","Managing the Technology Systems and Operations Specialists, AV Engineers and future roles to best support the technology needs of our employees and external partners","Advocate for improving Netflix employee productivity in APAC","Build strong partnerships with business stakeholders and cross-functional partners such as Network/Infrastructure, Information Security, Workplace, Talent, and Production teams, and other various teams to work towards common goals and initiatives","Helping to set the strategy of the organization and working collaboratively with other regional managers to execute strategy","Collaborate with regional stakeholders to understand market nuances that may influence the product roadmaps","Navigates roadblocks for the team using great judgment to deliver an amazing technology support experience","Develop an APAC support roadmap that is in sync with the vision of the broader Netflix Technology organization","Enable a simple and streamlined user facing team for all technical requests","Constantly innovating to improve the employee self service experience (i.e. development of self service tools, education, and intranet/knowledgebase)","Create memos to widely distribute and get feedback on new ideas, proposed tests, and to gain broader alignment on key tech support decisions","Innovate on employee self-service experience (i.e. improved hardware deployment workflows, frictionless site support)","Deliver and maintain high level of support for our users and continuously look for improvements to the support experience","Participate in bug triage and prioritization, user-facing outage management, and escalation of issues as appropriate","Work to reduce user friction and reliability concerns within the products and processes","Define and monitor key performance indicators at a team and individual level focused on operational excellence","Work closely with key internal stakeholders to ensure that we build a team that adheres to Netflix’s commitment to fostering an inclusive culture"]},{"title":"Requirements:","content":["Fluency in English and Japanese is required","Significant proven experience in at least one of the following industries: Information Technology in a senior management capacity or Entertainment Production Technology, including experience with production office applications","Experience managing a team of IT professionals with a variety of responsibilities","Strong communication skills to partner with technical and non-technical stakeholders in a global and diverse environment","Experience in making informed and agile decisions at the global/regional/country level and high velocity execution","Having awareness in gaining clarity to ensure that your team and structure regionally represents the greater organization’s mission and vision","Expertise in utilizing metrics and data to analyze and assess business priorities, drive decision making and setting strategy, and measure success toward organizational goals","Knowledge of forecasting and budgetary management within an IT organization","Strong foundational understanding of IT infrastructure, networking, cloud and SaaS applications, and operations with Google G Suite experience","Knowledge and experience performing advanced troubleshooting for Mac OS, Chrome OS, Windows OS, Linux, and various applications","Familiarity with fundamental networking/distributed computing environment concepts; local and network based user and group accounts and permissions","Solid foundational understanding of building and supporting, corporate offices, creative AV spaces and conference rooms"]}],"location_emoji":"🇯🇵"}