{"title":"Manager, Revenue Analytics - EMEA","location":["Amsterdam, Netherlands"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"The Manager, Revenue Analytics - EMEA position at Netflix's EMEA headquarters in Amsterdam involves analyzing membership and revenue drivers across EMEA, supporting regional growth initiatives, and collaborating with various teams to inform revenue and membership forecasts. The role requires strong analytical skills, business intuition, and the ability to communicate insights effectively. The candidate should have 5+ years of experience in a quantitative role, proficiency in SQL and MS Excel, and excellent verbal and written communication skills.","description":"Netflix is one of the world's leading entertainment services with 233 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nOur top level executives closely monitor revenue and membership growth as key metrics of business performance. The Finance, Strategy & Analysis (FS&A), Revenue Analytics team provides the company with insights into what drives our past and current revenue and membership trends as well as an outlook on future growth. The outcomes of the analyses play a critical role in how we plan for and execute on the company's business objectives. Our revenue and membership forecasts are critical components that feed into the corporate planning process for spending and resource allocation.\n\nNetflix derives a significant competitive advantage from the highly analytical approach it takes to managing all aspects of the business. As we continue to push for growth in Europe, the Middle East, and Africa (EMEA), we are looking for a Manager to join the FS&A, Revenue Analytics team in the region. This role is focused on analyzing membership and revenue drivers across EMEA, as well as supporting regional strategic growth initiatives across all commercial aspects of the business. \n\nThis role is based out of Netflix’s EMEA headquarter in Amsterdam. The role will include occasional travel to Netflix’s global headquarter in California.\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Lead and support strategic value-added analyses to understand the drivers behind membership and revenue growth in the EMEA markets to derive actionable insights and feedback to collaborative stakeholders","Assess and communicate the impact from business decisions such as e.g. price-changes, content-launches, and product-innovations","Analyze and evaluate the business impact of key external events such as e.g. competitor-moves or country-specific events","Research, track and generate insights about the membership growth landscape","Conceptualize and design growth performance dashboards","Be a key contributor to in-region pricing analyses and frameworks, building and compiling internal and external intelligence to inform pricing decisions","Work cross-functionally within the organization across content, product, and finance:","Collect cross-functional inputs to inform and support the the revenue and membership forecasts (acquisition, retention, and market penetration)","Foster collaboration across all analytical functions within the company to share best practices and improve analytical learnings in order to best inform our commerce strategy.","Represent the global revenue analytics team in the region to facilitate revenue performance reporting and communication to senior management"]},{"title":"Qualifications","content":["A successful candidate should have the ability to combine comprehensive data analytics with sound business intuition and judgment, and effectively communicate analytical insights to stakeholders. Given the questions asked of our team are often urgent in nature and have an immediate impact on how the business makes decisions, the individual coming into this role must be able to deliver accurate results promptly. She/He/They must thrive in a fast-paced environment, possess a high level of intellectual curiosity, focus on generating results and exhibit the highest personal and professional standards of integrity and ethics.","5+ years in a quantitative role (e.g. business analytics, management consulting, banking, investment management, etc.)","Bachelor's degree in finance, economics, mathematics, engineering/computer science or other relevant field that demonstrates quantitative competence; master's degree preferred","Proficiency in SQL & MS Excel required. Skills in VBA or any other coding experience a plus, but not a prerequisite","Ability to independently extract, explore and analyze big data from both internal and external sources to guide the analysis of complex issues","Possess a high level of intellectual curiosity, motivation, discipline, flexibility, and ability to work effectively autonomously","Excellent verbal and written communication skills. Highly skilled in preparing effective presentations with a clear narrative and impactful visuals","History of working with and effectively influencing senior management","Team player with strong interpersonal skills, but also able to work independently with minimal supervision","Experience and knowledge with various EMEA markets"]}],"location_emoji":"🇳🇱"}