{"title":"Marketing Manager, External Games","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"Netflix is revolutionizing entertainment. We connect people with movies and television globally by delivering outstanding content and technological innovation. This is your chance to be at the forefront of Netflix’s new video game offering. We will bring these new experiences to market through the world's leading streaming entertainment app with 238 million paid memberships in over 190 countries who are already enjoying TV series, documentaries and feature films across a wide variety of genres and languages.\nMembers can watch as much as they want, anytime, anywhere, and now they can download and play mobile games anytime, anywhere with a collection of Netflix curated and produced Games. At Netflix, we have an insatiable need to continually improve our product experience and the creative elements that support it and this team sits at the forefront of the effort. \nWe are looking for a talented Marketing Manager to work in our games product marketing group as part of the Netflix Marketing organization. As a member of our team, you'll be integral in our mission to provide vision, and help build Netflix into a top global destination for games.\n\nAs marketing manager for games, you will work cross-functionally with game production, brand, creative, title marketing, social and comms to build and execute marketing campaigns in our external games portfolio. You accept the unknown and you’re able to come up with groundbreaking initiatives that will take our relationship with members and partners to the next level.\n\nWhat We Expect\n\nYou think about member joy while partnering with the External Games and Title marketing organizations to build cross functional campaigns. You will establish clear direction for marketing, brand and content for the games you are responsible for. You will be working closely with creative and product marketing teams to establish go to market strategy, and execute campaigns that deliver memorable experiences globally.\n\nYou will provide marketing and brand-centric thinking - partnering with global creative leads, regional marketing partners and external creative agencies on game campaigns.\n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Defining the overall marketing strategy for external games including positioning, goals, priority, budget, innovations and the right opportunities for our games.","Owning go to market plans for each game and connecting with the broader Netflix product marketing and title marketing organizations.","Defining roadmaps, deliverables, owners and workback schedules for each event/game and product marketing campaign.","Create, lead and execute go-to-market campaigns that drive conversation in partnership with stakeholders.","Drive games marketing strategy discussions, including positioning, key messaging, and visual identity in partnership with the brand and creative teams to ensure strategic objectives are met.","Succinctly articulate and write strategies, briefs, memos or any documentation needed to communicate our marketing approach and vision, in partnership with cross-functional teams.","Support the comms strategy and help to ensure the goals for marketing and comms are aligned.","Represent games across Netflix as an expert in the space with deep knowledge across the portfolio.","Outline goals and narrative for each event from a marketing perspective and help to determine approach for each event in collaboration with Creative Production and Comms.","Provide onsite support for events to ensure that the beat is achieving the goals we laid out and developers/producers are supported from a marketing perspective.","Collaborate with internal cross-functional teams including but not limited to Creative Production, Brand, Product, Localization, QA, Game Production, Game design, Title Marketing, Social, Partner Marketing, etc.","Manage external partners including but not limited to product developers, creative /social/influencer agencies, researchers, to make sure company brand values and image are followed","Oversee product marketing budget and maximize effectiveness of campaigns within budget."]},{"title":"Qualifications:","content":["At least 7 years of experience in game publishing/marketing; ideally having created successful marketing campaigns for multiple games on a variety of platforms and genres with a focus on F2P Live Service mobile","Experience working across multiple game marketing functions including community management, social, player support and User acquisition","Experience building successful marketing campaigns for large entertainment IPs in collaboration with filmmakers, showrunners, studios and license holders required","Proven experience as a steward of game marketing from a game portfolio perspective with the ability to support our brand vision, position, architecture and achieve overall business goals for games","Proven track record of successful marketing campaigns in collaboration with film/tv, entertainment IPs and partners","Successfully worked on multiple games simultaneously at different stages of development, understanding how to position and create large scale reach and satisfaction for those games","Experience partnering with product development teams to make insight-informed decisions that impact members","Able to galvanize and influence teams and partners across departments at all levels","Used multiple agencies and vendors working in concert to create a cohesive product marketing campaign","Able to collaborate with creatives to create a lasting impression among members","Have a style that promotes respect, credibility and trust throughout the organization"]}],"location_emoji":"🇺🇸"}