{"title":"Marketing Director - Internal Games","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"Netflix is looking for a talented Marketing Director to build our games marketing function as part of the Netflix Marketing organization. As a member of our team, you'll be integral in our mission to provide vision, and help build Netflix into a top global destination for games.\n\nAs marketing director for internal games, you will own the games marketing strategy for the internally developed games portfolio and oversee the marketing efforts within each of our diverse and talented studios.  You accept the unknown and you’re able to come up with groundbreaking initiatives that will take our relationship with players to the next level.\n\nYou will partner with the leadership of the Marketing and the Internal Games organization to build a marketing strategy for internal games and partner with each game studio leader to establish and oversee world-class marketing capabilities (including product marketing, social, and community) in each of our internal studios. You will collaborate with studio leaders throughout the entire lifecycle of our internal games to provide input that will inform our development and strategy. You will hold our studios accountable for building and executing great marketing campaigns in support of new game launches as well as live operations. You will help build and foster strong working relationships between our studios and our cross-functional partner teams including, creative production, the broader Netflix marketing team, and communications as we create and execute marketing campaigns for our internally developed games.\n\nYou will provide marketing and brand-centric thinking - partnering with global creative leads, regional marketing partners and external creative agencies on all matters involving Netflix marketing for our internal games.\n\n","requirements":[],"extras":[{"title":"What We Expect","content":["Responsible for setting the overall marketing strategy for internal games.","Responsible for building world-class marketing teams within each of our game studios, with an emphasis in live service marketing.","Responsible for defining and sharing marketing best practices among game studios and between internal and external game organizations."]},{"title":"Accountable for:","content":["Defining the overall marketing strategy for internal games including positioning, goals, priority, budget, innovations and the right opportunities for our games.","Overseeing all internal marketing efforts with holistic marketing oversight of the portfolio.","Leveraging the strength and scale of the broader Netflix marketing organization to help drive internal games marketing efforts.","Ensuring each studio has the marketing capabilities it needs to launch and operate hit games."]},{"title":"Responsibilities:","content":["Collaborate with stakeholders to define and drive the short term and long-range vision for the Netflix Games marketing, specifically for internal games.","Oversee the creation of full go to market and post-launch/live service plans for individual games including brand positioning, market analysis, and live service support (community and social).","Provide direct marketing support for studios that have yet to hire dedicated marketing resources.","Succinctly articulate and write strategies, briefs, memos or any documentation needed to communicate our marketing approach and vision.","Support the comms strategy and help to ensure the goals for marketing and comms are aligned.","Drive brand strategy discussions with the Netflix brand team and collaborate with the creative team to ensure strategic objectives are met.","Work closely with many internal teams and external partners, including product developers, researchers, marketing personnel and creative agencies to make sure company brand values and image are followed.","Work with all cross-functional teams across Creative Production, Brand, Product, localization, QA, and Operations."]},{"title":"Qualifications:","content":["At least 10 years of experience in game publishing/marketing; ideally having created successful marketing campaigns for multiple games on a variety of platforms and genres with a focus on F2P Live Service mobile.","Experience working across multiple game marketing functions including community management, social, player support, brand, and user acquisition.","Proven experience as a steward of game marketing from a game portfolio perspective with the ability to support our brand vision, position, architecture and achieve overall business goals for games.","Ability to work on multiple games simultaneously at different stages of development.","Deep passion for games and the games industry as a fan/consumer.","Experience leveraging content creators and influencers to drive growth.","Comfortable working with a diverse slate of game genres ranging from casual puzzle to AAA core titles.","Experience partnering with product development teams to make insight-informed decisions that impact members.","Experience working in a data informed environment, leveraging data from data science/analytics and other sources to make key decisions around the go-forward marketing strategy.","Able to galvanize and influence teams and partners across departments at all levels.","Experience using multiple agencies and vendors working to create a cohesive product marketing campaign. Proven experience cutting through the noise of countless marketing agencies to find true talent/creativity, and also working with them to get the highest possible ROI.","Have a style that promotes respect, credibility and trust throughout the organization."]}],"location_emoji":"🌍"}