{"title":"Music Business & Legal Affairs Specialist - Korea","location":["Seoul, South Korea"],"attendance":["Onsite"],"type":["Full-time"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Music Licensing","Contract Management","Information Management","Workflow Efficiency","Music Clearance","Negotiation","Rights Management"],"skills":["music licensing","contract and information management","clearance","researching 3rd party music ownership","negotiating music license contracts","managing and updating project trackers","guidance on music rights"],"overview":"The Music Business & Legal Affairs Specialist - Korea at Netflix is responsible for advising internal and external partners on music clearance issues, managing music contracts and information, and finding efficient solutions to music licensing issues, based in Seoul, South Korea, with at least 5 years of experience in music clearance/licensing in a content studio.","description":"Netflix is the world's leading internet entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. With this international expansion and a move into Korean originals, it's a great time to join Netflix.\n\nThe Opportunity \nNetflix is looking for a specialist with music licensing experience who will advise our internal and external partners on music clearance issues and also look after day-to-day contract and information management in connection with any music we commission and license. The successful candidate will have willingness to roll up their sleeves and tackle problems head-on, have a great acumen in finding efficiency in day-to-day workflow, and be a reliable cross-functional partner internally and externally in solving music licensing issues.  \n\nThe position is based in Seoul, South Korea. \n\n","requirements":[],"extras":[{"title":"Responsibilities include but are not limited to:","content":["Advising external production companies and internal teams on music clearance, or clear music directly as necessary for marketing/content usage. This may include researching 3rd party music ownership, obtaining quotes from labels/publishers, and negotiating music license contracts including music library deals and blanket deals;","Review, negotiate, and provide guidance on music contracts;","Manage and update project trackers and music trackers as needed to capture rights information;","Provide guidance on music rights to internal stakeholders (e.g., Marketing, Product, PR);","Help collect all documents related to our music rights and licenses from external third parties, and support/handle music registrations, including collaborating with internal partners and external partners such as KOMCA and Netflix’s sub-publisher;","Liaise with cross-functional teams on handling music licensing-out requests; and","Help find ways to scale the above to create more efficiency and give more transparency to downstream teams who need to access the relevant information;"]},{"title":"Required Qualifications:","content":["BA/BS required;","At least 5 years of music clearance/licensing experience at a content studio; experience in a media or entertainment environment preferred","Excellent interpersonal and communication skills, with the ability to effectively coordinate between cross-functional teams","Ability to think practically and be solution-oriented","Ability to respond positively to feedback and change and be respective of new ideas with willingness to tackle matters outside area of expertise","High level of organization, detail orientation and ability to time-manage across multiple deadlines in a very fast-paced environment","Proficiency with Google Suite","Fluency in Korean and high business proficiency in English"]}],"location_emoji":"🇰🇷"}