{"title":"Player Support Lead, Netflix Games Studio","location":["Los Gatos, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Player Support","External Games","Ticket Management","CRM Tools","Data Analysis","Customer Support","Game Development"],"skills":[""],"overview":"The Player Support Lead will establish and manage the player support process for Netflix's portfolio of externally developed video games, including issue escalation, ticket management, and proactive communication with players.","description":"Netflix is looking for an exceptional Player Support Lead for the External Games business to help deliver the next generation of video games for a worldwide audience. The role will lead the player support efforts for the externally developed portfolio of games in partnership with the Netflix Customer Support team that spans a global support network for Netflix. \n\nThis role will establish the player support process for the external games portfolio, adapting the issue escalation structure to work with external developers, evaluating ticket volume and type by game and delivery to a balanced SLA. They will work closely with External Production to surface and address game specific issues and trends with an understanding of new feature releases and live operated events to best support the player experience, managing through emergent issues. \n\nThe Player Support Lead will also work closely with the Product Marketing team who manages active paid media, social and community conversations; coordinating proactive and reactive messaging to holistically manage player communication and experience. \n\nThe candidate will have a track record of building strong relationships with cross functional partners internally and externally with a passion for supporting players to have the optimal experience with our games. \n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Establish the end to end player support flow for External Games, collaborating with Producers and PMs on game issues, partnering with Product Marketing and External Communications to proactively manage broader issues","Partner and guide external resources to manage support volume for a wide portfolio of games","Monitor app store reviews for games and respond to issues arising on the store surface in parallel to active ticket management","Leverage CRM tools, dashboards and regular reporting to surface player health for individual games as a part of a holistic approach for player relationship management","Continuously source relevant game information to be leveraged for Help Center and Knowledge Base content for Player self-help","Drive data analysis for all aspects of the customer support service to continuously improve the player experience"]},{"title":"Requirements:","content":["5+ years of experience in customer support including the video game industry, 2+ years in a leadership role","Familiarity and understanding of the game development process and variety of game content, preferably including live service games and games on the mobile platform","Experience with data driven approach to analyze and optimize customer support for multiple products","Deep experience with Product Marketing, PR and Community teams building holistic communication with our players","Proven track record of working with a cross functional team, driving results from influence","Strategically approaches challenges and applies flexibility to solutions","Continuously looking for ways to improve and iterate an existing framework, or building anew for best results","Player first mindset & passion for video games, innovations in software and hardware and how they enrich the player experience"]}],"location_emoji":"🇺🇸"}