{"title":"PR Manager - DACH","location":["Berlin, Germany"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["PR Manager","DACH","Media","Entertainment","Communication Campaigns","Press Relationships","Crisis Management"],"skills":["communications initiatives","campaigns","media","corporate","agency settings","DACH media landscape","journalists","key stakeholders","strategic communications plans","publicity","marketing","content teams","agency teams","German","English","entertainment","storytelling","fast-paced environment","pressure"],"overview":"The job involves devising and delivering high-impact communication campaigns and strategies, managing press relationships, and handling issues and crisis management for the DACH region in a highly admired entertainment company with a deep understanding of the DACH media landscape.","description":"Fueled by the broad appeal of instantly being able to enjoy unlimited series, documentaries, feature films, mobile games and kids and family entertainment, Netflix has grown to 233 million streaming members in over 190 countries. In Austria, Switzerland and Germany Netflix has more than 12 million members and a team of more than 100 employees. \n \nThis is therefore the total package - a great opportunity to join the PR team in a highly admired entertainment company and to work with some of the most exciting and creative people in the business. \n\nThe Role\n\nWe’re looking for an ambitious and savvy self-starter - ideally with a background in media and/or entertainment - who has a passion for film, television and/or games to join our DACH PR team. Based in Berlin, you will report to the PR Director, DACH.\n \nIn this role you will be responsible for devising and delivering high-impact communication campaigns and strategies that support our brand, reputation and executives across DACH. You will work closely with the PR Director, DACH to manage our key press relationships across the region and move our local, regional and global comms narratives forward. You will manage comms initiatives, interviews and speaking opportunities covering everything from sustainability, executive and product comms to deal announcements, new partnerships and stakeholder engagement with third parties.\n \nYou can skillfully and thoughtfully craft narratives, boil down complex concepts into succinct pitches, and successfully work with journalists, influencers and key opinion formers across broadcast, print, online and radio in the trade, consumer and media business space. \n \nYou will also have a deep understanding of issues and crisis management and will have worked alongside and managed agencies on projects.\n \nYou are able to remain calm under pressure, make wise decisions and think strategically at all times while having a hands-on mentality. You will collaborate well with internal partners from content, publicity, public policy, marketing, engineering, product and more.\n\n","requirements":[],"extras":[{"title":"Qualifications:","content":["Significant experience leading communications initiatives and campaigns in Germany, Austria or Switzerland (or all three) in media, corporate or agency settings.","A good understanding of the DACH media landscape and the confidence to build relationships with journalists and key stakeholders - proactively pitching stories across all channels.","The ability to think from first principles and put together strategic communications plans across multiple functions - including with our publicity, marketing and content teams.","A proven track record of managing agency teams and at the same time working cross functional with members of the content, marketing and partnership teams.","Excellent written and oral communication skills, in both German and English.","A love of entertainment and storytelling.","Strong work ethic and attention to detail.","The ability to thrive in a fast-paced environment and stay calm under pressure."]}],"location_emoji":"🇩🇪 (Germany)"}