{"title":"Procure to Pay Specialist - Manila","location":["Manila, Philippines"],"attendance":["Onsite"],"type":[],"experience":"2","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":["P2P Procurement","Purchase Order workflows","Excel","ERP systems","Workday","financial information","communication skills"],"overview":"The Procure-to-Pay (P2P) Specialist in Manila is responsible for assisting with purchase orders, ensuring compliance with policies and procedures, resolving invoicing issues, and identifying process improvements.","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nAs Netflix grows globally, we continue to look for the best and brightest talent to scale with our growth. We are looking for a Procure-to-Pay (P2P) Specialist to support our Finance & Procurement Operations. This newly created position is due to the continued growth of the\nBusiness, and will be based in our Philippines office. This position will interact with the Finance Procurement Operations team across our global offices and will require a flexible worker for the role.\n\nThe perfect candidate for this role will be very detail oriented, able to analyze a large volume of requests & transactions with high accuracy, have excellent communication skills, be capable of multitasking and taking the initiative to drive process change and improvements.\n","requirements":[],"extras":[{"title":"The Procure-to-Pay (P2P) Specialist is responsible for the day-to-day P2P activities that include:","content":["Assist Buyers with creating and processing Purchase Orders (POs)","Facilitate change requests and change orders for POs","Review POs to ensure proper coding and compliance with company policies, controls and procedures","Understand coding nuances and accounting treatment for select teams / areas of the business","Identify Invoice and PO discrepancies and understand actions within workflow to resolve","Identify process gaps and improvement opportunities across P2P workflow","Serve as a resource for the Finance Procurement Operations team regarding policies & procedures","Resolve invoicing and AP related issues through the company’s ERP and ticketing system","Monitor status of open PO line items during accounting month end close","Support monthly accounting close activities as needed","Review, analyze, and respond to internal and external supplier inquiries","Partner closely with Buyers and Finance Procurement Ops Business Partners","Liaison between Buyers, AP and internal business stakeholders when needed","Perform other duties and ad hoc tasks contributing to the organization’s goals","Open to work during regular business hours, with flexibility to slide shifts/ work overtime for certain critical business periods"]},{"title":"Skills Required:","content":["Thrive in an environment with high volume of transactions and fast-paced environment","Ability to maintain a high level of accuracy in preparing and entering financial information","Deep knowledge and understanding of P2P Procurement and Purchase Order workflows","Customer Service oriented person who focuses on quality communication and attention to detail","Excellent written and verbal communication skills","Proficient in Excel and ERP systems (Workday experience a plus)","Highly motivated with the ability to work independently","Forward looking thinker who can articulate the need for and contribute to process improvements ideas","Works with a sense of urgency and sensitivity to last-minute highly critical business requests","Uses good judgment and knows when to make a decision and when to escalate","Exemplifies the Netflix Culture"]}],"location_emoji":"🇵🇭"}