{"title":"Product Manager, Specialized Rankers","location":["Los Gatos, California"],"attendance":["Onsite"],"type":[],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Manager","Specialized Rankers","Machine Learning","Data Scientists","Software Engineers","AB Testing","Algorithmic Solutions"],"skills":["machine learning","recommendation systems","AB testing","data science","machine learning engineering","statistics","product management"],"overview":"Netflix is looking for a Product Manager to enhance personalization capabilities and create algorithmically powered experiences, working with cross-functional teams to drive transformational change and shape the product.","description":"The Role\nNetflix is one of the world's leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want anytime, anywhere and can change their plans at any time.  \n\nPersonalization permeates almost every aspect of the Netflix product experience: From adapting the UI’s layout to member tastes, recommending the most delightful content, to showing the most helpful title images and trailers to help members choose better - machine learning is essential to how members enjoy our service.\n\nWe are looking for a Product manager to both advance our existing personalization capabilities in the member experience and to build new algorithmically powered experiences that will delight our members, with a focus on specific contexts like ranking titles a member has previously interacted with, or recommendations related to a specific context like “More Like This”. \n\nLeveraging available data, you will craft and communicate a strategic roadmap and see to its execution leading cross-functional teams of the industry’s best data scientists, machine learning and software engineers. You will work in close partnership with the member experience product management team, design, consumer insights and other functions to bring your vision to life and drive transformational change of the product experience. As a high-leverage thought leader, you will have the ability to shape our thinking on how to evolve our product, and have a massive impact on how members enjoy our service. \n\nThis role is based in our Los Gatos office (preferred) in a hybrid model, but we are open to remote candidates who are on the West Coast. Some travel to Los Gatos will be required.\n\nWho will be successful in this role?\nYou combine a deep technical background in e.g. statistics, econometrics, or machine learning with a strong product sense and excellent communication skills to define, explain and execute your vision. You naturally gravitate towards experimentation as a way to validate your hypotheses while having a healthy skepticism when interpreting experimental results. In order to be successful in this position, you need to be able to work with world-class engineers, have the statistical acumen to collaborate with top-notch data scientists and the business sense to drive product goals and strategies. Demonstrated ability to build successful consumer facing applications and algorithms, and a strong feel for the entertainment business are big pluses. \n\n","requirements":[],"extras":[{"title":"What we offer","content":["The opportunity to have impact. The products and features you will be working on are central to the product experience of hundreds of millions of people around the world.","Responsibility. Netflix offers true transparency and autonomy. Our culture is unique and is key to how we innovate.","Learning. You will be creating customer experiences and business models that have never been done before. You will have the opportunity to work with stunning colleagues who value collaboration and from whom you can learn.","A work environment where you can grow your career. Many of our top execs started out as individual contributors."]},{"title":"Skills","content":["Experience managing consumer products leveraging machine learning (e.g. recommendation systems) with a proven record of prioritizing and successfully launching impactful products or platforms.","Demonstrated leadership experience working effectively with data scientists, machine learning engineers, statisticians etc.","Proven ability to map algorithmic solutions to product problems with demonstrated impact on business metrics through AB testing.","Excellent written communication skills and ability to present technical content to non-technical audiences.","Ability to partner with different functions to ensure that your solutions drive real business impact. Strategic thinking and ability to incorporate larger business context into algorithm and product development.","Post graduate education (MS or PhD) in an applied quantitative field is strongly preferred, such as : Machine Learning, Statistics, Operations research, Information theory, Control theory, Econometrics etc."]}],"location_emoji":"🇺🇸"}