{"title":"Product Reliability Engineer","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Reliability","Data Analysis","Technical Troubleshooting","Process Improvement","SQL","Data Visualization","Incident Management"],"skills":["SQL","Apache Spark","Python","Tableau","HTML","HTTP","REST","Jira"],"overview":"A Product Reliability Engineer at Netflix is responsible for analyzing data and identifying patterns to enhance user experience and improve technology and services internally. They provide technical support, troubleshoot issues, and collaborate with cross-functional teams to drive meaningful outcomes. Strong analytical, communication, and problem-solving skills are essential for this role.","description":"Netflix is revolutionizing entertainment by producing, distributing, and streaming content at a massive scale. Over 220 million members around the globe are currently enjoying more than two billion hours per month of original series, documentaries, and feature films.  Visit our long-term view to learn more.\n\nThis role is open to Remote candidates anywhere in the US or candidates seeking to work from any of our US office locations.\n\nNetflix Technology Services (N-Tech) is a blended team with unique backgrounds and interests who share a passion for people and technology. N-Tech believes everyone deserves effortless technology experiences to stay more focused, productive, and inspired so they can do their best work at Netflix. N-Tech powers effortless digital experiences by leaning on our people, our proximity to the users we support, and our position across Netflix to seek out and convert the friction users experience utilizing technology into understanding that energizes technology partners to take action.\n\nThe N-Tech’s Workforce Productivity and Reliability Team (WPR) (which this role is part of) plays a crucial role in understanding the needs and pain points of users and translating that knowledge into actionable insights for improving the technology and services provided internally. \nAs an N-Tech Product Reliability Engineer within the WPR team, you will analyze data collected from various sources, such as support requests, system logs, and user feedback. You will be focusing on digging into different technical problems, issues, complexities, incidents, and opportunities that result in user friction.  Through data analysis, you will identify patterns, trends, and correlations that help uncover opportunities for enhancing user experience. You will focus on understanding how people use and interact with technology to help product, engineering, platforms, services, and operational teams increase their impact and efficiency. \n\nThis role is highly fulfilling for individuals with a genuine passion for delving into diverse problems, collaborating with others to find solutions, and utilizing data and insights to measure and visualize their impact. Our team seeks individuals with a broad set of technical expertise, and analytical and communication skills who can effectively consult and engage with a wide range of groups, fostering productive collaborations and driving meaningful outcomes.\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Provide advanced technical support and troubleshooting for escalated problems, ensuring timely and effective resolution","Utilize data-driven insights and analytical techniques to analyze complex technical problems, identify patterns, and derive actionable recommendations","Identify opportunities for process improvements and automation through data analysis, reducing the occurrence of technical issues and enhancing overall support efficiency","Perform a Supportability and Reliability audit of the new internal products/services or feature launches","Proactively continuously share insights and data with the Product and Engineering teams on service performance, user friction, and experience trends","Apply systems analysis techniques to internal services at Netflix: including writing complex SQL statements and joins and creating visualizations to tell clear stories about complexities","Develop strong cross-functional relationships with business partners across Studio, Corporate, Security, Creative Production, Data Engineering, Analytical, Support teams, and others","Proactively monitor service performance, analyze data, and identify potential issues before they impact user experience","Learn new tools, systems, and technologies quickly as required by your domain or project","Stay up to date with service/ product changes and feature launches, sharing knowledge and insights with the Netflix Technology organization to ensure effective Knowledge management workflow","Participate in incident management on-call rotation and help lead the Incident Management Lifecycle for supported technology. Participate in root cause analysis and post-incident reviews, driving continuous improvement and prevention of recurring technical issues"]},{"title":"Skills and Experiences:","content":["Ability to gather and analyze various data points (qualitative and quantitative) and whittle that information down to the most salient insights for the business","Big data experience with extracting (e.g., SQL, Apache Spark, Python) and visualizing data (e.g., Tableau)","Experience building productive relationships with partners and leaders across the organization","Ability to articulate an argument and influence leadership partners. Ability to effectively debate and use data as the basis of your argument","Ability to manage multiple competing priorities simultaneously without losing sight of key goals. Ability to drive teams/decisions through ambiguity","Experience providing technical support for applications/services and infrastructure","HTML / HTTP / REST Fundamentals","Familiarity with issue ticketing systems (Jira, Zendesk preferred)","Analytical mind and problem-solving aptitude","Excellent communication skills","Self-motivated and eager to learn when faced with challenges","Experience creating basic scripts in any of the programming languages"]}],"location_emoji":"🇺🇸"}