{"title":"Product Designer - Enterprise XD - Games","location":["Los Gatos, California"],"attendance":["Remote"],"type":["Full-time"],"experience":"8","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Design","Interaction Design","User Research","Visual Communication","Design Strategy","User Experience","Software Development"],"skills":["Product Design","Interaction Design","User Research","Visual Communication","Design Strategy","User Experience","Product Launches"],"overview":"The job overview for the Product Designer - Enterprise XD - Games position is to collaborate with design, product, business, and engineering partners to develop product and design strategies, understand user needs, drive a product vision, craft intuitive experiences, contribute to a scalable user experience strategy, and bring stakeholders together to solve problems.","description":"About the Enterprise XD - Games Team\n\nOur product team builds and innovates the technology foundations for Games Studios users at Netflix to understand, organize, and launch mobile and cloud games on Netflix’s global platforms. Our mission is to create the best Games publishing experience for Games studios and creators, so they can focus on making. \n\n\nOur team is scrappy and entrepreneurial, and we stay aligned on the highest business priorities. Each Product Designer on the team has a broad set of skills ranging from product thinking, interaction design, user research, and visual communication. We are masters of our craft but aren’t afraid to wear multiple hats when needed. \n\n\nAs a senior-level Product Designer, you will collaborate closely with other seasoned design leaders, product managers, engineers, and stakeholders. We strive to deliver value to our users with our existing mission-critical products while driving strategic long-term product visions for new Netflix initiatives. \n\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Collaborate with other design, product, business, and engineering partners to lead and develop product and design strategies.","Conduct or collaborate with Insights & Research to gain a deep understanding of the user and their needs.","Lead and drive a product vision rooted in world-class user experience that inspires the team to push on the envelope on what’s possible.","Craft simple and intuitive experiences in a space that has complex rules and workflows","Expand and contribute to a scalable user experience strategy or design system that benefits Netflix product design at scale.","Bring multiple stakeholders to the table to understand and solve problems."]},{"title":"The Must-Haves","content":["8+ years of Product Design experience in both consumer and B2B products.","Experience working with game developers, studios or creators on software related to games publishing.","Understanding of complex workflows designed to scale across global teams and pro users.","Multiple successful product launches that drove meaningful impact on the business","Top-notch design craft","Ability to rapidly ideate and produce multiple design concepts while navigating through ambiguous problem spaces.","Experience working directly with stakeholders to drive consensus and mine for value","The communication skills to clearly articulate your concepts and rally your stakeholders and partners along.","A willingness to fail and learn","Earnest, mature, and ego-free. You welcome candid feedback and can constructively give it as well"]},{"title":"Even Better","content":["Experience designing tools for content creators, Ops teams, or professional collaboration is a plus.","A passion for games and entertainment","Ability to work in PST and live in either Los Angeles or the Bay Area"]},{"title":"Why work at Netflix?","content":["If you want to have a large impact at a growing company and work with a high-performance team. Work with talented colleagues on challenging problems that affect 200+ million members across the globe.","We value high performance, freedom, and responsibility. We don't focus on rules, processes, or procedures. We are candid and transparent and seek excellence in all that we do.","We tackle hard problems that others have yet to be able to solve. We produce great content, build systems at scale, and use data to push the business forward. We connect people with visual storytelling globally."]}],"location_emoji":"🌍"}