{"title":"Product Designer - Business and Legal Affairs","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"7","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Designer","Business and Legal Affairs","Dealmaking","Design Process","Deal and Rights Management Systems","Leadership","Communication Skills"],"skills":[""],"overview":"","description":"About Enterprise XD\nAt Netflix, we want to entertain the world. We’re the leading provider of streaming video reaching over 240 million subscribers in more than 30 languages and 190 countries because great stories can come from anywhere and be loved everywhere. Whatever your taste, and no matter where you live, we give you access to best-in-class TV series, documentaries, feature films, and mobile games. The Enterprise XD team is at the heart of this work building tools that power the future of Netflix and a $15 billion+ content budget. We’re leaders in our field and on our teams. We collaborate with product, engineering, and stakeholder partners to expertly apply the design process and leverage industry-defining technology and data. We create innovative and scalable systems that make our proprietary experiences possible—from content, to games, to ads and more.\n\nAbout the Business & Legal Affairs Role\nNetflix’s dealmaking empowers our competitiveness and sets industry standards for flexibility, rights, fairness, financials, and more. Our dealmaking tools leverage years of data and insights to help our teams make informed decisions, negotiate better deals, proactively fulfill legal obligations, and leverage our Rights and Assets to their full potential. As a product designer on the Business and Legal affairs team, you will lead the design of deal and rights management systems for all of our content properties—movies, series, music, games, ads, etc—from inception to end. \n","requirements":[],"extras":[{"title":"About You","content":["You are a leader with exceptional communication skills.","You’re an expert in leveraging the design process to achieve high-quality execution, set a vision, and facilitate dialog on your team.","You’re comfortable with ambiguity and can work with others to organize, break down, and structure complex problems.","You’re an expert at time management.","You independently balance your time wisely between the day-to-day and long-term needs of the team.","You’re proactive at connecting work and needs across teams."]},{"title":"Responsibilities","content":["Lead multiple projects spanning sustained investments and roadmaps with cross-functional partners.","Collaborate with product, data science, business, and engineering partners to lead and develop product and design strategies for existing roadmaps and new initiatives.","Work with data science, studio partners, and consumer insights teams to gain a deep understanding of users and their needs.","Expertly balance user and business needs to set direction and inspire the team to build ambitious, innovative, and industry-defining solutions.","Bring multiple stakeholders along the journey while you solve their most challenging problems for the business.","Assess complex workflows to create simple, intuitive, and scalable product experiences that improve our ability to manage global productions.","Use design as a tool for creating alignment on strategy between product teams and the stakeholders.","Initiate and lead strategic and tactical discussions with cross-functional partners and stakeholders to identify business needs, shape strategy, and account for complexities and uncertainties."]},{"title":"The Must-Haves","content":["7+ years of Product Design experience designing a mix of consumer and enterprise products.","Demonstrated excellence in craft, communication, collaboration, and business acumen.","Multiple examples of successful product launches that led to meaningful business impact.","Ability to quickly grasp complex workflows and design solutions that scale to diverse and global teams.","Ability to rapidly ideate, produce, and test multiple UX/UI concepts and prototypes.","Expertise in playing a lead role on cross-functional teams to work with partners to define and execute against priorities.","Strong communication skills to share concepts, facilitate discussions, and constructively debate their potential.","Experience working in fast-paced, continuous delivery environments.","A willingness to fail, learn, and share your findings with your colleagues.","An ego-free and earnest mindset—you welcome candid feedback and constructively give it.","A passion for entertainment, filmmaking, and storytelling."]},{"title":"Even Better","content":["Experience designing enterprise, streaming, or productivity tooling"]}],"location_emoji":"🇺🇸"}