{"title":"Publicity Specialist - Korea","location":["Seoul, South Korea"],"attendance":["Onsite"],"type":[],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nAbout the Role\nWe are looking to hire a creative self-starter who loves, lives, and breathes entertainment, to be a Publicity Specialist for local and global titles. \nBased in Seoul, Korea, you will be part of a team of stunning storytellers working on impactful publicity campaigns to drive the conversation for upcoming series and film titles. \nReporting to a publicity campaign leader, the role requires excellent cross-functional relationships, and the ability to build and maintain strong rapport with internal and external stakeholders across talent, showrunners, partners, and the press. The role will require to have a deep understanding of how to build, manage and support strategic publicity campaigns, the ability to work well with anyone, anywhere, and be excited by creative single/multiple title storytellings, and innovative ideas that spark impactful conversations about the titles.\n\n","requirements":[],"extras":[{"title":"The Role:  These roles can be managed independently or/and in partnership with other publicists in the team.","content":["Drive innovative publicity campaigns for our Korean content and global titles to reach new and existing fans around the world","Tell creative single-title and multi-title storytelling, and outside-the-box campaigns that spark conversations","Build and maintain great relationships with internal and external stakeholders including reporters, talent representatives, talent/showrunners, and our partners","Act as a liaison to communicate with XF partners (content, production management, marketing etc) to create impactful announcements for multi-title & slate events (e.g-Tudum)","Write press releases and editorial plans","Plan and manage various PR activities (e.g- set visits, talent interviews, press conferences)","Assist with talent travel needs","Update and maintain various publicity-related tools, databases, and trackers","Manage agency"]},{"title":"The successful candidate for this role will likely:","content":["Have 4-7 years of experience in a field of entertainment, PR, studio, agency setting","Possess a keen understanding of media and have relationships with the press","Be able and willing to operate in a global environment","Be a clear and concise communicator in Korean as well as in English","Have experience executing a PR campaign by working well across disciplines","Be able to manage multiple tasks simultaneously under deadline and thrive in high energy, fast-paced environment","Have experience managing agencies, be effective in dealing with talent, talent reps, reporters, and other media influencers"]}],"location_emoji":"🇰🇷"}