{"title":"Sales Partner - France","location":["Paris, France"],"attendance":["Onsite"],"type":["Full-time"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Sales Partner","France","Agency sales strategy","Account planning","Advertising ecosystem","Revenue targets","Client relationships"],"skills":["Sales Partner","France","Sales strategy","Agency sales strategy","Account planning","Advertisers","Relationships","Revenue targets","Audience insights","Measurement solutions","Advertising ecosystem","Revenue growth","Advertising campaigns","Market trends","Competitor activity","Innovation","Advertising experience","Marketing knowledge","Media Agencies","TV advertising","Digital advertising","People management","Analytical capabilities","Communication skills","Collaboration","Risk management","Passion for entertainment"],"overview":"The Sales Partner - France position at Netflix involves leading the development and execution of the Agency sales strategy for France, building relationships with Agency partners and clients, driving revenue growth, and collaborating with cross-functional teams.","description":"Netflix is the world's leading streaming entertainment service with over 230 million paid memberships in over 190 countries. Our mission is to entertain the world and we are constantly innovating to bring the best stories from around the world to our members. With the incredible launch of our ad-supported model, we are now working toward providing more choices for consumers and a premium brand experience for advertisers. We are now seeking a Sales Partner Lead in the UK to help shape our sales strategy for Netflix in France.\n\nAs the Sales Partner in France, you will be responsible for helping lead the development and execution of the Agency sales strategy for France. You will work closely with the senior-level account director, account planning stakeholders, traders, and investment directors with our Agency partners. You will also start a strong relationship with the advertisers to evangelize the use of Netflix among the C-level suit: CMO, CDO, Media Directors etc. \n\nThe role will involve a combination of developing business with the senior stakeholders at a given major Agency group alongside the building of key client relationships with C-level, VP and Director contacts within those portfolios. As the Sales leader, you will be tasked with jointly driving Netflix Advertising opportunities with both key Agency partners and Client leaders.  \n\nYou will be accountable for delivering revenue targets by leveraging Netflix's unique audience insights and premium content offerings. You will work closely with our Measurement Leads to develop the best-in-class measurement solutions to meet our Clients’ needs. The role will also be a focal point for driving the necessary internal developments to ensure our success. Cross-functional collaboration with Ad Product, Marketing, Content and Partnership Development teams will be crucial.\n\nThe ideal candidate will have a deep understanding of the advertising ecosystem in an established network of relationships, and a track record of delivering revenue growth.\n","requirements":[],"extras":[{"title":"Key Responsibilities:","content":["Develop and execute agency-focused sales for France to deliver revenue targets and exceed client expectations","Build and maintain strong relationships with a major Agency Holding group and related Agencies to secure ad partnerships and drive revenue growth.","Develop long-term relationships with key senior Clients within those portfolios.","Partner with Microsoft Partner teams to respond to briefs and grow the business together.","Develop sales strategies and sales plans for the assigned Account portfolio Collaborate with cross-functional teams to ensure the successful delivery of advertising campaigns.","Leverage Netflix's unique audience insights and premium content offerings to drive revenue growth.","Monitor market trends, and competitor activity and identify opportunities for innovation."]},{"title":"We’re Looking for:","content":["At least 10 years of experience in advertising or media (incl. sales) with a proven track record of delivering revenue growth.","Strong knowledge of marketing and communication objectives and pillars.","Ability to move easily from strategic thinking to operational tasks.","Deep understanding of the Media Agencies/Holding Companies and an established network of relationships at the senior level within them.","Experience in both TV and digital advertising sales will be a plus","A degree of people management experience is preferableStrong analytical (strategic and creative) capabilities and judgement.","Excellent communication and presentation skills.","Ability to work effectively and collaboratively cross-functionally.","Open to the challenge of starting a new business, comfortable with risk, uncertainty and ambiguity. Autonomous","A passion for entertainment and our product will be a +"]}],"location_emoji":"🇫🇷"}