{"title":"Security Engineer (L4) - GRC","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"2","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["GRC","Security Engineering","Risk Management","Automation","Compliance","Metrics","Data Analysis"],"skills":[""],"overview":"The Security Engineer (L4) - GRC position at Netflix involves building and implementing automation for regulatory and compliance activities, improving reporting and metrics within GRC, integrating GRC systems with stakeholders, and promoting the relevance of security controls for business value. The role requires knowledge of large data handling, systems integration, and various regulations and controls, as well as skills in scripting languages, RESTful API, AWS infrastructure, and data analysis techniques. Strong attention to detail, inclusivity, autonomy, communication, and cross-functional collaboration are essential.","description":"At Netflix, we have a strategic bet to build and bring engineering to GRC. We believe that this bet will improve our speed of trust within the business, increase our coverage, and enable our partners to focus on the work that supports business outcomes and values. The STAR team sponsors, influences, and facilitates the environment of trust and transparency necessary for Netflix to achieve its business goals. The team consists of GRC, Enterprise Continuity, and Assurance activities. The constant rate of change within our engineering environments and business environments puts us in a position to design and implement new ways to solve these activities at scale. This role will impact key stakeholders such as Legal, HR, Security Engineering, and Finance to name a few.\n\nTo support our investment in this space, we need to take smart risks, and you will enable Netflix to lean into those smart risks by building out this foundational program. We are looking for thoughtful, risk-oriented professionals to enable our mission and support our inclusive culture. In this role, you will help establish and execute a broad strategic vision for the risk program at Netflix. You will not only work within the team but also cross-functionally with various teams across the organization. \n","requirements":[],"extras":[{"title":"Our organization is looking for a new team member to:","content":["Design and implement automation for key regulatory and compliance activities","Challenge and expand our thinking surrounding engineering and GRC","Improve our reporting, metrics and assurance within GRC and with our stakeholders","Promote and demonstrate the relevance and importance of security controls and how they provide business value","Expand the utilization of our GRC Platform within the business","Integrate GRC systems with cross-functional stakeholders to ensure accuracy and consistency","Contribute to improving our continuous improvement activities including integrating best practices for GRC systems"]},{"title":"You are excited about this opportunity because…","content":["You are enthusiastic about bridging the gap between GRC and Engineering","You have demonstrated knowledge of large data handling and systems integration","You have knowledge of various regulations and controls (SOX, PCI, CCPA, GDPR, etc)","You are excited about developing and growing our GRC Engineering capabilities","You can share impact through visualization and BI tools (Tableau, etc.)","You have a passion for risk management, information security, metrics, efficient security operations, and effective control designs","Visualizing GRC data for people to consume and use effectively is something you are good at doing"]},{"title":"To be successful in this role, we are looking for individuals that…","content":["Can develop scripts in various scripting languages (Python, Go, etc.) and peer review code / implementation / automation scripts","Familiarity with RESTful API","Have familiarity with AWS infrastructure","Can connect the dots around the business value of control automation, testing, and effectiveness","Operate within an environment of ambiguity and create clarity","Participate in risk management, decision-making, and collaborative discussions","Can communicate with clarity (written and verbal)","Understand relevant data collection, data cleaning, and data analysis techniques","Utilize your experiences to help drive changes within our programs","Develop templates and instructional materials to help your fellow team members","Monitor and identify opportunities to improve the effectiveness and quality of our program","Manage and execute against key deliverables"]},{"title":"Core value skills - must-have","content":["Attention to detail","Inclusivity","Broad knowledge of how to operationalize the management of risk as a part of regular workflow","Autonomously drives work delivery (bias to action)","Strong communication (technical, status/blockers, cross-functional)","Cross-functional collaboration"]}],"location_emoji":"🇺🇸"}