{"title":"Senior Editorial Insights Content Analyst - Korea","location":["Seoul, South Korea"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Content Analysis","Metadata Enhancement","Classification","Visual Media","Cross-functional Collaboration","Korean Entertainment","Data Management"],"skills":["data analysis","metadata","content analysis","tagging","rating","data-driven","visual media"],"overview":"The Senior Editorial Insights Content Analyst - Korea role at Netflix is responsible for objectively analyzing, tagging, and researching movies and series to enhance metadata, while also understanding the underlying creative intent and strategic positioning of business-critical titles. The ideal candidate has a deep knowledge of global entertainment, is comfortable working in a data-driven environment, and possesses excellent verbal and written communication skills.","description":"The Opportunity:\n\nFrom “Healing Romance” to “Family-Friendly Variety Shows,” the system that powers Netflix’s multitudes of personalized row recommendations is the result of years of painstaking content analysis, intricate taxonomical work, data science, and pure movie and television geekery.\n\nIf you are an avid fan and a serious consumer of visual entertainment, the Editorial Creative team at Netflix is seeking a unique candidate who can capture the essence of movies, series, and specials — and turn that into data and information. This starts with digging deep into every assigned title, researching, tagging, rating, and enhancing other pieces of metadata that will help connect our members to the content they’ll love. \n\nThis role will join a team of classification experts: people who can identify, collect and transform the artistic qualities of movies and series into the data that powers personalization for more than 240 million people around the world. This hire innately understands the facets, tropes, and themes that allow audiences around the world to laugh, think, escape, cry, and tell their friends, “You have to watch this.” \n\nThe ideal candidate has a deep and broad knowledge and experience of visual media and is passionate about global entertainment. They can succinctly and broadly communicate what’s important about a piece of content, and why. They are comfortable working in a high-volume, high-quality, deadline- and data-driven environment. They are an excellent cross-functional partner who can relay the importance of this work to colleagues beyond your team, as well as collaborate on unique projects that use tags, metadata, and content insights in new and engaging user experiences on the Netflix service. \n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Objectively analyze, tag, research, and write about movies and series with attention to detail, while also understanding the underlying creative intent","Serve as an ambassador for our business-critical titles, digging deep into the content while owning strategic positioning in tags, rows, etc.","Meet tight, dynamic deadlines in a fast-moving, professional environment and assure the highest quality of output","Develop an understanding of Korean content and the content and successfully interpret the business strategy for the region","Multitask, self-direct, and self-manage day-to-day aspects as well as other editorial and innovation projects including A/B tests that require cross-functional collaboration","Keep their finger on the pulse with regard to current affairs and cultural moments, while also being aware of historical, political, social and/or sensitive issues from across the region","Possess excellent verbal and written communication skills, including presentation skills, especially with core cross-functional partners","Represent and advocate for the core Editorial Creative team, while also building successful partnerships in region","Master internal tools and systems successfully"]},{"title":"Qualifications:","content":["At least 8 years of experience in similar roles in entertainment or other media","Passionate about Korean content with a deep knowledge of the global streaming and Korean entertainment landscape","Knowledge of and passion for content and new media trends, including other entertainment platforms","Strong leadership, time management, and communication skills","Leadership experience managing teams or individuals is a plus","Ability to distinguish nuances within different movie and TV genres and distill the essence of a film/series, including sharing findings in an objective, concise manner","Experience demonstrating excellent cross-functional skills in previous roles, including presentation skills","Strong time management and communication skills","Knowledge of and curiosity for product a plus","Experience working with large data catalogs is a plus","Fluency in Excel, Airtable, Google Sheets, or other data trackers and data management systems is a plus","Full professional fluency in English is required","Fluency in Korean required"]}],"location_emoji":"🇰🇷"}