{"title":"Senior Concept Artist - Games Studio","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Concept Artist","Games Studio","Mobile Game Titles","In-Game Assets","Character Art","Environment Art","Illustration","2D Illustrations","Storyboards","Brand Identity","Outsourcing","Iconography","Stakeholder Collaboration","Leadership","Adobe Creative Suite","Microsoft PowerPoint","Digital Painting","Marketing Assets","Competing Tasks","Communication Skills","Organization Skills","Feedback","Mentoring","Motion Design","After Effects","Spine","Mobile Gaming Industry","Creative Studio Environment","Process Documentation","Composition","Color Theory","Visual Branding","Marketing Campaigns","Marketing Mediums","Web Graphics","Social Media","Ad Creatives","Photography","Posters","Videos"],"skills":["Adobe Creative Suite","Microsoft PowerPoint","digital painting","After Effects","Spine","composition","color theory"],"overview":"The Senior Concept Artist will create compelling concepts and polished in-game art for mobile game titles, working closely with internal and external teams to create character and environment art.","description":"The Senior Concept Artist will create compelling concepts and polished in game art for our mobile game titles. You will work as part of the creative team responsible for crafting in-game assets for existing and new titles. You will work closely with both internal and external teams to create character art and environment art.\n","requirements":[],"extras":[{"title":"Essential Functions/Responsibilities:","content":["Illustrate, and compose highly effective art assets following IP specific brand and in- game style guidelines.","Create custom illustrated player facing key art that accomplishes the vision, mission, and high level goals of the product.","Play a key role in defining the look and feel of the brand with a clear and distinctive visual identity that aligns with the goals of the product and tell a story.","Ensure all campaigns and assets truly capture the marketability of the visual design of the games.","Concept new and original ideas, and render 2d Illustrations.","Generate story boards to communicate ideas and provide direction to the wider team.","Illustrate concept art that can inform outsourcing for character and environment asset creation","Illustrate iconography to support motion graphics efforts.","Communicate and collaborate with various stakeholders on both the game product team and IP stakeholders to ensure that the visual identity of our brand is aligned.","Lead by example, creating a strong sense of purpose and community, and promoting a culture of excellence.","Exemplify reliability, accountability, and professionalism in all work-related interactions."]},{"title":"Skills and Abilities:","content":["Highly proficient in Adobe Creative Suite, as well as Microsoft PowerPoint.","Excellent ability to create high quality promotional assets in various styles.","Expert in digital painting with ability to perform marketing and player facing polish.","Able to manage multiple, competing tasks and be self-directed in a quickly evolving environment with little direction.","Excellent communication, organization, and leadership skills.","Collaborative team centric focus with an excellent ability to deliver and receive constructive feedback.","Ability to mentor and inspire artists in the same discipline.","Motion design knowledge in After Effects or Spine is a big plus."]},{"title":"Education and Experience","content":["10 years of experience with a mobile gaming company or related creative studio environment.","Experience documenting processes.","Great understanding of composition and color theory.","Working knowledge of graphic/visual/stylistic trends in art, film, and games.","Strong understanding of visual branding and IP in the context of marketing campaigns.","Well versed in a wide range of marketing mediums such as web graphics, social media, ad creatives, photography, posters, and videos."]}],"location_emoji":"🇺🇸"}