{"title":"Senior Indirect Tax Analyst","location":["Amsterdam, Netherlands"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"The Senior Indirect Tax Analyst position at Netflix in Amsterdam entails collaborating with cross-functional stakeholders to manage indirect tax risk and ensure compliance, engaging with local governments and international tax policy agencies, and working on global tax projects with the EMEA, APAC, LATAM, and US tax teams.","description":"Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time\n\nWe are looking for a talented team member to join the EMEA Tax Team in Amsterdam. You will report to the EMEA Senior Indirect Tax Manager and will be working closely with the rest of the tax and finance teams in Amsterdam, as well as various other stakeholders globally. \n\nThe ideal candidate has a strong connection with Netflix values and culture, can collaborate well across the organization and has a hands-on mentality. This role will have a focus on supporting and driving indirect tax projects, running policy engagements, controversy management and working on global cross-functional projects to manage risks and support the business pro-actively. This is a great opportunity to work in an exciting entertainment technology company, get exposure to global indirect tax matters and work with a diverse, talented bunch of colleagues.  \n\nRelevant experience in the areas mentioned will be a key when applying for the role. \n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Work with cross-functional stakeholders to manage indirect tax risk and ensure compliance while having a business-centric perspective;","Engage with local governments and international tax policy agencies;","Work with the EMEA, APAC, LATAM and US tax team on global (indirect) tax projects. Collaborate with finance and legal teams.","Assist with our team’s risk and compliance process."]},{"title":"Qualifications:","content":["5+ years of relevant experience (law firm, public accounting and/or industry)","Law degree or CPA equivalent, and/or advanced degree in Taxation","Excellent knowledge of International Indirect Tax, preferable for both services and goods","Excellent stakeholder management skills","Excellent communication skills (fluent in English; fluency in another European language would be an extra bonus)","Strong analytical capabilities and judgment","Creative, innovative and curious","Ability to work proactively and independently under tight timeframes in a fast-paced environment","Ability to travel"]},{"title":"Relevant experience (valued extra):","content":["Technology/entertainment industry","Policy engagements","Project management","Managing controversy"]}],"location_emoji":"🇳🇱"}