{"title":"Senior Manager, Consumer Product Security Engineering","location":["Remote, California"],"attendance":["Remote"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"The Org: \n\nIf you’re a Netflix customer, you have benefited from the work of the Consumer Product Security & Trust organization. We are responsible for securing the Netflix consumer ecosystem, including laptops/desktops, phones/tablets, Smart TVs, game consoles, set-top boxes, and streaming sticks for all of our consumer-facing products including streaming and gaming, impacting over 200 million members, however they may choose to enjoy Netflix.\n\nWe are responsible for designing and implementing security-related features in devices and cloud services while preserving a trustworthy and best in class Netflix customer experience. Our team is highly cross functional, inside and outside of Netflix, encompassing external device partners and chip manufacturers to security solution providers to internal cloud and product engineering teams. Much of our work is accomplished through influence, not mandates. Critical to our success is a collaborative mindset, from this leader and throughout our teams.\n\nThe Team:\n\nThe Consumer Product Security Engineering team is responsible for the foundational security elements on devices, their apps, and backend systems. We work in close collaboration with client engineering teams to integrate security elements, and alongside product engineering teams on the security solutions used by our consumer-facing products and experiences. As leader for this time, you will use your background in security while leveraging the strong technical expertise of the team in the areas of:\n\n● Cryptography\n● Direct security integrations on mobile clients, game consoles, and browsers\n● Secure transport between clients and services, including network authentication and confidentiality (e.g., TLS and SSL), their implementation across various standards, and the various ways they can be attacked and defended\n● Secure user authentication (AuthN) and Authorization (AuthZ) services\n● Robust foundational security design and solutions\n● Vulnerability assessment, management, and remediation\n● Mobile, browser, game console, and 10’ (TV, Set Top Box) devices, operating systems and applications\n\nWith the growth of Netflix consumer products to include new verticals such as Games, Live and Ads, we are evolving our solutions to support the unique needs of additional consumer facing solutions, reflecting unique requirements for transported data and integrations. The solutions we build reflect operational constraints (e.g., latency, space capabilities), and device limitations (e.g., root of trust, storage limitations, crypto capabilities). \n\nTo learn more about Consumer Product Security & Trust at Netflix, check out this episode of the WeAreNetflix podcast.\n\nThe Role:\nWe are looking for a senior security leader to work alongside their security peers to set direction for Netflix’s engineered security solutions and integrations. Defining our forward-looking strategy for the evolving Netflix consumer product space is a highly visible endeavor that impacts our large subscriber base and is informed by collaborative work across Netflix product verticals. This strategy will be informed by fundamental concepts, including the complexity of security integrations, the impact of security protocols, and end-to-end risk analysis and shaped by the uniqueness of our industry. It will also require a leader experienced with shaping and creating security teams, as this role will require you to hire at least one leader as well as security software engineers.\n\nTo be successful in this role, you will bring a pragmatic approach to product security and understand security/business tradeoffs, along with a strong security background. We aren’t even close to seeing, let alone solving, all of the challenges we face, and you will have a significant impact. Our subscriber base is growing fast, and so is our opportunity!\n\n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Leadership: You will be part of the Consumer Product Security & Trust senior leadership team, responsible for fostering a collaborative approach to setting strategy for the organization, including a focus on operational health and communication","Team Lead: You will lead two different functional areas, where you and your leaders will focus on team building & ensuring excellent talent density: recruiting, evaluating, coaching, celebrating","Partnership: We don’t work in isolation. Collaborating with other internal teams to set strategy, prioritize, and identify how we can all work best together requires selflessness and curiosity","Strategy: You will set the strategy for the engineered solutions Netflix uses to scalably address security for the consumer product. Defining the shape of your org, and how the teams who report to you work together will be a critical element of your role. You will define how those teams set objectives and strategy as well, with context from the broader consumer engineering organization, determining and championing longer term team direction and technology strategy","Execution: We can’t just set strategy. Our teams need to establish a plan and deliver on it, iterating and improving the plan along the way. With awareness and engagement in these efforts, you can offer your industry expertise to the teams, and also take lessons back to your peers about how we might improve the overall organization","Communication: As Netflix grows, our need for strong communication becomes increasingly important. It is critically important that your partners understand why we do things and that your teams understand how their work impacts our business"]}],"location_emoji":"🌍"}