{"title":"Senior Product Designer, Partner Platform","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"8","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Design","Partner Platform","Netflix","Lead Designer","Global Partnerships","Apps","Tools"],"skills":[""],"overview":"A highly ambitious and experienced lead-level Product Designer is sought to enable a best-in-class Netflix platform experience for global partnerships, leading design for a pillar of Netflix's Partner Enablement Platform XD team.","description":"The Role\nAt Netflix, we aspire to entertain the world and are constantly innovating on how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 240 million paid members.\n\nWe’re looking for a highly ambitious, energetic, and experienced lead-level Product Designer who will enable a best-in-class Netflix platform experience for our global partnerships. You will lead design for a pillar of Netflix’s Partner Enablement Platform XD team, and be a strategic partner to our stunning product, engineering, and business colleagues to build the apps, tools, and services that scale Netflix’s global presence through partnerships. \n\nThis will be a remote-friendly role with the freedom to set your own work-from-home schedule.  There will be times where the team will meet onsite in Los Gatos/Los Angeles for meaningful moments of collaboration and bonding. We want you to be happy and have a work-life-balance that enables you to thrive!\n\n\nMore About Our Team\nOur team designs the enterprise ecosystem that scales Netflix entertainment through our global partnerships with telecoms, device manufacturers, game studios, advertisers, and data centers.  We also design the foundational capabilities and technology for the next-generation of Netflix experiences, like games. Our team’s primary superpower is the ability to design creatively and collaboratively in highly technical environments – from core services that power Netflix messaging to industry-leading partnership platforms. You’ll be one of the lead designers who crafts the apps, tools, and services that enable these experiences and partnerships.  More specifically, you’ll be a critical part of one of the most talented and trailblazing enterprise design teams in the world.\n\nScaling to connect Netflix with 240+ million people in 190 countries with movies, TV series, games, and interactive experiences requires strategic partnerships and high-quality product integrations. Ever wonder about the Netflix button on new TV remotes or how the Netflix app is always ready when you boot up your new device? Or how Netflix is now an option that can be added to your cable bundle? \n\nNetflix works closely with a variety of partners such as Google, Samsung, Amazon, and regional partners like Comcast and Sky to integrate and launch Netflix applications on their devices. You’ll be the lead designer who crafts the apps, tools, and services that enable these experiences and partnerships.  You’ll play a critical role in delivering the joy of Netflix to the world!\n\n","requirements":[],"extras":[{"title":"Why You’ll Love Our Team","content":["Work with stunning, supportive designers on problems that matter.","We’re big on individual responsibility and smart on process.","Top of market compensation and benefits, flexible time off, and work-life-balance.","Flexibility to balance work-from-home and in-office work, so long as you’re able to be onsite for meaningful moments of collaboration with your cross-functional team and stakeholders.","Freedom and flexibility to craft your own design workflow, while harnessing Netflix’s world-class design system and tooling.","Meaningful financial support for further education and professional growth.","An inclusive environment to help you do your best work and feel genuinely supported."]},{"title":"What You Will Do","content":["Lead the design and execution of enterprise experiences that power Netflix’s partner experiences that enable:","Netflix to be streamed on any device, anywhere","Experiences in device homescreens","Partnerships with the world’s biggest brands","Identify, research, and drive strategic partner initiatives that enable next generation experiences","Craft design briefs that provide business, design, and engineering clarity for critical initiatives.","Collaborate with engineers, product managers, data scientists, tech writers, and business teams to develop and iterate upon new concepts and facilitate product execution."]},{"title":"What You Will Bring","content":["A passionate energy for great design that amplifies our team culture","8+ years as a Product Designer (or equivalent experience) in a B2B or B2B2C space, leading high-impact initiatives from concept to execution in technical business areas.","Experience working in technical systems, expertise in reducing complex problems down to the right balance of flexibility, power, and ease of use","A versatile portfolio that showcases your problem solving skills, that highlights strong experience designing across products, platforms and personas.","Experience working with design systems and are able to identify and extend shared patterns and behaviors"]},{"title":"Even Better:","content":["Experience working with complex enterprise systems, data platforms, and technical environments.","Experience leading design strategy for enterprise platform initiatives (e.g. influencing product direction through the lens of experience design)."]}],"location_emoji":"🇺🇸"}