{"title":"Senior HRBP, Marketing, PR & Studio Ops - APAC","location":["Singapore, Singapore"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["HRBP","Marketing","PR","Studio Ops","APAC","Strategic Business Partnership","Regional Connector","Talent Management","Organization Health","Complex Case Management"],"skills":["Strategic Business Partnership","Regional Connector for Talent partners across the region","Talent Management","Organization Health","Complex case management/leaves of absence/health and safety","Strong business acumen","Demonstrated learning agility and adaptability"],"overview":"The Senior HRBP for Marketing, PR & Studio Ops - APAC at Netflix will provide guidance, coaching, and advice to leaders and employees, drive organization design decisions, increase manager capability, and execute strategic talent initiatives across the APAC region.","description":"Netflix is the world’s leading streaming entertainment service with over 238 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films, and mobile games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \n\nAs Netflix continues to evolve and the complexity of our organization grows, we are looking for a Senior HR Business Partner (HRBP) to be based in our Singapore office. Our HRBPs are the primary partners providing guidance, coaching and advice to people and organization leaders and the wider employee population. They are responsible for partnering with leaders to drive decisions related to organization design, compensation, employee development and act as the frontline consultants in support of talent management practices within the Talent team (onboarding, performance management, development, team health, and facilitating understanding and application of Netflix unique culture). A key area of focus for the HRBP is to increase manager capability, to increase organizational health and drive high performance, driving manager education on important people programs, tools and processes. \n\nThe Opportunity\nThis role will be the HRBP to the Vice President, Marketing - APAC, Vice President, Public Relations/Comms (PR) - APAC and the APAC Studio Operations team. The person in the role works in close collaboration with the global HRBPs for each function and assumes a connector role with HRBPs in the country-level markets to support the execution of talent priorities. The ideal candidate will be a thoughtful and collaborative HR leader who has comfort with ambiguity and can think creatively about solutions. \n\n","requirements":[],"extras":[{"title":"Key Responsibilities","content":["Strategic Business Partnership: This role will act as a strategic talent partner for APAC Marketing, PR and Studio Operations’ leaders and will partner with them to translate their business goals to people priorities in the region.","Regional Connector for Talent partners across the region: The role will work closely with APAC country HRBPs to plan and execute strategic talent initiatives in our key country markets (Japan, Korea, India and SEA). As the regional connector for APAC, this role will also work closely with the global HRBP counterparts to understand the context of the global organizational priorities for APAC and surface the nuances of the APAC markets to their global partners.","Talent Management: Drive key talent management programs anchored on capability building for leaders and managers, improving talent density and building a sharper inclusion lens.","Organization Health: Assess employee sentiment and partner and coach people leaders to improve overall team effectiveness and org health.","Complex case management/leaves of absence/health and safety: Taking the lead on employee/employee relations matters in partnership with the Employment Legal and Employee Services team (e.g. performance management, terminations & exits, long term disability, Leaves of Absences, etc.)"]},{"title":"Profile/Experience","content":["Min. 10-15 years of relevant Human Resources experience primarily in a HRBP role.","Strong business acumen with a passion for our business and driven to accomplish and meet business objectives. Previous experience supporting marketing, PR and/or sales teams is an advantage.","Demonstrated learning agility and adaptability.","Demonstrated stakeholder management and influencing skills - especially with senior leaders.","Demonstrable experience in coaching and consulting in a high performance culture.","Strong HR capabilities including sophisticated problem solving skills, good judgment, critical thinking and analysis.","Fluency on inclusion and diversity and its application in APAC.","Strong communication skills; excellent spoken and written English.","Experience working in a highly matrixed, global organization is an advantage.","Project management and execution skills.","Possesses intellectual curiosity; brings insight into the team & business."]}],"location_emoji":"🇸🇬"}