{"title":"Shipping and Receiving Specialist - ABQ","location":["Albuquerque, New Mexico"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":["Shipping and Receiving","USPS","UPS","DHL","FedEx","Mail Services","Shipping and Receiving teams"],"overview":"","description":"We are seeking a Shipping and Receiving Specialist to join our growing Studio Management and Services team. This position will be housed in Albuquerque, New Mexico. The position will be responsible for managing the incoming/outgoing mail and packages for the site.\n\nThe Opportunity\nNetflix is one of the world’s leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anywhere, and can change their plans at any time. \n\nThe Role\nA successful candidate will be passionate, self-motivated, proactive, quick-thinking, flexible, able to pivot when necessary, thorough and able to manage multiple and diverse responsibilities with a strong emphasis on organization and unwavering attention to detail at all times. This is a demanding and fast-moving position that requires someone who is a proactive and positive thinker, and able to use good judgment and communication. \n","requirements":[],"extras":[{"title":"Responsibilities","content":["Lead the Shipping and Receiving team","Build/execute a shipping and receiving strategy","Build relationships with Shipping/Receiving Vendors","Receive, sort and deliver all mail and packages according to established time frames and service standards","Coordinate messenger services and deliveries","Answer telephone and in-person inquiries","Perform general clerical duties including but not limited to ordering supplies, placing service calls for equipment, filing, record keeping and photocopying","Provide an outstanding customer service experience by finding solutions that meet customer mailing and shipping needs","Prepare and ship freight shipments, domestic and international mailings, and confirm all documentation requirements","Process incoming and/or outgoing USPS, UPS, DHL and FedEx packages utilizing postage meters, scales, presort mail, certified mail, etc.","Enter recipient and sender info into the appropriate shipping system using USPS, UPS, DHL and FedEx etc.","Affix postage and shipping labels to outgoing mail and shipments, maintain records on postage and shipments","Ensure shipments and mailings go out on time daily","Maintain accountability using an internal package tracking system on shipping and receiving transactions, including receiving customer signatures for received packages","Organize and maintain mail, packages and various parcels etc. for delivery and shipment, ensure that all items can be quickly retrieved","Identify and inspect mail, envelopes, packages and other items for damage, notifying Supervisor as needed","Any other shipping and receiving related duties to support the productions","Prepare daily and monthly reports as needed","Perform other duties as needed including coverage for other Admin Services departments or job functions"]},{"title":"Qualifications","content":["5+ years experience in entertainment-specific campus","Prior experience in Mail Services or Shipping and Receiving teams","Maintain a working knowledge of all USPS, UPS, DHL and FedEx regulations","A polite and friendly attitude with the ability to work with all co-workers, staff and customers, performing all duties in a professional, positive manner with a can-do attitude","Proficient in operating all equipment and all mailing and shipping platforms","Ability to create and implement standardized operating procedures","Ability to be discreet and handle confidential information","Ability to move between narrow, confined, or elevated spaces, over sloping, uneven, or slippery surfaces and steps; ascend/descend stairs, service ramps, and elevators","Ability to repetitively move and transport up to 50 lbs","Ability to operate computers, mobile devices, mailing and shipping equipment/software (scales, meter machines, etc.)","Strong sense of confidentiality for company and customer information, data and materials","Ability to operate in a dynamic, fast-paced, demanding startup environment","A team player, with the ability to work well with others in a group environment","Ability to train across multiple job functions","Proficiency in Google Docs, Sheets, Gmail, Gdrive, MS Word, Excel. AirTable a plus","Strong written and verbal communication skills","Ability to readily adapt to changing requirements"]}],"location_emoji":"🌍"}