{"title":"Site and Services Coordinator - ABQ","location":["Albuquerque, New Mexico"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"","description":"We are seeking a Studio Site and Stage Coordinator to join our growing Studio Management and Services team. This position will be housed in Albuquerque, New Mexico. The position will be responsible for supporting the Site and Services team that oversees the ABQ studio facility. \n\nThe Opportunity\nNetflix is one of the world’s leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anywhere, and can change their plans at any time.\n\nThe Role\nA successful candidate will be passionate, self-motivated, proactive, quick-thinking, flexible, able to pivot when necessary, thorough and able to juggle multiple and diverse responsibilities with a strong emphasis on organization and unwavering attention to detail at all times. This is a demanding and fast-moving position that requires someone who is a proactive and positive thinker, and able to exercise good judgment and communication. \n","requirements":[],"extras":[{"title":"Responsibilities","content":["Support day-to-day facility operations","Support facility repair and maintenance programs","Fulfill client repairs and maintenance requests","Responsible for delivering excellence in customer service","Accustomed to working in a fast-paced environment, able to multitask, and meet multiple tight deadlines","Any other duties to support the productions and department","Create a positive atmosphere of professionalism and support"]},{"title":"Qualifications","content":["3+ years experience working on a campus environment and in facilities management.","Must have a strong knowledge of facilities activities","Must have Building Maintenance System (BMS) experience","Must have Mechanical, Electric and Plumbing (MEP) repair and maintenance experience","Understanding of GeoThermal and Solar energy a plus","OSHA 10 or 30 certificate required","Strong understanding of EHS regulations and best practices","Team player with the ability to oversee projects in a fast-paced environment","Self-starter with the ability to prioritize and respond accordingly","Great communicator who can build strong working relationships with vendors, and internal and external partners","Ability to be discreet and handle confidential information","Ability to move between narrow, confined, or elevated spaces, over sloping, uneven, or slippery surfaces and steps; ascend/descend stairs, service ramps, and elevators","Ability to repetitively move and transport up to 50 lbs","Willingness to continue learning to ensure understanding of current production process and equipment and studios","Strong written and verbal communication skills","Proficiency in Google Docs, Sheets, Gmail, Gdrive, MS Word, Excel. AirTable a plus","Willingness to take educated risks and think out of the box"]}],"location_emoji":"🌍"}