{"title":"Software Engineer (L4) - Platform Modernization","location":["Los Gatos, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"4","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Platform Modernization","Full Stack","Automation","Tooling","Software Change Campaigns","Engineering Leadership","Product Management"],"skills":["Java","Python","Go","Javascript","microservices","distributed systems","high availability"],"overview":"The Software Engineer (L4) - Platform Modernization position at Netflix involves building and managing scalable automation to improve the migration experience for customers, collaborating with teams to execute software change campaigns effectively, and identifying opportunities to increase development velocity and reduce total cost of ownership.","description":"At Netflix, we aspire to entertain the world. We deliver billions of hours of movies and TV shows per month to more than 230 million members in over 190 countries. It’s an amazing time to be joining Netflix as we continue to transform entertainment.  \n\nWithin the Platform Engineering organization at Netflix,  the Modernization Engineering team’s mission is to enable Netflix engineering teams to rapidly build and create innovative experiences by making infrastructure changes transparent. We are the central team responsible for evangelizing evolution in our tech stack to provide a safe, healthy and efficient software ecosystem.  We identify and drive product adoptions and software changes for the fleet of infrastructure and services spanning the company. Collaboration is core to our team's identity. We work closely with our engineering teams across the company to accelerate their adoption of new products and deprecation of old products.  \n\nWe are hiring full stack engineers to build and manage scalable automation to improve the migration experience for our customers. We are looking for generalizing specialists who have the aptitude and agility to work on a broad spectrum of applications with passion.\n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Partner with other teams in Platform Engineering organization to deeply understand the current product suite, customer personas, usage patterns, on-ramp and off-ramp flows.","Collaborate closely with customer teams and explain the value proposition and technical requirements of change campaigns, understand their use case scenarios and software ecosystem to create tailored strategies to execute software change campaigns effectively","Develop and maintain automation and tooling to effectively plan, gather insights and execute change campaigns through completion","Partner with a cross functional team of stakeholders from Engineering Leadership, Product Management and Technical Program Management to identify future high leverage opportunities to increase development velocity at Netflix and reduce total cost of ownership"]},{"title":"Requirements:","content":["4+ years of previous experience in a Software Engineering role","Professional level proficiency in Java, Python, Go or Javascript","Experience developing and operating services receiving high scale traffic","Deep understanding of microservices based distributed systems architecture with high availability","Exceptional collaboration and communication skills and a product centric mindset","Bias to action to deliver outcomes in partnership with customer teams"]}],"location_emoji":"🇺🇸"}