{"title":"Software Engineer (L4) - Consumer Engineering","location":["Remote, United States"],"attendance":["Onsite"],"type":["Pipeline"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Software Development","Object-Oriented Programming","Efficient Code","Maintainable Code","Testable Code","Computer Science","APIs"],"skills":["object-oriented programming","efficient","maintainable","testable code","computer science","software development","development lifecycle","APIs","distributed systems","cloud-based services","self-driven","prioritize effectively","clear communication","kindness"],"overview":"A distributed systems engineer is needed to work on core backend systems impacting API platform, messaging, personalization, sign-up, partnership, payments, and billing systems at Netflix, solving complex problems with real world impact in a highly-available, complex distributed systems environment.","description":"At Netflix, we want to entertain the world and are constantly innovating on how entertainment is imagined, created, and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 220 million paid subscribers, and are expanding into new forms of entertainment such as gaming. Engineering teams within Netflix work hard every day to scale and innovate this content production and member experience in an ever-growing complex software landscape.  \n\nWe are looking for distributed systems engineers to work on many of our core backend systems that directly impact our API platform, messaging, personalization, sign-up, partnership, payments, and billing systems. \n\nAs an engineer in this function, you will be applying your software development skills to solve complex problems with real world impact. You will be learning and contributing to scalable, highly-available, complex distributed systems powering the most sophisticated entertainment service in the world.\n\nDoes this sound like something you’d like to do? Awesome, let’s talk specifics.\n","requirements":[],"extras":[{"title":"What we need from you","content":["You are skilled in object-oriented programming and take pride in crafting efficient, maintainable and testable code. You have a solid foundation in computer science and software development concepts.","You are able to work independently and drive features or components throughout the development lifecycle - from identifying requirements to launching in production.","You have exposure to the development, debugging, testing and operation of APIs, distributed systems, and cloud-based services.","You are self-driven, prioritize effectively, and focus on impact.","You communicate clearly in written and verbal form.","Your co-workers think of you as someone who is kind and does excellent work."]}],"location_emoji":"🇺🇸"}