{"title":"Software Engineer 5 - Operational Data Infrastructure","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Backend Software Engineer","Reporting Infrastructure Services","Java","Backend Programming Languages","Testable Applications","Concurrency","Event-driven Architecture"],"skills":["Java","Go","Python","Node.js","concurrency","parallelism","event-driven architecture"],"overview":"The Software Engineer 5 - Operational Data Infrastructure position at Content Infrastructure & Solutions (CIS) involves shaping and building next-generation reporting infrastructure services and tools, driving technical strategy, and creating technical solutions at scale.","description":"Content Infrastructure & Solutions (CIS) empowers engineers working on content and studio applications to be innovative and agile in supporting our massive global content production needs. Infrastructure pieces like very large-scale media processing platforms (1, 2), workflows (conductor), media asset management, collaboration, reporting, data movement and data processing are some of the key services we build. All this is custom-built on top of Amazon Web Services (AWS) infrastructure. \n\nThe Operational Data Infrastructure (ODI) is a part of the CIS organization–which provides infrastructure services that simplify discovering and accessing data produced across the Studio & Content applications, catering to both technical and non-technical end-users, and making operational reporting easier and more efficient. Currently, the core service to enable a highly leverageable reporting infrastructure is in a proof of concept phase. This presents a great opportunity to be a part of building and shaping such novel and high-impact foundational services at Netflix. The ODI team also owns other mature applications which serve specific reporting needs and their usage help inform the design and implementation of new services. \n\nAbout the role\nWe are looking for a Backend Software Engineer 5 to help shape and build next-generation reporting infrastructure services and tools. In this role, you will have the opportunity to drive technical strategy and direction, own development end-to-end, manage stakeholder relationships, provide actionable feedback and insights to colleagues, and create technical solutions at scale. We are looking for a problem-solver who delivers well-tested, maintainable, performant, and predictable implementations.\n\n","requirements":[],"extras":[{"title":"You’ll be successful in this role if you:","content":["Enjoy collaborating with teammates and technical cross-functional partner teams and have excellent communication skills","Take end-to-end ownership of major features and components from design to deployment to continuous improvements and maintenance.","Have a strong demonstrable knowledge in backend programming languages (eg. Java, Go, Python, Node.js)","Build testable, highly-available applications and services with monitoring and alerting","Have a good understanding of concepts like concurrency, parallelism, and event-driven architecture.","Demonstrates proactiveness in learning new technology and building new partnerships to identify opportunities for the team.","Comfortable with navigating ambiguity and able to form strategy/direction and plan for greenfield an/or complex problem space.","Passionate about improving data discovery and accessibility."]},{"title":"Nice to have:","content":["Experience with technologies such as Spring, GraphQL, and RDF","Experience with automatic SQL query generation and relational algebra"]}],"location_emoji":"🇺🇸"}