{"title":"Software Engineer (L5), GX Foundations","location":["Los Gatos, California"],"attendance":["Hybrid"],"type":["Full-time"],"experience":"6","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Node.js","GraphQL","Data platform","TS/GraphQL-based API","UI","backend","API development"],"skills":["GraphQL","API development","JavaScript","TypeScript","large-scale systems","communication skills","UI engineer"],"overview":"The software engineer in the GX Foundations team will be responsible for developing and maintaining the Node.js-based Web platform and GraphQL-based API Data platform, collaborating with backend and UI engineers to build a scalable TS/GraphQL-based API system that powers the commerce UI experience across various devices, and setting a long-term technical strategy for the Netflix commerce platform.","description":"The Team\nHave you ever wanted to be a part of something bigger? To have a meaningful impact felt not only by hundreds of engineers, designers, and product managers but over 230 million members from around the globe? When you join the Growth Experience Foundations (GXF) team, you’re joining the team that sets the technical strategy and vision for the commerce platform that powers a 200 billion dollar company. \n\nOur team owns and operates the infrastructure and Web platform which hosts all applications on Netflix.com. We also develop and maintain the tooling and infrastructure for the API Data platform that powers the growth and commerce UI for all of Netflix. The nature of a platform team means we wear many hats. From developer experience to tooling to support, engineers on GXF are experienced multifaceted operators skilled in a variety of disciplines all the way from the top of the UI stack to the bottom infrastructure layer. \n\nThe Role\nAs we focus on developing and maintaining both the Node.js-based Web platform and the GraphQL-based API Data platform, we’re looking for an experienced software engineer to help build a Data platform to accelerate experimentation while reducing risk and safeguarding privacy. You’ll collaborate with both backend and UI engineers to design and implement a scalable TS/GraphQL-based API system that powers the commerce UI experience across web, TV, Android, and iOS devices. You’ll also architect and develop a rendering engine for server-driven UI and partner with engineers to optimize the tooling and overall developer experience. \n\nAlong with solving complex engineering problems, you will lead projects and help set a long-term vision and technical strategy for the broader Netflix commerce platform with a focus on scale and interoperability with the Web platform.\n","requirements":[],"extras":[{"title":"Skills & Qualifications","content":["6+ years of professional experience designing, building, and shipping software","Proven ability to lead projects and communicate with cross-functional partners","Proficient with GraphQL and general API development and consumption","Able to design, architect, debug, test, and create well-documented code","Able to identify and componentize common abstractions with an eye for performance and stability of large-scale systems","Proficient in JavaScript and TypeScript"]},{"title":"People who excel in this role","content":["Relish complex technical challenges but find deep satisfaction in supporting their fellow developers","Understand engineering is a team sport and actively farm for feedback and dissent","Thrive in an ambiguous environment and can self-manage and self-prioritize your time, energy, and resources. Our team sets and implements the roadmap. No PMs here","Have the ability to break down abstract problems into concrete solutions"]},{"title":"What sets you apart?","content":["You’re known for your excellent communication skills","Expert at managing large-scale API’s and web applications","You’re an advocate for best practices and newer technologies","Current/former professional experience as a UI engineer","Experience with server-driven UI’s","You’re hungry and passionate to influence decisions that impact millions of users and billions of requests"]}],"location_emoji":"🌍"}