{"title":"Software Engineer, Android (L5) - Consumer Engineering","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":["Android","Java","UI performance","quality","accessibility","documentation","automated tests"],"overview":"The Software Engineer, Android (L5) - Consumer Engineering position at Netflix involves building industry-leading Netflix iOS, Android, and TV apps, partnering with cross-functional teams, and driving innovations in the member experience space.","description":"Netflix is the world's leading streaming video service with over 200 million paid memberships in 190+ countries. The Consumer Engineering team builds the industry-leading Netflix iOS, Android, and TV apps. To bring new kinds of engaging and cinematic experiences to life, we partner closely with many cross-functional teams including product management, experience design, and creative production. \n\nWe’re looking for a Software Engineer to drive innovations in the member experience space. Our responsibilities include working on large-scale A/B tests of features - ranging from highly visible product experiences to core infrastructure that enables existing and future innovations. We care deeply about UI performance, quality, and accessibility of the Netflix Android app. \n\nWe proudly ship the Netflix app on Android to millions of members around the world on a wide variety of devices. We work on data-driven optimizations at scale in a diverse device and network ecosystem. Our sophisticated operational testing and automation solutions are designed to support our high-performance, fast-paced culture of experimentation, autonomy, and ownership.\n\n","requirements":[],"extras":[{"title":"About the Role","content":["Collaborate with developers and product teams to build delightful, performant, and accessible user experiences.","Closely partner with product teams and designers to help scope and refine hypotheses-driven data-informed products and experiences","Participate with partner engineering teams on shared infrastructure","Deliver high-quality Android client code with effective documentation and automated tests that can be leveraged by other developers on the team","Optimizes the performance of our Android apps with complex view hierarchies and states on low-end devices and networks"]},{"title":"What Sets You Apart","content":["Curious about a broad range of new or unfamiliar technologies, our consumer base, and product vision","Seek different perspectives, feedback, and relevant information to continuously grow and improve","Maintain strong relationships with cross functional teams through clear communication.","Take a thoughtful and practical approach to problem-solving that considers tradeoffs and avoids over-engineering","Comfortable asking questions and seeking knowledge in unfamiliar or ambiguous situations","Endeavor to elevate the knowledge, skills, abilities of yourself and others that fosters an inclusive and collaborative environment"]},{"title":"Why Netflix?","content":["Work with other high-performing engineers where you will be constantly learning and sharpening your skill set","Help evolve the way people watch content online","The Netflix culture - Not just a memo, but something we practice daily"]}],"location_emoji":"🇺🇸"}