{"title":"Software Engineer (L5) - Game Platform Developer Performance Tools","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"8","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Game Platform Developer","Performance Tools","Developer Workflows","Tooling","Actionable Performance Insights","Game Development Tools","GPU Performance Optimization"],"skills":["developer workflows","tooling","game developer tools","performance insights","game development tools","Unity","Unreal"],"overview":"The Software Engineer (L5) - Game Platform Developer Performance Tools position is responsible for building developer workflows and tooling, specifically focusing on tools that provide game developers with actionable performance insights. They should have 8+ years of experience with game development tools and experience with game development engines such as Unity and Unreal, as well as GPU performance optimization. Nice to have is experience with full stack, Node.js, JavaScript/TypeScript, and React.","description":"Software Engineer (L5) - Game Platform Developer Performance Tools\n\nYou may have seen the news that Netflix is getting into gaming; this is your chance to be a key part of it! We are a growing team building a cloud platform that aims to bring Netflix games to our subscribers on a variety of devices beyond mobile phones. \n\nWe are looking for an engineer specializing in identifying and building developer workflows and  tooling who will serve as a key contributor to creating the suite of tools that make fast iteration and development of games for our platform a delight.\n\n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Help define, scope, and plan development of game developer tools","Build new tools and integrate existing development tools to work with our platform","Focus on tools that provide game developers with actionable performance insights"]},{"title":"This role is a fit if you:","content":["Take pride in building high-quality tools for developers","Love working on early stage projects where your contributions make a big difference","Thrive in an environment with lots of context and minimal guidance","Enjoy collaborating with engineers across functional teams","Are a self-starter with excellent communication skills"]},{"title":"Qualifications:","content":["8+ years experience with game development tools","Experience with game development engines such as Unity and Unreal","Experience with GPU performance optimization"]},{"title":"Nice to have:","content":["Experience with full stack, Node.js, JavaScript/TypeScript and React"]}],"location_emoji":"🇺🇸"}