{"title":"Software Engineer (L4/L5) - iOS Foundations","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["iOS","Foundations","Architecture","Frameworks","Performance","Quality","Accessibility"],"skills":[""],"overview":"The Software Engineer (L4/L5) - iOS Foundations position involves leading the iOS core libraries, framework & infrastructure strategy, contributing to developer experience by building scalable libraries, frameworks & infrastructure, and setting the vision and strategy for a robust and scalable logging framework.","description":"The Team\nThe iOS Client Foundations team shepherds and builds foundational architecture and frameworks that power the Netflix iOS app. Our three core values are: Accelerate developer velocity, pave the path and set standards for App quality and experience metrics, and pave the path to build scalable app architecture (foundational scaffoldings), frameworks, documentation, and communication for iOS platforms across Netflix.\n\nOur responsibilities include implementing large-scale future-looking foundational architecture and frameworks ranging from core UI frameworks to core infrastructure that enables existing and future innovations for product teams across Netflix. We care deeply about the performance, quality, and accessibility of the Netflix app. We’re passionate about creating elegantly designed, highly performant architectures that empower engineers to build unique UI experiences used by millions of users across the globe. We partner closely with teams across Netflix to help deliver solutions that make UI development efficient and enjoyable.\n\nWe are part of a global, diverse organization that includes people of all people of all genders, sexual orientations, upbringings, nationalities, ages, and socioeconomic & educational backgrounds. We encourage anyone passionate about building compelling mobile experiences that touch audiences worldwide to apply.\n\nThe Role\nWe are looking for an engineer to lead the iOS core libraries, framework & infrastructure strategy and innovate how we uphold the high bar for product quality amidst growing product areas while accelerating developer velocity. This role’s impact and visibility will be felt by (but not limited to) the entire iOS development community at Netflix. The engineer in this role will contribute to developer experience by building scalable libraries, frameworks & infrastructure to enhance the development of quick product feature iterations across the entire product engineering stack.\n","requirements":[],"extras":[{"title":"","content":["Provide technical leadership to drive pragmatic yet deeply impactful architectural decisions that address current and future product needs.","Help create a scalable, modular, extensible, and highly performant app that scales with high volumes of live data transactions on the app.","A strong advocate for building transparent observability tooling and solutions that enhance developer velocity.","Set the vision and strategy for a robust and scalable logging framework that consolidates our customers’ varying needs (other engineering teams) in close collaboration with our data science team.","Bring a wide variety of experience building frameworks/libraries with technologies like UIKit, Core Animation, Objective-C and/or Swift, and other Apple frameworks to the team.","Refine or define hypotheses with our stakeholders in a data-driven approach that informs foundational strategy and innovations.","Enable and ship complex product experiences with exceptional quality regularly and rapidly.","Find ways to detect and improve code health in a fast-paced, high-commit volume culture of experimentation.","Find solutions to prevent regressions in the product experience and improve test stability, coverage & performance."]},{"title":"What’s Different About Us","content":["Scale, Impact: You’ll enable engineers across multiple teams and organizations at Netflix to create best-in-class streaming UIs that hundreds of millions of members use across a broad spectrum of devices worldwide.","Unique Technical Challenges: We build framework solutions that are flexible enough to withstand the span of use cases introduced by rapid A/B test development across a varied client stack, server, and network performance landscape, all while being ergonomic to use for the engineers we support.","Collaboration and Communication: It’s not all about the tech. We highly value the skills required to build strong relationships and collaborate effectively with a high-performing, inclusive & supportive team of engineers.","Freedom, Responsibility, Ownership: We believe in providing engineers with the business context they need and giving them the freedom and responsibility to define project scope, define/debate architecture, determine trade-offs, and figure out the implementation details.","Our Culture: Lastly, but most importantly, we live by our values."]},{"title":"What Sets You Apart","content":["You enjoy pushing the boundaries of what technology can do and exploring uncharted waters with some supervision.","You are curious and ready to learn about various new or unfamiliar technologies, our consumer base, and product vision.","You have experience building transparent observability tooling and solutions that enhance developer velocity.","You love the idea of your work empowering other engineers and striving to understand their use cases.","Your colleagues appreciate the unique perspectives and balanced views you bring to collaborations.","You value the opinion of others when fleshing out solutions, to fill out your blind spots.","You have familiarity with the Data-centric approach to app development.","You always seek different perspectives, feedback, and relevant information to comfortably navigate ambiguity.","You always seek different perspectives, feedback, and relevant information to navigate ambiguity comfortably.","You are effective at establishing strong relationships with cross-functional teams through clear communication.","You deeply care about the quality & performance of the product shipped."]}],"location_emoji":"🇺🇸"}