{"title":"Software Engineer (L4/L5) - Compute Platform","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"The Software Engineer (L4/L5) - Compute Platform position at Netflix involves building and operating a scalable, reliable, secure, and efficient Compute Platform to deliver innovative experiences for members and content creators worldwide.","description":"About Netflix:\nNetflix is one of the world's leading streaming entertainment services with over 230 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nThe Compute team’s mission is to deliver a scalable, reliable, secure, agile, and efficient Compute Platform to provide innovative experiences for our members and content creators around the world. Our products power workloads across our Data Platforms, Stream Processing, Studio and Content, Encoding, Streaming, Content Delivery, Machine Learning, and Engineering Tooling. The team not only designs and develops our tier-one systems but also operates and supports them 24 by 7.\n\nWe are hiring for multiple roles across our teams which span problem domains including capacity management, traffic and failover, container execution across EC2 and our multi-tenant container platform, and on-host runtime execution and performance. \n\nHere’s an overview of our teams:\n\nAbstractions\nWe are the front door for all Netflix Engineers to use our Compute offering, providing customers with simplified and unified access to compute capabilities through fundamental workload abstractions and domain-specific solutions, while abstracting application details from the underlying compute infrastructure.\n\nCapacity & Placement\nWith one of the world’s largest cloud footprints, Capacity strives to efficiently and reliably provide cloud resources for each of the thousands of microservices and batch workloads powering the Netflix experience, ensuring capacity is available when and where it is needed. Resources are centrally managed and transparently brokered across teams through an internal spot market that minimizes cost and maximizes utilization. Placement reliably and efficiently orchestrates and places workloads across Netflix’s global infrastructure by architecting, building, and operating the control plane for our multi-tenant kubernetes-based containers platform. We push the boundaries of scale while maintaining high availability to meet our customer’s varied needs.\n\nRuntime\nEvery engineer at Netflix works under the “build it, run it” model and our job is to make it safe, easy, and performant for them to run what they build. We own the host-level foundation for Netflix’s server fleet: the customized base operating system and core services that enable the secure and efficient operation of hosts across Netflix. We build core services that enable the provisioning and operation of large server fleets and own the data plane of our centrally managed container platform, Titus. \n","requirements":[],"extras":[{"title":"Must-have skills & experiences","content":["Recent and proficient experience with Go, Java, Python, or other object-oriented programming languages","Experience building & operating highly reliable distributed systems in a cloud environment","Customer-focused curiosity, passion for technology, pragmatic thinking, ability to jump into an ambiguous area, and break down complex problems","Demonstrated experience in improving the reliability and operational automation of complex, multi-tier systems","You think freely and independently, and are ready to share your view"]},{"title":"What you'll be doing in the role","content":["Building and operating production software at internet scale","Balancing bias to action with the ability to make well-informed bets","Collaborating closely with our key partners as well as engaging directly with engineering customers to understand their needs and improve their experience","Understanding and solving business needs at scale with high-quality solutions","Leaning into proactiveness and effective communication in pursuit of cross-functional alignment"]},{"title":"You will be successful in the role if","content":["You thrive in ambiguity; complex and fuzzy requirements are more common than clearly defined customer expectations","You take incremental steps toward solving big problems; test and learn approaches work better than heads-down development","You are independent and self-driven, taking ownership of problems; progress is often self-directed by teams & individuals","You have read about Netflix’s culture and think you would thrive here"]}],"location_emoji":"🇺🇸"}