{"title":"Software Engineer (L5) - Machine Learning for Studio Media Algorithms","location":["Los Gatos, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"2","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Machine Learning","Computer Vision","Graphics","Data Processing","Model Training","Deep Learning Models","Software Engineering"],"skills":["Python","Java","C++","ML","CV","graphics","distributed data processing systems"],"overview":"","description":"At Netflix, our mission is to entertain the world by connecting our members to an extensive library of amazing stories from all over the globe. We are revolutionizing storytelling as we deliver billions of hours of movies and TV shows per month to 200+ million members across 190+ countries in 30+ languages. Developing data-driven algorithms and systems to help our creators in the Netflix studios produce content effectively and efficiently is an important part of that mission. \n\nThe Studio Media Algorithms team is at the forefront of innovation to enhance and support vision of creators of movies, TV shows and other multimedia work. This team's work is responsible for increasing member value, and driving efficiency of the content creation process, ultimately creating more joy for viewers all over the world. To learn more about the domain, here are some links related to what we do: Creating Media with Machine Learning and Computer Vision Research at Netflix.\n\nWe are looking for a  software engineer with experience in the machine learning (ML), computer vision (CV), and/or graphics domain to design and develop scalable systems and infrastructure for that effort. These systems will be used by our researchers to develop CV, graphics, audio, and natural language processing (NLP) algorithms to analyze, create, and transform media assets. \n\n\n","requirements":[],"extras":[{"title":"In this role, you will:","content":["Design and develop systems and reusable frameworks for the full cycle of machine learning in the multimedia domain, such as data processing, feature extraction, distributed model training with GPUs, and deploying the produced models into production.","Collaborate cross-functionally with research scientists, product managers, as well as creative and business partners and stakeholders, to help define and prioritize system requirements.","Work closely with ML researchers and Studio teams to productize Deep Learning models and efficiently run human-in-the-loop inference tasks.","Participate in algorithm development and propose scalable designs.","Promote and facilitate software engineering best practices in the team."]},{"title":"About you:","content":["Experience in software engineering experience in a production setting","Passion for turning ideas into products and improving the user experience","Skills in OO programming (Python, Java, or C++)","Familiarity with ML, CV, and/or graphics pipelines","Excellent communication and people engagement skills","Experience with large-scale distributed data processing systems and cloud infrastructure"]},{"title":"Bonus experience:","content":["Building end-to-end multimedia systems and algorithms","Deep learning frameworks such as PyTorch and Tensorflow","The content creation domain, such as visual effects","Computer graphics and VFX tools and game engines such as Unreal Engine, Unity, Autodesk Maya, or Nuke"]}],"location_emoji":"🇺🇸"}