{"title":"Software Engineer L6, Systems Efficiency & Performance","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Systems Efficiency","Performance","Distributed Systems","Cloud Computing","Java","Machine Learning","Technical Roadmaps"],"skills":["Java","AWS","Azure","GCP","AB testing","machine learning","cloud computing"],"overview":"The Software Engineer L6, Systems Efficiency & Performance position at Netflix involves leading a cross-functional effort to ensure efficient and scalable systems, partnering with various teams and developing tools and metrics to improve performance.","description":"Netflix is the world's leading streaming entertainment service with over 200 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen, all without commercials or commitments. As Netflix continues to scale across the globe, we are creating and licensing an ever growing catalog of content. We strive to launch and recommend each title on our service in a personalized way, to help each member find the best titles to enjoy.\n\n\nThe Member Experience Foundations team is part of our Consumer Engineering organization, working alongside ML researchers and distributed systems engineers. The team builds and operates systems focused on enabling the configuration, serving and monitoring of Netflix discovery experiences. Each experience has millions of configurations, and is algorithmically surfaced on dozens of canvases that we are continually innovating. The Foundations team supports the behavior of our pages and content on the product, and ensures each experience is a success.\n\n\nLeading this central effort, you will play a highly cross-functional role partnering with content, analytics, product management, application, machine learning, and data teams to ensure services are working in the most efficient, scalable and performant manner possible. You will develop tools and metrics that will improve our systems efficiency and enable them to scale.\n\n","requirements":[],"extras":[{"title":"What we’ll expect from you","content":["You have domain experience in distributed system performance and efficiency.","You have worked with commercial cloud compute providers like AWS, Azure or GCP.","You are a proactive, effective communicator and have a bias towards action.","You forge strong cross-functional relationships, seeking to understand business and partner needs, and delight in enabling your partners’ success.","You collaboratively develop and iterate on technical roadmaps, manage expectations, and selflessly navigate competing priorities.","You have domain experience with personalization, AB testing, machine learning, cloud computing and Java.","You have a BS or equivalent experience in Computer Science or a related field.","You are highly aligned with our Values."]},{"title":"What to expect from Netflix","content":["Meaningful work: your will directly enable and accelerate Netflix’s ability to innovate globally.","Impact: you will help shape the future of an industry.","Freedom & responsibility: our roles are not circumscribed, so we have the freedom to use our judgment to make Netflix better without permission.","Stunning colleagues: work with amazing talent on every project.","Inclusive: we embrace different backgrounds, perspectives, and styles because it helps us make better decisions.","Growth: learn from other selfless leaders around you and mentor others.","Rigor: our decisions are informed by a mix of good judgment and data."]}],"location_emoji":"🇺🇸"}