{"title":"Software Engineer 4 - TV UI","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"4","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["JavaScript","TypeScript","React","UI Engineering","TV Engineering","Server-Driven UI","Messaging System"],"skills":["Javascript","TypeScript","React","UI Engineering","Server-Driven UI","Automation Testing","String Translation"],"overview":"A software engineer 4 on the TV UI team at Netflix will work on driving growth by pioneering product features on emerging technologies and establishing code patterns, in addition to owning productized experiences in the growth space.","description":"\nThe Team\nAt Netflix, our mission is to Entertain the World.  Over 230 million members around the globe enjoy our award-winning movies and TV shows, but much of our growth still lies ahead. \n\nOur team is part of an organization that is responsible for driving the growth of Netflix’s subscriber base. Our work helps users discover Netflix, sign up for Netflix, and maintain their Netflix service.  We measure our team's success in the company's quarterly revenue.\n\nOur team sits at the heart of all growth initiatives and at the intersection of product development and platform innovation. We find satisfaction in pioneering product features on emerging technologies and establishing code patterns for the entire organization. We take pride in owning all productized experiences in the growth space by consistently looking for opportunities to raise product quality and pay down tech debt.\n\n\nThe Role\nWe are a cross-platform UI Engineering team that develops products on iOS, Android, and Web, and we are currently expanding our TV engineering squad.\n\nHere are some examples of TV projects that you will have a chance to work on:\n\n- Implementing Server-Driven UI principles in our TV products\n- Launching a cutting-edge messaging system on our TV platform\n- Balancing automation test pyramid to increase confidence in our product releases\n- Upgrading our string translation service\n- Deprecating our products on legacy TV devices\n\nWe believe in creating opportunities beyond roles and across team lines, and the breadth of scope in the team is full of opportunities to explore and grow.\n\n\nWhat Sets You Apart\nWe value aptitude over experience, and here are some key points that will make you successful on our team:\n\n- Skilled in Javascript - almost all our code is written in TypeScript and React\n- Incredibly selfless and willing to “Pick up the Trash”, a metaphor for taking care of problems, small and large, and never thinking “that’s someone else’s job.”\n- Curious about technology and product experiences, and motivated to understand how they intertwine\n- Exhibits exceptional grit and persistence when it comes to solving difficult technical problems\n- Displays a strong sense of independence, bias towards action, and inclination for collaboration\n- Treats high code quality as a core value\n\n\nWhat’s Different About Us\n- Big impact: Opportunity to impact products that hundreds of millions of customers use every single day\n- Growth: Expanding your skillset into deeper layers of the stack or trying your hand at different UI platforms\n- Ownership: We value context over control, empowering you to take ownership of your projects and make informed decisions\n- Stunning colleagues: Work with and learn from our amazing talent on every project\n- Inclusive: We embrace different backgrounds, perspectives, and styles because it helps us make better decisions\n- Distinctive culture: we live by our values, learn more about our unique culture\n\n\n","requirements":[],"extras":[],"location_emoji":"🇺🇸"}