{"title":"Software Engineer L4/L5 - Media Infrastructure Platform  Storage","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Media Infrastructure","Storage","Object Storage","S3","Cloud-based","File and Folder Solution","Change Events","Lifecycle Management"],"skills":["Java","OO programming languages","multi-threading","parallelism","microservices","data modeling","API design"],"overview":"The Software Engineer L4/L5 - Media Infrastructure Platform Storage position involves developing and maintaining a scalable and reliable media storage infrastructure for Netflix, collaborating with cross-functional teams, and building custom services on Amazon Web Services.","description":"About the Team\n\nMedia Infrastructure Platform - Storage team provides a content media storage infrastructure to enable Netflix to store and access media files at scale, reliably, and efficiently to meet the demands of a globally distributed studio. Our products are highly leveraged by Netflix Studio and Content Engineering, for example, for the encoding pipeline, post production pipeline, content asset management, marketing applications, etc. We are partnering closely with a variety of cross-functional teams including Netflix engineering platform, data science engineering, and content business engineering, as well as product managers. The team current owns a few key services:\n++ An object storage built on top of S3 with a set of features like Netflix access control, security,  chunking, client side encryption, full file checksum, etc.  \n++ A cloud-based file and folder solution with a set of features like files and folder change events/notifications, lifecycle management,  media sequence detection, etc.  \n\nBesides the cloud services the team currently owns, the team is also looking to grow into a more diverse storage space to meet the needs of business growth. \n\nThe Media Infrastructure Platform - Storage team is part of a media-focused engineering group which provides highly available infrastructure for content production and processing, storage and access, across all Netflix productions and licensed content. Infrastructure pieces like massive scale media processing platforms (1 , 2) media storage, workflows (Conductor), media asset management, collaboration, reporting, data movement , and data processing are some of the key services we build. All of this is custom built on top of Amazon Web Services (AWS) infrastructure.\n","requirements":[],"extras":[{"title":"You will be successful in this role if you:","content":["You are self-motivated and can work independently, while also being able to collaborating with engineers on the team as well as across functional teams","You thrive in ambiguity. Complex and fuzzy requirements are more common than clearly defined customer expectations","You are passionate about code quality, and engineering best practices","You enjoy building a robust, scalable, and highly available infrastructure to empower other engineers, with a focus on developer experience, observability and operational excellence","You have excellent communication skills"]},{"title":"Qualifications:","content":["Have 3+ years of experience with working on large-scale resilient distributed systems","Have proficiency in Java or other OO programming languages, as well as OO design principles","Have a good understanding of concepts like multi-threading and parallelism","Experience in designing and developing microservices","Experience in data modeling and API design","Good understanding of software observability"]},{"title":"Nice to have:","content":["Experience with UI/UX work as full stack engineer","Experience in building platform/infrastructure","Experience with cloud storage or file system"]}],"location_emoji":"🇺🇸"}