{"title":"Specialist, Con Todo","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":[""],"overview":"The Specialist, Con Todo position is responsible for managing social properties targeting the Latino community, collaborating on creating and executing a social calendar, preparing and posting content, monitoring platforms, responding to comments, and collaborating with external teams to develop content. Strong creative instincts, communication skills, attention to detail, and excellent creative writing skills are required, along with a deep understanding of Instagram, Twitter, and TikTok, the ability to be nimble and adapt quickly, knowledge of Latino communities, and proficiency in community management.","description":"It’s an amazing time to be joining Netflix as we continue to transform entertainment globally. Netflix is one of the world's leading entertainment services with 238 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nWHAT IS CON TODO?\nCon Todo is a social media platform that exists to uplift Latino talent, stories and perspectives through social content that contributes to the culture. We are on the pulse of conversation among our consumers – not just listening, but also shaping thoughtful, hilarious, exciting discussions with fans. Through our content, we deliver the Netflix stories that bring our Latino audiences joy, make them feel seen and empower them to be the representation they want to see on screen.  \n\nTHE OPPORTUNITY \nWe’re looking for a creative powerhouse who will help manage our social properties targeting the Latino community. You’ll be responsible for the day-to-day management of our social platforms, collaborating with an external team of writers and designers, and developing original social content. We’re looking for someone who is passionate about entertainment and pop culture, and who can authentically represent fandom through a Latino lens for the Netflix brand. You have a deep knowledge of the platforms where Latino audiences spend their time and can both identify and react appropriately to trends and cultural conversations. You have strong editorial judgment, sharp copy-writing skills, and the ability to make quick decisions. The Specialist for Multicultural Social on Con Todo reports to the Senior Manager, Multicultural based in LA.\n","requirements":[],"extras":[{"title":"KEY RESPONSIBILITIES","content":["Collaborate on creating, managing, and executing a social calendar","Prepare and post content on platforms in an accurate, timely manner","Monitor all Con Todo social platforms","Respond to comments from fans, talent, and notable influencers -- identifying unique opportunities to elevate community conversation","Collaborate with with an external team to develop evergreen and reactive content (when news breaks, big moments or trends)","Track and regram posts from relevant Netflix talent and fans on Instagram (including drafting copy)","Proactively bring ideas based on trends and comments & the Latino space to the Con Todo Slack channel","Collaborate with an external team of writers, designers, and vendors and well as internal creative teams","Manage the creation of assets and formats from ideation to execution","Participate in weekly brainstorm meetings","Note platform updates and trends as they happen and make corresponding recommendations for the brand","Create reports as needed that highlight social content performance and audience sentiment"]},{"title":"WHAT WE ARE LOOKING FOR","content":["STRONG CREATIVE INSTINCTS - You are constantly thinking of new ideas for posts, IG stories, and recurring features. You see a piece of content and know how to make it better, funnier, or more sincere.","STRONG COMMUNICATION SKILLS - You will be working with a small core team of creatives as well as Netflix managers who will come in and out of the work on the periphery. You are clear and concise in speech and writing, you maintain calm poise in stressful situations, and you are transparent and thoughtful in your communication about why or why you are not doing something.","ATTENTION TO DETAIL - We move quickly at Netflix and plans often change at the last minute. You have strong attention to detail from grammar in your writing, to spotting typos in captions, to making up-to-the-minute time and file changes in our content calendar.","EXCELLENT CREATIVE WRITING SKILLS - The Con Todo account is developing a strong and differentiated tone of voice. We are more than just a landing place for Netflix content, we want someone who can use assets and comments to build an impactful, consistent online persona and engage community by identifying unique community management opportunities and editing writer-submitted copy and assets to match our overall tone.","DEEP UNDERSTANDING OF INSTAGRAM, TWITTER AND TIK TOK - You know what file formats are needed for platforms, such as how to optimize IGTV videos for in-feed preview, when to use a carousel vs a grid takeover, when to use a Twitter thread vs individual Tweets, etc. You strive for high-quality downloads over screengrabs and are deeply interested in asset performance and the future of each platform.","ABILITY TO BE NIMBLE - You are nimble and have the ability to quickly pivot to priority changes or asks. You can adapt quickly to new asset requests without losing sight of other priorities. You identify creative opportunities that start in the community and work to make them bigger and better.","KNOWLEDGE OF LATINO COMMUNITIES - You are well-versed in the many subgroups that make up the community – from cultural references to slang – and are tapped into the conversations these different groups are having on social.","COMMUNITY MANAGEMENT- interacting with our audiences, developing relationships and inside jokes, and being willing to be both vulnerable and funny with our users - is the backbone of our social accounts. You are strategic in who, when, and what you respond to."]}],"location_emoji":"🇺🇸"}