{"title":"Sr. Manager, Operations, Studio Management - Albuquerque","location":["Albuquerque, New Mexico"],"attendance":["Onsite"],"type":["Full-time"],"experience":"10","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Studio Operations","Leadership","Customer Service","Strategy","Organization","Detail-oriented","People Management"],"skills":["leadership","strategy","customer service","management","communication","budgeting","forecasting"],"overview":"The Sr. Manager, Operations, Studio Management - Albuquerque position is responsible for managing studio operations, providing leadership and support to the studio management team, developing strategies for a best-in-class studio experience, cultivating relationships with productions and vendors, managing budgets, overseeing facilities services, collaborating on community relations initiatives, and delivering an exceptional experience for productions.","description":"Sr. Operations Manager, Studio Management\nLocation: Albuquerque, NM\nStudio Management and Services\n\nWe are seeking a Sr. Operations Manager to join our growing Studio Management and Services team.  This position will be housed in Albuquerque.  This position reports to the Director, Studio Management and Services UCAN.\n\nThe Opportunity\nNetflix is one of the world's leading entertainment services with over 238 million paid memberships in over 190 countries enjoying TV series, films, and games across a wide variety of genres and languages. Members can play, pause, and resume watching as much as they want, anytime, anywhere, and can change their plan at any time. \n\nThe Role\nA successful candidate will be a resident expert in their field with an emphasis on leadership, strategy and providing customer service excellence.  A candidate will be passionate, self-motivated, proactive, a strategic thinker, flexible, able to pivot when necessary. The ability to juggle multiple, diverse responsibilities with a strong emphasis on organization and an unwavering attention to detail at all times is required. This is a demanding and fast-moving position that requires someone who is a strong people manager, and is able to exercise good judgment and communication. \n\n","requirements":[],"extras":[{"title":"Responsibilities","content":["Responsible for managing studio operations at Albuquerque Studios","Provide direct leadership, vision and support to the studio management team","Lead and develop strategies for best in class studio experience","Cultivate and nurture relationships with productions, vendors, local crew base, local agencies, as well as internal Netflix stakeholders","Collaborate with Internal Netflix, NM Film Office and local businesses in support of Production","Experienced in forecasting and managing OPEX and CAPEX budgets","Oversight of the CAPEX Project Coordination and Management","Build and nurture relationships with internal stakeholders and vendors","Oversight of facilities services team service (MEP management, vendor RFPs, negotiations and contracts)","Collaborate on community relations initiatives","Responsible for delivering an exceptional experience for our productions","Create and implement workflows that are efficient and effective","Prepare/deliver studio presentations as needed","Conduct business essential tours","Accustomed to working in a fast paced environment, able to multitask, and meet tight deadlines","Perform other duties as required"]},{"title":"Qualifications","content":["10+ years experience in entertainment-specific operational and facilities management","Candidates will likely be in a Director+ role level outside of Netflix.","A strategic leader that is able to communicate a clear vision","Experienced in leading and building an effective operations team","Production experience / knowledge required","Strong budgeting and forecasting skills (OPEX/CAPEX)","Experience in studio program and delivery a plus","Proven track record of managing and scaling a team to keep up with studio activities","Ability to understand and digest complex concepts and projects","Knowledge of film incentives a plus","Knowledge of architecture, engineering, TI/construction renovation a plus","Strong knowledge of sustainable operations","Experienced in contract negotiations and execution","Strong understands of EHS regulations and local compliance","Ability to multitask in a fast-paced environment","Access to high quality vendors a plus","Team player who operates in a fast paced team-oriented setting","Ability to be discrete and maintain confidential information","Understanding of how to prioritize and respond accordingly","Experienced in creating/presenting presentation decks","Strong written and verbal communication skills"]}],"location_emoji":"🌍"}