{"title":"Stills Curation Specialist, LATAM","location":["Mexico City, Mexico"],"attendance":["Onsite"],"type":["Full-time"],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Photo Editing","Content Strategy","LATAM Original Titles","Global Collaboration","Imagery Curation","Quality Control","Digital Asset Management"],"skills":["Adobe Suite","Photoshop","Lightroom","digital asset management","content management systems","production/editing","photography"],"overview":"The Stills Curation Specialist, LATAM position involves selecting image assets from video source files, curating imagery for various assets, quality control of assets, and collaborating with global teams to execute strategy for LATAM original titles.","description":"We are looking for a highly trained photo editor to join the Photo & AV Studio team as a Stills Curation Specialist. This role will support the visual merchandising experience on the Netflix product across all product UI (user interface) and platforms as well as working with off-product promotional teams for additional photography needs within a broader strategy. \n\nYour primary role will be selecting image assets directly from the video source files of film and television content and providing creative content strategy on a per title basis for our LATAM original titles. This position will work closely with global teams in UCAN, EMEA and APAC as a partner and representative for LATAM. The work includes alignment with regional Product Creative, Photo & AV Studio and Publicity teams in Latin America; so an ability to proactively find connections to drive effective execution of strategy and influence global systems is key. \n","requirements":[],"extras":[{"title":"Responsibilities:","content":["Curating imagery for Standalone assets.","Including Series, Feature Films, Documentaries, Animation, Stand Up Specials and Reality Shows.","Curating imagery for Episodic assets (thumbnails) on service.","Curating imagery for Trailer and Supplemental Content thumbnails on service.","Quality Control (QC) of assets to ensure excellence on product platform and press outlets.","Leading imagery curation for specific publicity supported titles.","Photo editing on title events when necessary."]},{"title":"Skills:","content":["Creative/Editorial background in regards to a local Latin American-specific film and television industry is preferred.","Photography or editorial experience.","Extensive knowledge of Adobe Suite including Photoshop and Lightroom is preferred.","Previous experience in production/editing.","Experience with digital asset management and or content management systems is a plus.","Ability to manage projects from end-to-end with no supervision.","Ability to provide constructive feedback in a positive way when needed.","Detail oriented, problem solver and good communication skills are key.","Nice to have: Design experience."]}],"location_emoji":"🇲🇽"}