{"title":"Support Specialist - Animation","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Animation Support","Technology Support","User Experience","Technical Assistance","Bug Reporting","Feature Request","Zendesk","JIRA","Confluence","Cloud and SaaS Applications","G-Suite","AWS","Critical Thinking","Documentation","User Stories","Communication Skills","Innovation","Collaboration","Fluency in English"],"skills":[""],"overview":"Animation Support Specialists provide technical support to Animation users, prioritize actionable understandings of the holistic user experience, and work with partner teams to improve the overall technology experience and permanently resolve recurring issues.","description":"SUMMARY\nNetflix is the world's leading streaming entertainment service with over 222+ million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.\n\nROLE\nAnimation Support Specialists use their technical knowledge and experience to provide technology support to Animation users, converting information and learning from interactions to prioritize actionable understandings of the holistic user experience. As a Support Specialist, you play a critical role in supporting Netflix Animation staff and their engagement with technology by examining user friction and gathering relevant information. This begins the process of working with partner teams to improve the overall technology experience and permanently resolve recurring issues. This role will be expected to work PST/PDT hours. \n\n","requirements":[],"extras":[{"title":"RESPONSIBILITIES","content":["Serve as the primary point of contact for users seeking technical assistance","Responsible for learning how users experience technology through investigation, documentation, and categorization of interactions with a focus on trends and contact reasoning","Prioritize managing technical issues, triage/research bugs, be a part of incident/outage management workflows, escalate issues to appropriate partner groups, and develop/sustain robust documentation to create a positive knowledge base experience","Recognize and connect patterns in how users experience technology across 1st and 3rd party technologies by composing bug reports when needed","Recommend and/or implement experience improvements, make feature requests, bring to attention opportunities to create self-service solutions, as well as productivity enhancements","Identify and link ZenDesk tickets that show a pattern of behavior/user friction, curate the stories of the patterns, and maintain the health of the User Experience Jira space","Ensure that our users interact with us at the highest quality technical support partnership while engaging in our organization's strategy to learn from user experience","Actively participate and contribute to efforts designed to improve how users experience both technology and support at/or working with Netflix","Engage and work with our global team as part of an overall user journey experience team, gathering important information, data, and context to bridge the user experience and partner teams, using compassionate and thoughtful feedback/ideas","Work to ensure Netflix’s commitment to fostering an inclusive environment is demonstrated in every facet of our efforts","Create an inspiring, empowering, collaborative, and supportive team environment, leading by example and flexing to roll up your sleeves and support the team as needed","Flexibility in working hours to help meet the needs of the business","Live the Netflix Culture"]},{"title":"SKILLS & EXPERIENCE","content":["A minimum of 3 years experience in IT or Desktop Support/System Administration, Technical Support, Technical Director, and/or support engineer role in a production environment in Animation or VFX","Experience supporting software such as Adobe, Nuke, Shotgun, Flix, Maya, Toon Boom Harmony, Storyboard Pro or similar VFX and animation products","Experience working in story, editorial, art, previs, vfx, post, or other production and pipeline workflows","Experience working with software support tools such as Zendesk, JIRA, and Confluence or similar products","Experience supporting Cloud and SaaS Applications and SSO: G-Suite including Gmail, Calendar, Drive, Sites, Groups, and AWS","Proven ability to work independently with minimal supervision; must be a self-motivated self-starter that can initiate ideas","Critical thinking skills to troubleshoot, research, and diagnose complicated technical issues by utilizing available systems and tools","Robust documentation mindset, translating the information into knowledge base articles and/or user stories","Able to proactively seek out opportunities to improve our user experiences and deliver cohesive ideas around innovative support strategies and application design considerations","Strong communication skills with demonstrated ability to engage with users through various ingestion points and communication platforms; including the ability for direct (virtual) interaction with stakeholders as part of your investigation around a particular technology friction and the user experience","Consistently developing your skill set while seeking out opportunities to learn","Collaborative through listening, seeking to understand, and supporting","Fluency in English (business level)"]}],"location_emoji":"🇺🇸"}