{"title":"Systems Designer, Games Studio","location":["Los Angeles, California"],"attendance":["Onsite"],"type":["Full-time"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Systems Designer","Games Studio","Game Progression","Player Retention","Balance","Community","Social Party","Find-the-fun","Documentation","Collaboration","Unity","Live Ops","Meta-game Features","Communication","Cross-discipline Collaboration","Passion for Video Games","Visual Design Tools","Video Games","Board Games","Art tools","Flowcharting Tools","Writing Skills","Comedy Chops","Los Angeles","Remote"],"skills":["Systems Designer","Games Studio","game progression","systems perspective","player retention","pacing","game balance","community features","connecting players","sharing","virality","exciting experiences","social party space","paper tests","digital prototypes","feature documentation","diagrams","analyses","numbers","wireframes","prototypes","collaboration","creative feedback","goals","game designer","Unity development","live ops meta-game","communication skills","cross-discipline collaboration","passion for video games"],"overview":"The Systems Designer, Games Studio position at Netflix involves working closely with a core team to rapidly prototype and iterate towards a new game vision, designing meta-systems to maximize player retention and virality, and creating features that foster a community of sharing and virality, among other responsibilities.","description":"Netflix is building a new internal game studio to incubate and build a new class of hilarious, social party video games.\n\nThe Systems Designer will work closely with a new cross-discipline core team to rapidly prototype and iterate towards a new game vision, building confidence on a great game prototype to eventually bring to full production and make available to Netflix members.\n\nIn addition to finding the fun, a successful candidate will also be able to design meta-systems that maximize player retention and virality. We strive to make amazing games that are not only fun to play but also drive players to keep coming back and share the experience with their friends and family. So if you’re a creative designer with a knack for making games sticky, this may be the perfect role for you.\n\nYou’ll be joining a small, scrappy team with big ambitions, and an obsession to create memorable game moments that leave players telling their own stories for years to come. We’re looking for new teammates who care deeply about the experiences they create and the people they make them with. Those who bias towards action and are energized by the learning that comes with bold experimentation at an agile pace. As a part of Netflix, we strive to hire the best and value integrity, excellence, respect, inclusion, and collaboration. \n\nNow is an amazing time to join Netflix Game Studio as we seek to entertain our 200 million paid members in a really new way. \n","requirements":[],"extras":[{"title":"Responsibilities","content":["Game Progression: Design and map out game progression from a systems perspective that is built to enhance player retentionBalance: Work on the overall pacing and balance of our games","Community: Design features that allow players to connect with each other and foster a community of sharing and virality","Find-the-fun: Design, prototype, and test exciting new experiences in the social party space. This includes both paper tests and digital prototypes","Documentation: Provide clear feature documentation, complete with diagrams and analyses, backed up with numbers, wireframes and prototypes, as needed","Collaboration: Work with teammates by providing and receiving creative/team feedback, plus’ing others’ creative contributions, and providing clear creative goals with intentionally desired outcomes"]},{"title":"Requirements","content":["3+ years experience as a game designer shipping multiple large-scale products","Prior Unity development experience","Experience designing live ops meta-game features that drive player retention and virality","Experience designing and mapping out game progression systems","Exceptional communication and cross-discipline collaboration skills","Passion for making video games, especially in a rapid, focused, smaller form vs multi-year investments"]},{"title":"Bonus Skills","content":["Familiar with visual design tools such as Playmaker or Blueprint","Familiarity with video and board games that are in the social party space","Able to use art tools needed to share ideas such as Adobe CC","Familiarity with flowcharting tools such as Miro and Figma","Writing skills and comedy chops are always a plus"]},{"title":"Location","content":["Los Angeles Preferred/Remote"]}],"location_emoji":"🇺🇸"}