{"title":"Taxonomy Strategist, Ads","location":["Remote, United States"],"attendance":["Remote"],"type":["Full-time"],"experience":"4","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":[""],"skills":["Taxonomies","Metadata","Categorization","Technical attributes","Creative attributes","Industry taxonomies","Standards","software development cycles","global catalog","consumer-facing experiences","creative content","high-volume content environment","governance system","communication skills","influencing","global context","regional requirements","legal compliance","data management","computer science","library & information science","entertainment industry","machine learning","artificial intelligence","information architecture","user experience","human computer interaction","rights management","multilingual taxonomies","DAMS","MAMS","ontologies","graph models","ads regulations"],"overview":"The Taxonomy Strategist, Ads position at Netflix is responsible for driving the strategy, construction, adoption, and governance of taxonomies that support the ad-supported tier, collaborating with cross-functional partners to define, develop, maintain, and govern advertising related taxonomies.","description":"At Netflix, we want to entertain the world and are constantly innovating on how entertainment is imagined, created and delivered to a global audience. We currently stream content in more than 30 languages in 190 countries, topping over 230 million paid subscribers. \n\nWe recently launched a new ad-supported tier to offer our members with more choice in how they consume their content. Our new tier allows us to attract new members at a lower price point, while also creating a compelling path for advertisers to reach audiences that are deeply immersed. In this role, you will be responsible for driving the strategy, construction, adoption, and governance of taxonomies that support our ads tier. \n\nWe are seeking a senior-level Taxonomy Strategist who has experience with and passion for bringing structure to large-scale, disparate databases and vocabularies in the ads space. You will be responsible for scoping, creating, and maintaining data dictionaries, controlled vocabularies, schema governance, and data integrity/enforcement.\n\nCollaborating with cross-functional partners, the ideal candidate will be confident in making informed decisions. They possess the communication skills to successfully advocate for and gain acceptance of new taxonomy-related processes and governance policies. You have experience developing taxonomies for an ad-supported consumer-facing product or service, preferably related to the entertainment industry.\n\nAs a Taxonomy Strategist, you will work closely with the Advertising, Product, Ads Legal & Policy, and Engineering and Data Science teams to define, develop, maintain and govern advertising related taxonomies. \n\nReporting to the Product Metadata & Ratings Taxonomy Manager, this is an exempt role. Preferred location is Los Gatos or Los Angeles, but will consider US Remote, with some required travel to California. \n\n","requirements":[],"extras":[{"title":"Responsibilities include:","content":["Defining new taxonomies and metadata related to the categorization, technical and creative attributes that will support our ad tier.","Reconciling disparate taxonomies and metadata across teams.","Evaluation of adoption of industry taxonomies and associated mapping solutions.","Surveying and interviewing stakeholders and observing current and developing workflows.","Ensuring metadata is defined such that its integrity will not be compromised by cultural bias.","Working with subject matter experts to define workflows and standards for metadata application.","Develop taxonomies that will be foundational to our ads measurement roadmap.","Working closely with engineering partners to identify solution requirements, including tooling and intuitive UI for metadata application.","Evangelizing the importance of the adoption of common taxonomies.","Working with team experts to develop training materials and sessions.","Establishing a governance framework for taxonomies.","Establishing maintenance systems for taxonomies.","Creating and maintaining documentation to support taxonomies.","Reviewing other taxonomies and collaborating with Taxonomy Team colleagues.","Auditing existing taxonomies and improving their efficiency."]},{"title":"Requirements:","content":["Experience working with ads tech","Familiarity with advertising industry taxonomies and standards","Experience defining and developing new taxonomy and metadata schemas.","Experience as a team member with software development cycles and practices.","Experience working with a global catalog, consumer-facing experiences, and creative content.","Experience working in a high-volume content environment.","Experience working with systems shared across internal teams and vendors.","Experience establishing a governance system.","Excellent communication skills: written, verbal and presentation.","Able to work with and manage multiple stakeholders' expectations and priorities.","Ability to set goals and work independently in a highly cross-functional, non-hierarchical workplace.","Ability to influence across various function groups.","Experience working in a global context, sensitive to regional requirements.","Familiarity with legal compliance and changing landscape of ads regulations around the world."]},{"title":"Nice to Have:","content":["Masters degree in related fields: Data Management, Computer Science, Library & Information Science","Experience working in the entertainment industry.","Interest in Machine Learning and/or Artificial Intelligence capabilities.","Interest in Information Architecture, User Experience and/or Human Computer Interaction.","Experience with Rights Management.","Experience with Multilingual Taxonomies.","Experience with DAMS and/or MAMS.","Familiarity with Ontologies and Graph Models.","Experience with legal compliance and changing landscape of ads regulations around the world."]}],"location_emoji":"🇺🇸"}