{"title":"AR/3D Creative Director","location":["EMEA"],"attendance":["Remote"],"type":[],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Augmented Reality","Virtual Reality","3D Design","Advertising","Marketing","Immersive Production Techniques"],"skills":["Unreal Engine","Unity 3D","Adobe Aero","Lens Studio","AR Design","VR Design","3D Design"],"overview":"This job is for a multi-faceted Creative Director and category leader with a passion for Augmented Reality, Virtual Reality, and 3D Design within the realms of advertising and marketing.","description":"Superside is looking for a multi-faceted Creative Director and category leader with a passion for Augmented Reality, Virtual Reality, and 3D Design within the realms of advertising and marketing.\n\n\nYou’ll help to define our customer offering in these areas with ground-breaking solutions that disrupt the creative landscape.  Your deep expertise in immersive production techniques will contribute to delivering tech-forward, scalable creative solutions for brands such as Meta, Amazon, Salesforce and Red Bull.\n\n\nReporting to our VP Video Services, you’ll lead the commercial development of our AR/VR & 3D category, manage a team of specialist creatives to deliver exceptional client work and oversee all creative output in these growing fields.\n","requirements":[],"extras":[{"title":"What you'll do","content":["Define the products & services Superside should be offering to capture the market in AR, VR and 3D design for advertising & marketing","Generate growth through innovative, strategic thinking with a focus on business results—evaluate and prioritize based on the best revenue potential","Build required skills, materials and processes within Superside to enable us to sell and deliver top-quality AR/VR & 3D creative work to our customers","Build and manage a globally distributed team of amazing design & technical talent to deliver best-in-class work","Provide high-quality training, upskilling and mentoring that team members can apply to a wide range of global brands","Build partnerships with relevant platforms that would expand Superside’s addressable customer base","Collaborate with other departments at Superside to create new opportunities and troubleshoot roadblocks to growth","Stay ahead of the curve by actively exploring and researching new creative technology, platforms and techniques in the realms of 3D, VR, AR"]},{"title":"What you'll need to succeed","content":["Degree in Creativity, Communication, Technology or similar","Tangible proof designing, operationalizing and upskilling immersive design departments or teams, with a strong portfolio of work","Deep expertise in 3D design, AR Design, and VR Design, including Unreal Engine, Unity 3D, Adobe Aero/Substance","Solid understanding of how to best utilize cutting-edge immersive creative across digital platforms","Expertise in how to leverage scalable solutions such as Lens Studio and similar","A solid commercial perspective, and the ability to evaluate and prioritize strictly based on return on investment","Data-driven, structured and action-oriented. You get things done and you measure your impact","Proven results as a world-class leader in an international top-tier, fast-paced and fast-growing environment","Excellent English verbal and written communication skills and group discussion abilities","Structure and operational excellence—strong project management skills with the ability to lead multiple projects and customer accounts, delivering top-quality creative work and processes","Passion for mentoring and training other people toward excellence and success"]},{"title":"Our biggest challenge right now","content":["We are reinventing how good design and production get done, at scale. Moving forward, we want to stay one step ahead for our customers by offering more complex, cutting-edge production services that meet the needs of today’s marketing landscape but are delivered in a refreshingly hassle-free way.","This role requires someone who is up to the challenge of growing our burgeoning AR/VR & 3D business by making smart bets and building new ways of delivering progressive work."]}],"location_emoji":"🌍"}