{
    "//location_example": ["Mountain View, CA", "Brazil", "EU", "LATAM", "Worldwide"],
    "location": null,
    "//attendance_example": ["Remote", "Onsite", "Hybrid"],
    "attendance": ["Remote"],
    "//type_example": ["Full-time", "Internship", "Part-time", "Contract"],
    "type": null,
    "//minimal_experience_example": ["No experience", "1", "3", "5", "7", "10"],
    "experience": null,
    "//salary_example": {"min": 800000, "max": 1000000, "format": "annually", "currency": "usd"},
    "salary": null,
    "//tags_example": ["Backend", "Frontend", "Fullstack", "Mobile", "DevOps", "Data", "Security", "QA"],
    "tags": ["Creatives","Presentation Design","Branding","Graphic Design","Digital Advertising","Print Design"],
    "//skills_example": ["Java", "Python", "PHP", "Spring Framework", "Django"],
    "skills": ["Figma","Adobe Illustrator","Photoshop","Google Slides","PowerPoint","Keynote"],
    "//overview_example": "Looking for a software engineer to work on the next generation of Google Search, improving search quality and user experience.",
    "overview": "Superside is the leading Creative-as-a-Service (CaaS) company that helps over 450 ambitious brands get great design and creative done at scale.",
    "description": "With our design subscription service, marketing and creative teams can unbottleneck design, move faster, and drive more reliable creative performance. We help the world's leading companies like Google, Meta, Amazon, Salesforce, Red Bull, and Boston Consulting Group with advertising creative, brand design, video production, and more. No longer chained to over-taxed in-house creative teams, our customers reduce costs and move quickly with infinite scale.",
    "//requirements_example": ["Good communication skills", "Team player", "Self-motivated", "etc."],
    "requirements": ["BA or higher within Design, Creative, Comms, or similar fields","Strong portfolio of creative work with a focus on Presentation design","Strong knowledge of visual storytelling through presentation design, including data visualization, infographics, and use of imagery, illustration, text, and motion","Excellent presentation layout and design skills using Figma, Adobe Illustrator, Photoshop, Google Slides, PowerPoint & Keynote","Motion skills within Presentation design software","Excellent understanding, interpretation, and visual execution of data visualization and infographics","Ability to quickly learn processes and multitask projects with customer needs in mind","Great communication skills and experience working within a team environment","An open-minded approach to creativity and work","Ability to always deliver pixel-perfect quality on time and within budget","Excellent English verbal and written communication skills","Bias for action, proactive, customer-centric, and execution-focused mindset"]
}