{
    "//location_example": ["Mountain View, CA", "Brazil", "EU", "LATAM", "Worldwide"],
    "location": null,
    "//attendance_example": ["Remote", "Onsite", "Hybrid"],
    "attendance": ["Remote"],
    "//type_example": ["Full-time", "Internship", "Part-time", "Contract"],
    "type": null,
    "//minimal_experience_example": ["No experience", "1", "3", "5", "7", "10"],
    "experience": ["7+ years"],
    "//salary_example": {"min": 800000, "max": 1000000, "format": "annually", "currency": "usd"},
    "salary": null,
    "//tags_example": ["Backend", "Frontend", "Fullstack", "Mobile", "DevOps", "Data", "Security", "QA"],
    "tags": ["UX","UI","Mobile","Web Apps","Landing Pages","Dashboards","Digital Products","Design","Front-end"],
    "//skills_example": ["Java", "Python", "PHP", "Spring Framework", "Django"],
    "skills": ["UX Design","UI Design","Figma","Adobe Creative Suite","HTML5","CSS3","JavaScript"],
    "//overview_example": "Looking for a software engineer to work on the next generation of Google Search, improving search quality and user experience.",
    "overview": "As the UX/UI Creative Lead at Superside, you'll have the opportunity to lead and guide our team of UX/UI designers.",
    "description": "We work on significant strategic projects spanning from creating stunning mobile & web apps, landing pages, dashboards, and other digital products for our global brands like Meta, Google, Amazon or Twitch. In this role, you will work with our globally distributed team of top-talent creatives with plenty of professional growth opportunities. You will lead and mentor a team of UX/UI designers, set the creative vision and standards for all UX/UI projects, manage the design process, and work cross-functionally with other teams to ensure designs meet objectives. Strong communication, presentation, and leadership skills are required. Knowledge of front-end languages: HTML5, CSS3, and JavaScript is a plus. Problem-solving mindset with a focus on user-centered design and understanding of design systems are also important.",
    "//requirements_example": ["Good communication skills", "Team player", "Self-motivated", "etc."],
    "requirements": ["Bachelor's degree in Design, or similar education","7+ years of experience as a UX/UI Designer, with 2+ years in a leadership role","Strong portfolio showcasing your UX/UI design skills","Expertise in design software such as Figma and Adobe Creative Suite","Excellent visual design skills with a focus on user-system interaction","Proven experience leading and managing a team of designers","Strong communication, presentation, and leadership skills","Excellent problem-solving abilities with a user-centric mindset","Analyzing stakeholders around the vision of the Digital ecosystem","Be able to prioritize functions and features among websites"]
}