{"title":"Creative Project Manager","location":["Global"],"attendance":["Remote"],"type":["Contractor"],"experience":"3","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Creative Strategy","Asset Delivery","Account Strategy","Customer Needs","Upgrade Opportunities","Retention Measures","Project Management"],"skills":["Adobe Suite","Figma","Digital advertising","Social media platforms","Branding","Communications","English skills"],"overview":"The Creative Project Manager at Superside is responsible for managing multiple high-paced creative projects, collaborating with customers and creatives, scoping and budgeting projects, and delivering a 10/10 customer experience. They should have at least 3 years of experience in project/account/campaign management or creative production, excellent understanding of creative communication, familiarity with Adobe Suite and Figma, and strong organizational and communication skills.","description":"Superside is looking for Creative Project Managers to strengthen their team.\n\n\nJoining the Creative Services department, you'll build and deliver creative strategy and assets for some of the most innovative companies on the planet—all while working in a global remote community focused on making the future of work brilliant.\n\n\nIn this role, you'll have the responsibility for key accounts from day one, a steep learning curve and an exciting growth path toward team leadership.\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Contribute to account strategy to proactively identify and meet customers’ needs with creative work","Identify upgrade, expansion opportunities and churn risk, and take measures to ensure retention","Manage 20+ concurrently ongoing high-paced creative projects—from strategy to concept to production— collaborating with numerous customers and creatives","Identify, discuss and clarify customers’ objectives and needs. Turn them into creative recommendations and concise creative briefs, present output and discuss feedback","Scope, budget, plan, coordinate and execute projects","Motivate the creative team to deliver a 10/10 customer experience on every single project","Partner with our customers to support them in finding the best way to leverage our creative teams' capabilities to achieve their business objectives","Continuously learn, develop, and grow yourself and others"]},{"title":"What You'll Need To Succeed","content":["3+ years of experience as a Project/Account/Campaign manager, or Creative producer within a brand or advertising function","Excellent understanding of creative communication and how creative content can drive business outcomes","Understanding of creative craft with a solid ability to scope and budget","Familiarity with the Adobe Suite (Ps, Ai, Ae, Id) and Figma","High-level understanding of Digital advertising and social media platforms, or Branding and communications","An organized, customer-centric and detail-oriented approach, with an account management mindset","Excellent verbal and written English skills required to present ideas and coordinate work in large international groups","Autonomy, decisiveness, and accountability"]}],"location_emoji":"🌍"}