{"title":"Creative (Presentation Design)","location":["Global"],"attendance":["Remote"],"type":[],"experience":"null","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Presentation Design","Branding","Graphic Design","Digital Advertising","Print Design","Customer Relationships","Design Techniques"],"skills":["Presentation Design","Visual Storytelling","Data Visualization","Infographics","Figma","Adobe Illustrator","Photoshop"],"overview":"Superside is looking for inspired Creatives to specialize in presentation design and work on diverse projects for top global brands, leveraging visual storytelling, design tools, and motion skills.","description":"Superside is looking for inspired and purpose-driven Creatives to take our company’s creative capabilities to the next level. In this role, you will work with our globally distributed team of top-talent creatives and creative leads, across various capabilities such as Branding, Graphic Design, Digital Advertising, Print Design, with a special focus on Presentation Design.\n\n\nWe provide strategic creative solutions for customers and partners including Meta, Amazon, Salesforce, Reddit, and Google. Our subscription-based model allows us to create meaningful long-term customer relationships and the high-quality work that our talented teams produce.\n","requirements":[],"extras":[{"title":"What You'll Do","content":["Create amazing designs for top global brands, specializing in presentation design across a diverse range of projects and requirements","Work strategically to answer the customers' needs, by asking the right questions to understand customers' goals and briefs","Guide customers to the right outcome by presenting solutions, backed up by concepts and creative strategy to tell compelling visual stories in the form of presentation design","Collaborate with your creative leads and dedicated account teams across different time zones","Work on a number of simultaneous projects, executed with high attention to detail, on time and budget","Problem-solve on your projects and be proactive to keep Superside one of the top global remote workplaces","Develop and grow yourself together with a creative network of top designers and creative leads","Craft visually engaging presentations that effectively communicate messages, concepts, and data","Leverage design techniques and tools specifically tailored for presentation design, ensuring optimal visual storytelling and audience engagement"]},{"title":"What you Need to Succeed","content":["BA or higher within Design, Creative, Comms, or similar fields","Strong portfolio of creative work with a focus on Presentation design","Strong knowledge of visual storytelling through presentation design, including data visualization, infographics and use of imagery, illustration, text and motion to tailor information to audiences","Excellent presentation layout and design skills using Figma, Adobe Illustrator, Photoshop, Google Slides, PowerPoint & Keynote","Motion skills within Presentation design software","Excellent understanding, interpretation and visual execution of data visualization and infographics","Ability to quickly learn processes and multi-task projects with customer needs in mind","Great communication skills and experience working within a team environment","An open-minded approach to creativity and work, going beyond design","Ability to always deliver pixel-perfect quality on time and within budget","Excellent English verbal and written communication skills","Bias for action, proactive, customer-centric, and execution-focused mindset"]}],"location_emoji":"🌍"}