{"title":"Customer Success Manager","location":["LATAM"],"attendance":["Remote"],"type":["Contractor"],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Customer Success","Account Management","Customer Satisfaction","Renewals","Expansions","Onboarding","Product Training"],"skills":["account management","customer relationship building","customer success strategy","excellent English communication skills","proactive approach","SaaS environment","solution evangelism"],"overview":"The Customer Success Manager position at Superside involves driving customer satisfaction, renewals, and expansions for a diverse range of customers, managing post-sales relationships, proactively identifying potential churn risks, collaborating with the project delivery team, guiding customers with proactive solutions, and partnering with other teams to drive strategy alignment. Successful candidates will have a bachelor's degree or higher in a relevant field, 5+ years of customer-facing experience, excellent communication skills, strong customer relationship building skills, experience with end-user engagement, a bias for action, and the ability to quickly learn and problem-solve. The biggest challenge for the company right now is organizing a team that allows structure and agility while defining their customer-centric culture and welcoming innovative ideas.","description":"Superside is expanding its Customer Success team and is looking for a Customer Success Manager to work closely with our top-tier brands and companies such as Meta, Amazon, Red Bull, Cisco & LVMH as well as SMBs.\n\n\nAt Superside, you will be helping our customers realize maximum value from our collaboration. You'll carry out this mission by making sure you engage with end-users and executives alike to ensure that our customers love, adapt and grow with Superside.\n\nThis role is different from a Customer Support role. It requires a proactive approach to our customers, understanding their strategy and future needs before any issues arise. Candidates who will succeed in this role have first and foremost experience with account management and a true customer-centric mindset.\n","requirements":[],"extras":[{"title":"What you'll be doing:","content":["Drive customer satisfaction, renewals and expansions for up to 30 of our customers","Manage the post-sales relationship which includes onboarding, product training, user adoption, quarterly business reviews","Manage, monitor and keep track of account health of all your accounts and act upon any proactively identify potential churn risks","Collaborate closely with Superside creative project delivery team to ensure we provide the best customer experience possible","Manage customer escalations to drive resolution internally with stakeholders","Guide customers with proactive solutions to help them increase the value of their Superside subscription","Drive continuous improvement sharing suggestions on ways to update internal processes and implement best practices, supporting customer success strategy as the function evolves","Partner with other teams such as Operations, Marketing and Product to drive strategy alignment focused on mutually desired business objectives"]},{"title":"What you'll need to succeed:","content":["Bachelor Degree or higher in Creative, Communication, or similar/Bachelor in Business or Marketing","5+ years of related customer-facing experience and account management, preferably from a Creative/Ad Agency and/or SaaS environment","Excellent English verbal and written communication skills, good at presenting ideas and discussing solutions in large groups","Strong customer relationship building skills, with ability to manage expectations and build trust","Experience engaging with end-users, evangelizing a solution and drive adoption across multiple stakeholder groups","Bias for action, appreciation for data-driven processes, hard-working, proactive, customer-centric and execution-driven mindset","Ability to collaborate with the full account team and other stakeholders","Ability to quickly learn relevant design production/operations/process concepts and consult customers on these","Be a natural problem-solver who can be effective with limited information"]},{"title":"Our biggest challenge right now","content":["As we expand, we are looking to organize a team that allows agility and structure. We are still a fast growing company that requires us to be comfortable with change.","Processes need to be tested and put in place, but not rigid enough that we can’t easily and quickly adapt.","Our overall focus is on bringing value to customers but we are still defining our customer-centric culture.","We need people that come with innovative ideas, give us input and are ready to impact our approach to customer success."]}],"location_emoji":"🌍"}