{
    "//location_example": ["Mountain View, CA", "Brazil", "EU", "LATAM", "Worldwide"],
    "location": null,
    "//attendance_example": ["Remote", "Onsite", "Hybrid"],
    "attendance": ["Remote"],
    "//type_example": ["Full-time", "Internship", "Part-time", "Contract"],
    "type": null,
    "//minimal_experience_example": ["No experience", "1", "3", "5", "7", "10"],
    "experience": ["4+ years"],
    "//salary_example": {"min": 800000, "max": 1000000, "format": "annually", "currency": "usd"},
    "salary": null,
    "//tags_example": ["Backend", "Frontend", "Fullstack", "Mobile", "DevOps", "Data", "Security", "QA"],
    "tags": ["Design","Creative","Branding","Presentation design","Print Design"],
    "//skills_example": ["Java", "Python", "PHP", "Spring Framework", "Django"],
    "skills": ["Adobe Creative Suite","PowerPoint","Keynote","Google Slides","Figma"],
    "//overview_example": "Looking for a software engineer to work on the next generation of Google Search, improving search quality and user experience.",
    "overview": "Superside is looking for Design Directors to manage creative projects and lead a team of creatives.",
    "description": "Superside is seeking Design Directors to take our company's creative capabilities to the next level. In this role, you will manage the overall creation, workflow, and output quality of projects. You will provide expertise in Presentation design, ensuring high-quality creative output and innovative approaches in all presentation projects. Additionally, you will collaborate with dedicated account teams, manage simultaneous projects, and shape creative strategies to meet customer needs and goals. As a Design Director, you will inspire, mentor, and manage a team of creatives, taking responsibility for their growth and development. BA or higher within Design, Creative, Comms, or similar fields, with 4+ years of experience as a creative lead in a top-tier creative agency or global tech company, is required. Strong presentation and design skills using Adobe Creative Suite, PowerPoint, Keynote, Google Slides, and Figma are essential.",
    "//requirements_example": ["Good communication skills", "Team player", "Self-motivated", "etc."],
    "requirements": ["BA or higher within Design, Creative, Comms, or similar fields","4+ years of experience as a creative lead in a top-tier creative agency or global tech company","Strong portfolio of creative work across multiple capabilities, with a focus on Presentation design","Excellent presentation and design skills using Adobe Creative Suite, PowerPoint, Keynote, Google Slides, and Figma"]
}