{"title":"Digital Content Producer (Video)","location":["Bogota"],"attendance":["Remote"],"type":["Contractor"],"experience":"4","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Video Production","Filmmaker","Video Content","Cinematographer","Editing","Innovation","Automation"],"skills":["Video production","Cinematography","Editing","Digital advertising","Adobe Creative Suite","Animation","Adobe After Effects"],"overview":"A craft-minded and innovation-oriented filmmaker is sought to help grow video production on a global scale at Superside, capturing exciting, attention-grabbing video content to a commercial level.","description":"We are looking for a craft-minded and innovation-oriented filmmaker to help us grow video production on a global scale at Superside. Someone that is excited to bring their expertise (Cinemaphotographer with focus with some editing ability) to capture exciting, attention-grabbing video content to a commercial level.  \n\n\nIf you get excited about innovation, how to best automate repetitive task to deliver high quality video, we count on you to champion out-of-the-box thinking as we redefine the landscape for video production.\n\n","requirements":[],"extras":[{"title":"What you'll do","content":["Monitor the latest trends on social & digital advertising, as well as in industries our customers are based in","Suggest epic visual creative solves for briefs","Deliver amazing work autonomously with time and budget in mind","Collaborate and share knowledge with the rest of your team for the best outcome","Create new ways of bringing short-form video to the world","Handle planning, creating & delivering excellent quality content pieces that impress customers","Own quick-turn pre-post production of video elements where needed - from shot lists, filming and checking sound, to delivering excellent quality content pieces","Edit content to a competent standard in order to help with basic editing requirements and support a smooth transition into post production"]},{"title":"What you'll need to succeed","content":["4+ years of creating high-quality content","Your own film gear + editing computer","A good understanding of Digital Marketing","Ability to create gripping story arcs that consumers can relate with","Ownership of your commercial quality equipment, which you can use to execute Superside shoots. A monthly benefit is included in your package to allow the required maintenance and upgrades for this kit","Proficiency in the Adobe Creative Suite preferably in Animation and Adobe After Effects","Strong ownership of content creation from beginning to final output, including storyboarding, edit and filming with social optimization in mind","Ability to manage fast-moving projects for multiple clients simultaneously","Strong understanding of best design for different media types and specs","Self-sufficiency in your own projects while being a collaborative and uplifting member of a project team","A proven ability to process, organise, and maintain video file organization","Enthusiasm for great design / creative","A showreel of successful rapid short-form content relevant to social channels","Bonus point if you have experience with micro-crew setups/guerilla-style content creation"]},{"title":"Our biggest challenge right now","content":["Our Video Production team is relatively new, which comes with a few challenges. Our processes tend to change frequently, so you need to be adaptable and have an in-depth ability with certain procedures. As we’re working remotely, updates need to be constant and detailed. Working as a video producer at Superside requires over-communication, with both your team and the customer.","While we understand Production requires someone who takes charge and controls many aspects of the shooting, we need people who get stuff done with a positive attitude. This calls for a trusting team player, who is resourceful, ego-free, kind, and has a wicked sense of humor."]}],"location_emoji":"🌍"}