{"title":"Onboarding Services Team Lead","location":["LATAM"],"attendance":["Remote"],"type":["Contractor"],"experience":"2","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Onboarding Services","Team Lead","Customer Onboarding","Team Management","Communication","Project Management","Collaboration"],"skills":["Onboarding Services Team Lead","Customer Enablement","onboarding","Creative Consultant","Technical Consultant","Consultant","customer satisfaction"],"overview":"The Onboarding Services Team Lead will guide and manage the Onboarding Services team to ensure successful integration of customers to Superside, overseeing the development of effective onboarding strategies, fostering collaboration, and continuously improving practices to enhance customer satisfaction.","description":"Superside is looking for a Team Leader to guide and manage the Onboarding Services team that is instrumental to the successful onboarding of our customers to Superside.\n\n\nYou’ll work with a diverse team of creative, technical, and consultation professionals to create onboarding processes that your team will put into action, ensuring our customers' successful integration into our creative ecosystem.\n\n\nReporting to the Director of Customer Enablement, success in this role will be measured by your ability to ensure our onboarding strategies and processes are effectively executed, foster collaboration within the team, and continuously improve our practices to enhance customer satisfaction.\n","requirements":[],"extras":[{"title":"What You'll be doing","content":["Manage and mentor the Onboarding team, including the Onboarding Creative Consultant, Onboarding Technical Consultant, and Onboarding Consultant","Foster a collaborative team environment, encouraging open communication and sharing of ideas","Oversee team performance, providing feedback and supporting professional development opportunities","Oversee the development and implementation of effective onboarding strategies and processes that meet the unique needs of our customers","Work closely with each team member to ensure their respective strategies (creative, technical, and consultation) align with our overall onboarding objectives","Monitor and measure customer satisfaction during the onboarding process, implementing changes and improvements as necessary","Ensure a seamless transition from the onboarding phase to an ongoing relationship with our customers","Coordinate with other teams within the organization (e.g., Account Management, Digital Marketing Consulting Services, etc.) to ensure a cohesive and comprehensive approach to customer onboarding","Foster effective communication between the onboarding team and other internal teams to guarantee alignment and collaboration"]},{"title":"What you will need to succeed","content":["Bachelor's degree in Business, Management, or a related field","Proven leadership experience in a customer-facing role, preferably in a SaaS or creative services setting","Exceptional team management, communication, and interpersonal skills with a strong ability to build rapport and trust","Strong understanding of onboarding processes, customer support practices, and digital marketing principles","Proactive problem-solving skills with a results-oriented mindset and a strong customer success orientation with a focus on delivering tangible outcomes","Ability to effectively manage multiple projects and deadlines","Excellent English communication with the ability to effectively present ideas and convey complex concepts to technical and non-technical audiences","Tech-savvy and industry-experience, with the ability to stay current on market trends, emerging technologies, and competitive dynamics"]},{"title":"Our biggest challenge right now","content":["Onboarding is critical to customer experience and will oftentime predict retention. This is why we’re building a dedicated team to guide and nurture them during this meaningful time. Your role will have a direct impact on our business and will shape the future of Superside.","You’ll manage a new team with different functions and profiles that need to be aligned towards a common goal. We’re still building our team culture, processes and practices and you’ll directly contribute to it by challenging the status-quo and coming up with innovative solutions.","Another, maybe more challenging imperative will come from building trust and relationships with other account teams like Creative Project Management and Customer Success. As you’ll be coordinating with multiple internal teams, you need to ensure alignment, effective communication and seamless handover to provide a cohesive onboarding experience."]}],"location_emoji":"🌍"}