{"title":"Senior Product Marketing Manager","location":["EMEA"],"attendance":["Remote"],"type":[],"experience":"5","salary":{"min":0.0,"max":0.0,"format":"USD","currency":"per-year-salary"},"tags":["Product Marketing Strategy","Brand Narrative","Market Positioning","Strategic Thinking","Storytelling","Market Dynamics","Business Goals"],"skills":["Product Marketing","Brand Management","SaaS","Consumer Goods","Analytical Skills","Market Research","Win/Loss Analysis"],"overview":"The Senior Product Marketing Manager at Superside will be responsible for shaping the brand narrative, positioning the product and services in the market, and ensuring clarity, consistency, and impact of messaging across all channels.","description":"Superside is looking for a Senior Product Marketing Manager to drive our product marketing strategy.. You will be responsible for shaping Superside's brand narrative and positioning our product and services in the market. This role is ideal for a strategic thinker with a passion for storytelling and a deep understanding of market dynamics.\n\n\nYou will own a key function in a marketing team that has proven its ability to drive rapid growth from $4M-$45M ARR, and be part of our ongoing growth journey from $45M-$100M ARR and beyond.\n","requirements":[],"extras":[{"title":"What You'll Be Doing","content":["Craft and refine Superside's brand story, ensuring it resonates with our target audience and differentiates us in the market","Collaborate with internal teams to ensure brand consistency across all touchpoints","Develop a compelling strategic narrative that aligns with our business goals and speaks to our audience's needs and aspirations","Work closely with senior stakeholders to ensure the narrative aligns with our vision and mission","Own the messaging and positioning for Superside's product and services, ensuring clarity, consistency, and impact","Collaborate with the marketing, sales, and product teams to scale and adapt messaging across all channels, including digital, print, events, and more","Lead market research initiatives to gather insights on industry trends, competitor strategies, and customer preferences","Conduct win/loss analysis to understand our strengths, sharing potential areas of improvement in the sales process","Translate insights into actionable strategies to enhance our market position"]},{"title":"What you’ll need to succeed","content":["Bachelor's degree in Marketing, Business, or a related field. Master's degree is a plus","5+ years of experience in product marketing, brand management, or a related role, preferably in the SaaS, or consumer goods industry","Proven track record of crafting compelling brand stories and narratives","Strong analytical skills with the ability to translate data into actionable strategies","Exceptional communication and collaboration skills","Experience in market research and win/loss analysis"]},{"title":"Our biggest challenges right now","content":["We have grown to a $50M ARR company leveraging our branding and messaging that positions Superside as a production partner to creative and marketing teams to scale their designs. However as we have grown, we now offer a wide variety of creative services, appeal to many industries, and serve different personas very differently. Our go-to-market, positioning, and pricing all need to keep up with this change so we need someone to lead our efforts to nail our messaging and capture up-to-date insights on our market."]}],"location_emoji":"🌍"}