            {
                "id": 23,
                "companyId": 3,
                "title": "Creative Lead (UX/UI)",
                "location": ["Global"],
                "type": ["Contractor"],
                "attendance": ["Remote"],
                "experience": 7,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["UX/UI Design","Team Leadership","Design Process Management","Communication Skills","Front-end Development","Complex Design System Development","Design Software Expertise"],
                "skills": ["HTML5","CSS3","JavaScript","Figma","Adobe Creative Suite","Complex Design System development","UX/UI design skills"],
                "overview": "The UX/UI Creative Lead at Superside will lead and guide a team of UX/UI designers, working on strategic projects for global brands and overseeing the design process from conception to prototyping, while encouraging a culture of innovation and improvement within the team.",
                "description": "As the UX/UI Creative Lead at Superside, you'll have the opportunity to lead and guide our team of UX/UI designers. We work on significant strategic projects spanning from creating stunning mobile & web apps, landing pages, dashboards, and other digital products for our global brands like Meta, Google, Amazon or Twitch. 


In this role, you will work with our globally distributed team of top-talent creatives with plenty of professional growth opportunities. 
",
                "extras": [{"title":"What You'll Do","content":["Lead and mentor a team of UX/UI designers","Set the creative vision and standards for all UX/UI projects","Manage the design process, from conceptual design to prototyping","Work cross-functionally with other teams to ensure designs meet objectives","Excellent English verbal and written communication skills to present and explain designs and deliverables to peers, executive stakeholders and customers","Oversee and provide feedback on design deliverables","Encourage a culture of innovation and improvement within the team","Understanding of front-end languages: HTML5, CSS3, JavaScript is a plus","Problem-solving mindset with a focus on user-centered design","Knowledge of automation process is a plus","Strong experience in Complex Design System development","Proven experience in working alongside with development team"]},{"title":"What You'll Need To Succeed","content":["Bachelor's degree in Design, or similar education","7+ years of experience as a UX/UI Designer, with 2+ years in a leadership role","Strong portfolio showcasing your UX/UI design skills","Expertise in design software such as Figma, and Adobe Creative Suite","Excellent visual design skills with a focus on user-system interaction","Proven experience leading and managing a team of designers","Strong communication, presentation, and leadership skills","Excellent problem-solving abilities with a user-centric mindset","Analyzing stakeholders around the vision of the Digital ecosystem","Be able to prioritize functions and features among websites"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/superside/081b1460-4062-4397-8e41-d6f59ed9b22e"
            }