{
    "id": 18,
    "companyId": 3,
    "title": "Creative Lead (UX/UI)",
    "location": ["Worldwide"],
    "type": ["Full-time"],
    "attendance": ["Remote"],
    "experience": ["7"],
    "salaryMin": 0,
    "salaryMax": 0,
    "salaryFormat": "Unspecified",
    "salaryCurrency": "USD",
    "salaryBonus": "Unspecified",
    "tags": ["UX","UI","Creative Lead","Design"],
    "skills": ["UX/UI Design","Figma","Adobe Creative Suite","Visual Design","Leadership","Communication","Problem Solving"],
    "overview": "Creative Lead (UX/UI) at Superside. Lead and guide a team of UX/UI designers working on strategic projects for global brands. Excellent growth opportunities.",
    "description": "As the UX/UI Creative Lead at Superside, you will have the opportunity to lead and guide our team of UX/UI designers. We work on significant strategic projects for global brands like Meta, Google, Amazon, or Twitch, creating stunning mobile &amp; web apps, landing pages, dashboards, and other digital products. You will work with a globally distributed team of top-talent creatives with plenty of professional growth opportunities. Key responsibilities include leading and mentoring a team of designers, setting the creative vision and standards, managing the design process, and working cross-functionally with other teams. You should have excellent English verbal and written communication skills, a problem-solving mindset, knowledge of front-end languages, and experience in complex design system development. A strong portfolio showcasing your UX/UI design skills and 7+ years of experience as a UX/UI Designer, with 2+ years in a leadership role, are required.",
    "requirements": ["Bachelor's degree in Design, or similar education","7+ years of experience as a UX/UI Designer, with 2+ years in a leadership role","Strong portfolio showcasing your UX/UI design skills","Expertise in design software such as Figma, and Adobe Creative Suite","Excellent visual design skills with a focus on user-system interaction","Proven experience leading and managing a team of designers","Strong communication, presentation, and leadership skills","Excellent problem-solving abilities with a user-centric mindset","Analyzing stakeholders around the vision of the Digital ecosystem","Be able to prioritize functions and features among websites"],
    "applicationUrl": "https://careers.superside.com/uxui-creative-lead"
}