{
    "id": 17,
    "companyId": 3,
    "title": "Design Director Presentation Design",
    "location": ["Worldwide"],
    "type": ["Full-time"],
    "attendance": ["Remote"],
    "experience": ["4"],
    "salaryMin": 0,
    "salaryMax": 0,
    "salaryFormat": "Unspecified",
    "salaryCurrency": "USD",
    "salaryBonus": "Unspecified",
    "tags": ["Design","Presentation Design","Branding","Landing Page Design","Ad and Social Creative","Print Design"],
    "skills": ["Adobe Creative Suite","PowerPoint","Keynote","Google Slides","Figma"],
    "overview": "Superside is hiring Design Directors to lead the creative capabilities of the company and manage a team of creatives. This role focuses on presentation design and collaboration with global brands.",
    "description": "As a Design Director at Superside, you will manage the overall creation, workflow, and output quality of projects. You will provide expertise in presentation design, ensuring high-quality creative output and innovative approaches. This role involves presenting creative work and direction to a wide range of global brands, driving and leading creative excellence in presentation design, and collaborating with dedicated account teams to grow and develop customers. You will also inspire, mentor, and manage a team of creatives and act as a creative-thought leader within the organization. To succeed in this role, you should have a BA or higher within Design, Creative, Comms, or similar fields, along with at least 4+ years of experience as a world-class creative lead in an international top-tier creative agency or in-house design team in a global tech company. You should have a strong portfolio of creative work across multiple capabilities, with a focus on presentation design. Additionally, excellent presentation and design skills using the Adobe Creative Suite, PowerPoint, Keynote, Google Slides & Figma are required, as well as understanding and direction of the use of motion within presentation design to aid in telling compelling stories. You should have an excellent understanding of creative interpretation of data visualization and infographics, along with the ability to quickly learn processes and multi-task projects with great detail. A high level of knowledge and craft to provide top-notch design and direction is expected, as well as the ability to always deliver pixel-perfect quality on time and within budget. Excellent English verbal and written communication skills are required, and experience managing creative projects and leading a high-performing team is a must.",
    "requirements": ["BA or higher within Design, Creative, Comms, or similar fields","4+ years of experience as a world-class creative lead in an international top-tier creative agency or in-house design team in a global tech company","Strong portfolio of creative work across multiple capabilities, with a focus on Presentation design","Excellent presentation and design skills using the Adobe Creative Suite, PowerPoint, Keynote, Google Slides & Figma","Understanding and direction of the use of Motion within Presentation design to aid in telling compelling stories","Excellent understanding of creative interpretation of data visualization and infographics","Ability to quickly learn processes and multi-task projects with great detail","High level of knowledge and craft to provide top-notch design and direction","Ability to always deliver pixel-perfect quality on time and within budget","Excellent English verbal and written communication skills","Experience managing creative projects in their entirety and leading a high-performing team (Designers, Art Directors, etc)"],
    "applicationUrl": "https://careers.superside.com/design-director-presentation"
}