            {
                "id": 30,
                "companyId": 3,
                "title": "Senior Product Manager GenAI & Data",
                "location": ["EMEA"],
                "type": [],
                "attendance": ["Remote"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Product Manager","Data Integration","Generative AI","Product Development","Marketing Performance","Product Strategy","Martech Tools"],
                "skills": ["Data","Generative AI","Product Manager","Prototype","Marketing","Creatives","ML"],
                "overview": "The job is for a Senior Product Manager who will bring to market the integration of Data and Generative AI into products and processes, researching and building products to facilitate the usage of Generative AI for creatives while generating a better understanding of marketing performance.",
                "description": "We’re seeking an enthusiastic and innovative Product Manager to bring to market the integration of Data and Generative AI into our products and processes. 


Reporting to the Director of Product and in collaboration with the Director of Generative AI, you’ll research, prototype and build products that will facilitate the usage of Generative AI for our Creatives while generating a better understanding of marketing performance to our Customers. 


This role is fundamental to pushing our company's creative capabilities into a new era, securing our position at the industry's forefront.
",
                "extras": [{"title":"What you’ll be doing","content":["Lead the ideation,development, and launch of new products and services that leverage Data and GenAI to transform our creative process","Own the new products and services from concept to deployment to post-launch reporting and iterations","Define, execute, and own strategies and the associated roadmaps to deliver on the broader organizational goals for data, ML and GenAI focused products","Maintain a deep understanding of the industry landscape and trends across marketing and advertising, AI and creative tech","Build on existing knowledge of martech tools and ad performance to identify competitive advantages for Superside","Develop and execute product-led growth strategies for data and GenAI products that align with its core functionality","Own the end-to-end user experience, crafting a value proposition that resonates with both internal and external users, focusing on how analytics and Generative AI can augment creative work","Capture user feedback to iterate on the product and prioritize features that resonate most with our target market","Use quantitative and qualitative data to monitor KPIs that measure both feature adoption and commercial targets","Collaborate with engineering, design, and other cross-functional teams to bring data and GenAI products and services to life while also facilitating growth","Write clear product specifications, including user stories, use cases, and acceptance criteria, to guide the development team effectively"]},{"title":"What you’ll need to succeed","content":["3-5 years in product management with a history of developing innovative products, preferably in the martech and/or creative tech sectors","Proven experience taking new products to market incl. driving GTM activities and shipping the whole experience end-to-end","Deep understanding of marketing use cases and experience using a range of martech/adtech tools, preferably with hands-on marketing experience","Demonstrated ability to formulate a product vision that marries innovation with growth.","Strong leadership skills with a proven track record of driving cross-functional teams to meet your goals","Substantial experience owning key product execution tasks including conducting analysis using multiple sources, extracting insights, interviewing users, and writing out product specifications","Exceptional communication skills with the ability to convey complex product features and growth strategies to a varied audience","A relentless focus on user experience and a strong ability to translate customer needs into product features","Familiarity with Project Management tools such as JIRA, Notion, Asana, and design tools like FigmaA growth mindset and the ability to adapt in a rapidly changing environment","Experience with product-led-growth in B2B Saas is a plus"]},{"title":"The opportunity","content":["This is a role for someone excited to bring something from 0 to 1. We currently have a very bootstrap version of the products that we want to develop and take to market. Your first goal will be to make sure these products are working in synergy.","This calls for a senior product manager comfortable with uncertainty, exploration, and short cycle time, this role is for you. As the role is pivotal to our business, it will be very visible to senior stakeholders."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/superside/e74f4636-6065-4243-81f7-0c14a7e1df92"
            }