            {
                "id": 501,
                "companyId": 7,
                "title": "Content Marketing Manager",
                "location": ["Bellevue, WA"],
                "type": ["Full-time"],
                "attendance": ["Hybrid"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Content Strategy","Content Creation","Demand Generation","Messaging and Positioning","Sales Enablement","Content Marketing Experience"],
                "skills": ["Content Strategy","Content Creation","Demand Generation","Messaging and Positioning","Sales Enablement","Content Marketing Experience","Content Creation Skills"],
                "overview": "Educative.io is seeking a dynamic Content Marketing Manager with 3-5 years of experience to drive enterprise revenue growth and implement impactful content marketing strategies for SaaS products.",
                "description": "Salary Range - $80,000-85,000

Job Summary:
Educative.io seeks a dynamic Content Marketing Manager with 3-5 years of experience to join our rapidly growing team. Reporting directly to the VP of Sales & Marketing, this role will be pivotal in driving enterprise revenue growth and charting the course for the next phase of our B2B SaaS expansion.
This is an ideal opportunity for candidates who demonstrate a strong history of successfully implementing impactful content marketing strategies for SaaS products, specifically in engaging engineering leaders and developers within startup and enterprise settings. A profound comprehension of software development, programming languages, platforms, and emerging software trends is crucial for establishing trustworthiness with our target audience.
",
                "extras": [{"title":"In This Role, You Will:","content":["Content Strategy: Collaborate with cross-functional teams to craft and implement a compelling content strategy that resonates with our target audience, showcasing Educative.io's value proposition.","Content Creation: Produce engaging and informative content, including blog posts, articles, case studies, whitepapers, and videos, to support marketing efforts.","Demand Generation: Develop and execute result-driven demand generation campaigns to generate new sales leads, acquire customers, and foster business expansion.","Messaging and Positioning: Define and refine the messaging and positioning of Educative’s enterprise offerings to effectively communicate their benefits to prospective clients.","Sales Enablement: Create sales enablement materials and presentations that empower our sales team to communicate our solutions and close deals effectively."]},{"title":"About You:","content":["3 years of Content Marketing Experience: Demonstrated experience in content marketing, preferably within the SaaS industry.","Content Creation Skills: Exceptional writing and content creation skills, with the ability to produce compelling and persuasive content.","Strategic Thinker: A strategic mindset with the ability to develop and execute marketing campaigns aligned with business objectives.","Technical Aptitude: Strong knowledge of software development, programming languages, and software trends is crucial to engage our target audience effectively.","Team Player: Collaborative and able to work effectively with cross-functional teams to achieve common goals.","Analytical: Proficient in using data and analytics tools to measure the effectiveness of marketing campaigns and make data-driven decisions.","Adaptability: Comfortable working in a fast-paced environment and adaptable to changes and evolving priorities.","Bachelor’s Degree: A bachelor’s degree in marketing, communications, or a related field is preferred."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/educative/b2bde9ac-6b1c-4772-aa65-c1736a40e7a4"
            }