            {
                "id": 536,
                "companyId": 9,
                "title": "Content Reviewer",
                "location": ["Islamabad"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 2,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Copyediting","Proofreading","Line Editing","Collaborating","Readability","Flow","Sentence Structure"],
                "skills": ["HTML","CSS","JavaScript","Python","C++","C#","data structures and algorithms"],
                "overview": "The Content Reviewer position at Educative involves editing and improving content related to computer science, cloud computing, and engineering management, collaborating with subject matter experts, and adhering to editorial and technical quality standards.",
                "description": "Educative is teaching millions of developers around the world through interactive, text-based courses. As a Content Reviewer on the Editorial team, you will edit the content that covers many aspects of computer science, cloud computing, and engineering management. 

Your responsibilities will include:

Copyediting, proofreading, and line editing text-based courses, skill assessments, learning plans, and programming projects.
Collaborating with subject matter experts to ensure editorial and technical quality standards are met.
Improving readability and flow by suggesting changes to improve sentence structure, eliminate redundancy, and maintain consistency in spelling and form.
Presenting editorial concepts to teammates, stakeholders, and content teams.
Supporting adherence to the Educative Style Guide, the Chicago Manual of Style, and coding conventions.

About you:

2+ years of editorial experience OR 2+ years of experience working in a team.
Expertise in editorial practices and conventions.
Excellent written communication skills in American English.
Basic understanding of computer science concepts, such as data structures and algorithms.
Basic understanding of programming languages, such as C++, C#, HTML, CSS, JavaScript, Python, etc.
Strong time management skills, disciplined, goal-oriented, and self-directed.
",
                "extras": [],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/educative/0ebde827-9064-4473-8f1e-41eb63fcf78e"
            }