            {
                "id": 538,
                "companyId": 9,
                "title": "Content SEO Writer",
                "location": ["Lahore"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Content Writer","blogs","ebooks","white papers","long-form content","software developers","engineering managers","inbound marketing","content strategy","technical writing","SEO best practices","organic traffic","subject matter experts","engineering leaders","keyword optimization","search engine results pages","competitor analysis","keyword research","diversity","inclusivity","equity","academic background","English","Journalism","long-form writing","research skills","SEO best practices","editing","SEO","growth-minded","education","learning","teaching","mentoring","technology","software development","computer programming"],
                "skills": ["SEO","Content Writer","Writing","Research","Technical Writing","Inbound Marketing","Content Strategy"],
                "overview": "A Content SEO Writer at Educative writes, edits, and publishes informative, engaging long-form content for a technical audience, applying SEO best practices and conducting research on software development and engineering leadership.",
                "description": "Are you a grammarian? Do you believe that great writing matters, and that great storytelling matters even more? Are you interested in applying your skills to craft informative, engaging content for a technical audience?

If you answered, “Yes,” then read on!

As a Content Writer at Educative, you will write, edit, and publish blogs, ebooks, white papers, and other long-form content to engage Educative’s growing community of software developers and engineering managers.

In this role, you will write. A lot. And in order to develop a working knowledge of the highly technical concepts you write about, you will do plenty of research to immerse yourself into the wide world of software development and engineering leadership. 

As a foundational member of Educative’s content marketing team, you will hone your inbound marketing and content strategy skills, all while building a diverse portfolio of well-researched, highly technical writing.

Above all, you will thrive in this role if you are a passionate writer with a deep curiosity for technology and a desire to develop as a content marketer, technical writer, and storyteller.
",
                "extras": [{"title":"About the Role","content":["In the role of Content Writer, you will:","Write, edit, and publish blog posts, ebooks, white papers, and other long-form content to engage software developers and engineering managers.","Brainstorm, research, and develop article topics that are highly relevant to Educative’s audience AND maximize organic traffic.","Source and co-produce content with outside authors and subject matter experts from across the industry.","Ghostwrite and edit content for engineering leaders.","Learn and apply SEO best practices to ensure all content is keyword optimized and ranks highly on search engine results pages (SERPs).","Stay up to date on trends in software development and engineering leadership, and become an in-house expert on Educative’s core customer personas.","Conduct competitor analysis and keyword research to help Educative stay on the cutting edge of developer learning.","Manage content initiatives from inception to execution—then monitor outcomes and iterate to improve.","Contribute to and help maintain Educative’s content and editorial calendars.","Promote diversity, inclusivity, and equity in the software engineering community through thoughtful, accessible, empathetic content"]},{"title":"Qualifications","content":["1-3 years professional writing experience.","A writing-intensive academic background (e.g. B.A. in English or Journalism).","Exceptional long-form writing and research skills (and samples to prove it)Ability to communicate complex, technical ideas in accessible, digestible ways.","Experience creating content strategically for specific audiencesWorking understanding of SEO best practices.","Meticulous eye for detail, comfortable editing the writing of others (and your own).","Curious, growth-minded, eager to learn.","Self-starter, takes ownership of projects.","Passion for education, learning, teaching, mentoringInterested in the latest trends and developments in technology and software development.","Computer programming experience (or familiarity with coding concepts) is a huge bonus."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/educative/70725978-976f-4022-b1fa-28a27fbbfc86"
            }