            {
                "id": 539,
                "companyId": 9,
                "title": "Design Manager",
                "location": ["Lahore"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Customer Experience","Product Design","User Experience","Design Team Management","Design Culture","Design Systems","Feedback and Performance Evaluation"],
                "skills": ["Product Design","User Experience","Design Systems","Cross-functional","Designers","Design Culture","Design Guidelines"],
                "overview": "The Design Manager is responsible for advocating for the customer experience, leading design across products, managing and mentoring designers, developing design culture, maintaining design systems, and presenting design ideas to cross-functional teams and leadership.",
                "description": "Core Responsibilities

• Your primary role as a Product Design Manager is to advocate for the customer experience (CX).
• You obsess over customer pain points and continually push to make the CX more useful, enjoyable, and accessible.
• Embed within a cross-functional product area and lead design across one or more products – from discovery, definition, and development through to delivery. 
•  Proactively partner with the existing Design team, Product, and Engineering to oversee and align the user experience of Syngenta’s diverse platform and family of products.
•  Manage, develop, coach, and mentor Designers within the team.
•  Inform, mature, and help develop our design culture, ensuring an open and collaborative working environment.
•  Build out, scale, and maintain our internal Design Systems, standards, best practices, and guidelines.
•  Provide regular feedback to your team regarding performance, and help shape and define clear career paths and tangible action plans to achieve them.
• Present and defend your product design ideas to cross-functional teams and senior leadership.
• Follow an existing design system with the latitude to push it further.
• Constantly bring new and impactful ideas and improve the design quality at Educative.
",
                "extras": [],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/educative/2e5dd704-4c51-4a23-891a-0fc2b0f2b544"
            }