            {
                "id": 540,
                "companyId": 9,
                "title": "Manager of Author Acquisition",
                "location": ["Lahore"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": -1,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Author Acquisition","Sales","Remote Team","Growth Mindset","Innovate","Mentor","Content Company"],
                "skills": ["Remote team","growth mindset","think out of the box","mentor","manage","communication","well-organized"],
                "overview": "The Manager of Author Acquisition (Sales) is responsible for mentoring and growing a team to find and recruit Authors to write unique courses that fit Educative's long-term strategy, as well as managing and optimizing a team of Author Acquisition Representatives and Sourcers.",
                "description": "About the Role:

The Manager of Author Acquisition (Sales) is a player-coach role with a remote team, and has an exciting growth trajectory as the team expands. You will need a growth mindset to think big and take bold initiatives. Educative is a fast-paced start-up with ambitious goals and expects leaders to learn from failures and iterate quickly to deliver results.

If you take full responsibility for results, always looking for ways to innovate and think out of the box, then this role is for you. As Manager of Author Acquisition, you will directly impact the company's growth and have the chance to help cultivate and mentor a team.

As a content company, we rely on the Authors who create interactive technical courses for the developer community. Your role as a Manager of Author Acquisition is mentoring and growing a team to find and recruit Authors to write unique courses that fit Educative's long-term strategy. You will build relationships with technical domain experts worldwide through confident communication. Having the ability to learn about different areas of tech quickly is critical. You will also need to be well-organized to manage several authors and support an author acquisition team.
",
                "extras": [{"title":"Core Responsibilities:","content":["Manage and optimize a team of Author Acquisition Representatives and Sourcers responsible for inbound and outbound prospective authors","Refine the sales pitch and process to achieve optimum results","Oversee individual team members' daily activities and quota performance management and strive to exceed key performance metrics","Track metrics and help the team improve by understanding their performance","Cultivate a culture of learning and mentorship with a commitment to the growth of your team members"]},{"title":"New Author Acquisition:","content":["Identify web developers, software engineers, cloud architects, and DevOps engineers with domain expertise in programming languages, frameworks, and engineering topics aligned with our course content strategy","Guide aspiring authors on the Educative platform; explain the business model and course pricing structure; overcome objections, and work with the Educative content and engineering teams to identify and remove technical obstacles to new content","Manage new relationships throughout the closing phase up until the content creation phase"]},{"title":"Ideal Candidate","content":["Experience in mentoring or managing others with a passion for seeing others succeed","Background managing sales or recruiting teams","Experience building relationships with developer communities","Excellent communication and relationship management skills","Proven track record of prioritizing high impact activities and keeping complicated projects moving forward, working with cross-functional teams","Don't shy away from insisting on the highest standards.","Have backbone with the ability to disagree and commit","Self-starter who isn't afraid to roll up their sleeves and get things done","Think big and never settle for \"under commit and over-deliver\""]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/educative/decd72c7-e4e9-46d6-b640-fbd0a8bf8538"
            }