            {
                "id": 524,
                "companyId": 8,
                "title": "People Operations Generalist",
                "location": ["Lahore"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 2,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Onboarding Checklist","New Hire Orientation","Cross-functional Collaboration","Benefits Enrollment","HRIS","Logistics Management","Employee Engagement"],
                "skills": ["HR management","communication","interpersonal skills","attention to detail","organizational skills","confidentiality","team-player"],
                "overview": "The People Operations Generalist role at Educative involves setting up onboarding checklists, managing new hire orientation, improving the onboarding experience, ensuring enrollment into benefits, maintaining employee records, aligning with labor laws, and contributing to employee engagement initiatives.",
                "description": "Company Overview:

Educative is a hands-on learning platform for software developers of all levels. We were founded by industry veterans who understand first-hand the problems developers face staying on the cutting edge of modern technology. Educative's interactive, text-based courses are built from the ground up to teach you the skills employers are looking for. We provide tools like in-browser coding environments and interview-focused assessments to help you practice as you learn.
",
                "extras": [{"title":"In this role, you will:","content":["Set up an onboarding checklist to ensure excellent new hire experience","Managing new hire orientation, including sending first-day logistics, setting up the meeting room, and coordinating with the relevant teams (admin, finance, IT), etc. in order to ensure a seamless transition for new employees","Develop and deliver an engaging new hire orientation and communicate with new hires as they integrate into the company","Collaborate cross-functionally to deliver an effective and consistent onboarding experience","Continually improve the new hire onboarding experience based on employee, leader, and HR feedback, and retention and engagement data and metrics","Ensure enrollment of eligible new hires into the benefits such as insurance program and assisting employees with benefits-related questions","Collaborate with benefits providers to facilitate enrollment and ensure accurate and timely administration","Ensuring new hires are completing the new hire checklist in HRIS and maintaining employee records in our HR system as needed, ensuring accuracy, confidentiality, and compliance","Partner with Office Managers and People Managers on any logistics needing to happen around the office that affects our employees","Work with our People and Culture Manager to ensure our workplace is aligned with country-specific labor laws in regard to hiring, workplace rules, and off-boarding.","Contribute to employee engagement initiatives such as surveys, events, and recognition program","Champion of employee experience, leading by example and fostering a positive and inclusive organizational culture","Analyze exit interviews and employee surveys, analyze data, and make recommendations to management for continuous improvement","Any other duties as needed"]},{"title":"About You:","content":["2+ years experience in an HR department or related roles","Knowledge of all aspects of HR management, principles, and proceduresExcellent communication and interpersonal skills","Strong attention to detail and organizational skills","Ability to handle sensitive information and maintain confidentiality","Team-player and collaborator","Strong bias for action"]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/educative/86d2c738-4eb1-497c-9d21-aef9266c39fc"
            }