            {
                "id": 513,
                "companyId": 7,
                "title": "Senior Technical Content Engineers (Islamabad)",
                "location": ["Islamabad"],
                "type": ["Full-time"],
                "attendance": ["Onsite"],
                "experience": 5,
                "salaryMin": 0,
                "salaryMax": 0,
                "salaryFormat": "USD",
                "salaryCurrency": "per-year-salary",
                "salaryBonus": "Unspecified",
                "tags": ["Technical Content","Technical Courses","Educative","Engineering","Interactive Text-Based Courses","Programming Assignments","Projects","Course Strategy","Platform Capabilities","Internal and External Authors","People Management Skills","Recruiting","Mentoring","Training Sessions","Problem-Solving Skills","Written Communication Skills","Self-Directed","Goal-Oriented","Disciplined","Time Management","Multitasking Skills","Presenting","Programming Languages","C++","C#","HTML","CSS","JavaScript","Python"],
                "skills": ["JavaScript","Python","C++","C#","HTML","CSS"],
                "overview": "Senior Technical Content Engineers (TCE) create engaging technical content and build courses for Educative learners by explaining complex technical topics in a simple and elegant manner.",
                "description": "Senior Technical Content Engineers (TCE) are distinguished by their ability to explain complex technical topics to learners. They create engaging technical content and work with subject matter experts to build courses for Educative learners.

Your responsibilities will include:

Create technical courses:
• Research, plan and create interactive text-based courses with hands-on programming assignments and projects for engineering audiences.
• Review courses created by others ensuring adherence to Educative standards for editorial and technical quality; and effective use of platform features to engage learners.  Deliver feedback with clear and respectful language.
• Monitor technical developments to contribute to course strategy and ensure that Educative courses are responsive to learner needs.

Build expertise on Educative platform:
• Develop expertise on platform capabilities to effectively create courses and guide internal and external authors in fully utilize platform features in courses.
• May recommend product features and enhancements.  Follow recommendation through prioritization, design and implementation.

Develop people management skills:
• Contribute to team development activities, such as campus and experienced hire recruiting, mentoring new team members, leading training sessions, etc.
",
                "extras": [{"title":"About you:","content":["Strong hands-on engineer passionate about learning new programming languages and technologies, with excellent problem-solving skills.","Adept at communicating technically complicated topics simply and elegantly","Excellent written communication skills in English.","Self-directed, goal-oriented, and disciplined","Strong time management and multitasking skills","Confident and comfortable presenting to different types of audiences, large and small","Hands-on experience with programming languages, such as C++, C#, HTML, CSS, JavaScript, Python, etc."]}],
                "requirements": [],
                "applicationUrl": "https://jobs.lever.co/educative/0ee86a3d-2645-4c5e-8c72-6b8f6e68a1d5"
            }